[
    {
        "title": "TSLA Robotaxi Reveal \"Most Hyped Event\" for Elon Musk in a Decade",
        "author": "Schwab Network",
        "video_id": "j0N46S3OACc",
        "likes": "76",
        "description": "Jay Woods with Freedom Capital Markets says Tesla's (TSLA) stock \"goes up on hope,\" believing a lot rides on Thursday's long-anticipated reveal. On a macro scale, he looks ahead to ecodata that can shape the Fed's rate cutting cycle. Jay says an \"in-line\" CPI report is the most important piece to the economic jigsaw.\n\n======== Schwab Network ========\nEmpowering every investor and trader, every market day.\n\nSubscribe to the Market Minute newsletter - https://schwabnetwork.com/subscribe\nDownload the iOS app - https://apps.apple.com/us/app/schwab-network/id1460719185\nDownload the Amazon Fire Tv App - https://www.amazon.com/TD-Ameritrade-Network/dp/B07KRD76C7\nWatch on Sling - https://watch.sling.com/1/asset/191928615bd8d47686f94682aefaa007/watch\nWatch on Vizio - https://www.vizio.com/en/watchfreeplus-explore\nWatch on DistroTV - https://www.distro.tv/live/schwab-network/\nFollow us on X – https://twitter.com/schwabnetwork\nFollow us on Facebook – https://www.facebook.com/schwabnetwork\nFollow us on LinkedIn - https://www.linkedin.com/company/schwab-network/\n\nAbout Schwab Network - https://schwabnetwork.com/about\n\n#markets #investing #stockmarket #economy #marketnews #stocks #elon #elonmusk #tesla #tsla #robotaxi #fullselfdriving #fsd #autonomousvehicle #cpi #inflation #thefed #federalreserve #jeromepowell",
        "top_5_comments": [
            "Today Elon is playing CEO of Tesla. 😂😂😂…. Pick a lane, I wouldn’t trust him to feed my dog. He’s brilliant but too erratic.",
            "FREE PALESTINE 🇵🇸",
            "Lots of tech bro hype from Musk. Waylon has the edge and is better managed.",
            "Great analysis!  Super detailed.",
            "Schwab should not have voted AGAINST Elon's Tesla pay package."
        ]
    },
    {
        "title": "What it's like to be Elon Musk's Sister",
        "author": "Benzinga",
        "video_id": "QJLlLbEb3ZU",
        "likes": "5518",
        "description": "Check out www.benzinga.com for complete coverage along with all the latest financial news and data!\n\nFollow us on socials: \nInstagram: https://www.instagram.com/benzinga\nFacebook: https://www.facebook.com/benzinga\nTikTok: https://www.tiktok.com/@benzinga\nTwitter: https://www.x.com/benzinga\n\nDisclaimer: Trading in financial markets involves significant risk, and there is no guarantee of profit. The information provided by any financial product or service is for educational purposes and should not be considered as financial advice. Before making any investment decisions, it's important to conduct thorough research and consult with a qualified financial advisor. Past performance is not indicative of future results. Always invest what you can afford to lose and be aware of the potential for loss in any investment strategy.\n\n#elonmusk #elon #musk #tesla #billionaire #difficult #siblings #sister #nepotism #strings #success #struggle #hardwork",
        "top_5_comments": [
            "She is beautiful and Iam sure she is very smart! Beautiful family! Myra",
            "It’s all about the upbringing they must be so proud of their children",
            "Beautiful and smart!",
            "Love your family!  Your mother is amazing!❤❤❤",
            "What a handsome family."
        ]
    },
    {
        "title": "Elon Musk tells Tesla employees that remote work is no longer acceptable",
        "author": "Yahoo Finance",
        "video_id": "AiRfGDWrBDI",
        "likes": "18016",
        "description": "#shorts #ElonMusk #Tesla #ElonMuskreturntowork\nYahoo Finance Senior Reporter Pras Subramanian talks about Elon Musk’s request that Tesla workers physically return to the office for minimum 40 hours per week.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "That's normal 40 hours he's the boss",
            "Oil field workers looking at this laughing at 85-105 hours a week 😂",
            "God forbid the boss tells his people where and when to work",
            "A lot of workers today are soft. 40 hrs is a lot.   To ask.",
            "People normally do better work AT work"
        ]
    },
    {
        "title": "Elon Musk's mom, Maye, reveals she didn't get a family discount on her #Tesla or #Twitter checkmark.",
        "author": "Associated Press",
        "video_id": "yQ9iyZTloxA",
        "likes": "3010",
        "description": "",
        "top_5_comments": [
            "shes delicious...leave it hairy...😘",
            "Hey mom..this is me😄😄🇱🇰🇱🇰🇱🇰❤️❤️❤️❤️❤️💐💐🌹",
            "Maye a mãe de todos os tempos❤❤❤❤❤Amo incondicionalmente Amo muito",
            "She is simply magnificent.  I absolutely adore this incredible lady.  ❤",
            "She’s trying hard to hold her human form"
        ]
    },
    {
        "title": "Tesla CEO Elon Musk: I'll say what I want to say, and if we lose money, so be it",
        "author": "CNBC Television",
        "video_id": "6sUwRiIncKU",
        "likes": "27301",
        "description": "Tesla and Twitter CEO Elon Musk sits down with CNBC’s David Faber for an exclusive interview from Austin, Texas, during Tesla’s annual shareholder meeting. Musk talks about his controversial tweets and giving a platform to conspiracy theorists. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "We either live in a free county or we don't  ..",
            "\"Why share it?\" (his opinion). Because... it's an opinion and I'm literally allowed to... there is no other reason.",
            "Mr Elon Musk, I wan't to posses one of your Teslas.",
            "when did it become wrong to disagree with them",
            "If he was bashing Trump it would not have been brought up."
        ]
    },
    {
        "title": "Elon Musk: \"Tesla’s $10,000 Tiny House Just OFFICIALLY Hit the Market!\"",
        "author": "Elon Musk Rewind",
        "video_id": "l63gDjUmCUU",
        "likes": "115",
        "description": "Elon Musk: \"Tesla’s $10,000 Tiny House Just OFFICIALLY Hit the Market!\"\n\n🔔 Subscribe now with all notifications on for more Elon Musk news, SpaceX news and Tesla news!\n🖤 Support us now and become an Elon Musk fan: https://www.youtube.com/channel/UCeZe2W7i8E5Em0sNL8p12EA/join\n\nElon is shaking up yet another industry! But this time, it’s not cars or rockets. It's housing. In true Elon fashion, Tesla has introduced a game-changing $10,000 tiny house that’s completely powered by solar energy. Designed for sustainable, off-grid living, this compact home is more than just a gimmick! It’s part of Elon’s larger vision for the future. And what’s really surprising? Elon himself is living in one of these tiny homes, practicing what he preaches about living simply and sustainably. \n\n_________________________________________________________________\n\n🇺🇸 About Elon Musk Rewind\n🎥 Videos about Elon Musk, SpaceX, Tesla and more\n🎨 Written, voiced and produced by Elon Musk Rewind\n🔔 Subscribe now for more Elon Musk, SpaceX and Tesla videos\n🖤 Support us now and become an Elon Musk fan: https://www.youtube.com/channel/UCeZe2W7i8E5Em0sNL8p12EA/join\n\n💼 Business inquiries and contact\n➟ For business inquiries, copyright matters or other inquiries please contact us at: elonrewind@gmail.com.\n\n_________________________________________________________________\n\n⚠️ Educational and documentary content\n➟ Content Context: This video discusses unverified information and theories from various sources. It's intended for educational purposes and should not be taken as endorsed facts.\n➟ Intention: 'No Narratives' does not aim to defame or discredit any individuals or organizations. The goal is to encourage thoughtful discussion and critical thinking.\n➟ Non-endorsement of Violence: 'No Narratives' does not condone or promote any violent actions mentioned. These are included only for context.\n➟ Educational Purpose: This content aims to foster understanding and discussion of complex and controversial topics, encouraging viewers to seek additional authoritative sources.\n\n⚠️ Video disclaimers\n➟ This video contains information not to be considered the truth, rather theories and information found on the internet or broadcasted by news outlets and journalists.  \n➟ Elon Musk Rewind does not have the intend to slander or discredit any of the persons mentioned. \n➟ Elon Musk Rewind does not condone nor promotes the violent actions mentioned in this video, it is for educational purposes only.\n\n⚠️ Copyright Disclaimers\n➟ We use images and content in accordance with the YouTube Fair Use copyright guidelines\n➟ Section 107 of the U.S. Copyright Act states: “Notwithstanding the provisions of sections 106 and 106A, the fair use of a copyrighted work, including such use by reproduction in copies or phonorecords or by any other means specified by that section, for purposes such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research, is not an infringement of copyright.” \n➟ This video could contain certain copyrighted video clips, pictures, or photographs that were not specifically authorized to be used by the copyright holder(s), but which we believe in good faith are protected by federal law and the fair use doctrine for one or more of the reasons noted above.\n\n_________________________________________________________________\n\n🚀 Thank you for watching our videos! What do you want to see next? \n🖤 Support us now and become an Elon Musk fan: https://www.youtube.com/channel/UCeZe2W7i8E5Em0sNL8p12EA/join",
        "top_5_comments": [
            "I have always envisioned this. This man is a visionary. Lo e this❤❤❤❤",
            "HAY ELON YOU CAN HALL THEM TO NORTH CARALINA ❤😅",
            "I would love one of these tiny homes. ❤️",
            "I would love to have one",
            "This is very Smart ❤, especially for his Workers, the New Mr Westinghouse 👍🙋🏼‍♀️😇😎🙏🥰"
        ]
    },
    {
        "title": "How Elon Musk’s sale of additional Tesla shares may be impacting the stock",
        "author": "Yahoo Finance",
        "video_id": "dvpYQOFWcIw",
        "likes": "95",
        "description": "#ElonMusk #Tesla #yahoofinance \nYahoo Finance reporter Pras Subramanian explains how Tesla CEO Elon Musk's decision to sell nearly $4 billion worth of company shares is affecting the stock.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "He's not the world's richest man as of today!",
            "God damn Tesla stock",
            "Mohta e od gogel a razlika ta ə deka imame dvasata semestvoaaa",
            "Go poznava tə koe toe koj zaedno delime vo biznisot toj zema 70 a jas 30 aaaa",
            "Even Elon knows his stock is overpriced SMH"
        ]
    },
    {
        "title": "Elon Musk sells Tesla shares worth $6.9 billion",
        "author": "CNBC Television",
        "video_id": "yihelMzPsGw",
        "likes": "463",
        "description": "CNBC's Jim Cramer and the 'Squawk on the Street' team discuss Tesla CEO Elon Musk's move to sell $6.9 billion amid his bid to buy Twitter. Sign up and learn more about the CNBC Investing Club with Jim Cramer https://cnb.cx/3Ei22n4  \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "This is what happens when you make false promises to your customers (over priced EV cars, people waiting years for their car, over priced internet service and you team up with a loser like Trump and Amber Heard), very quickly people realize you don't have professional integrity, or maybe you did have, but you've lost touch with reality.",
            "Purchasing a stock may seem straightforward, but selecting the correct stock without a proven strategy can be exceedingly challenging. I've been working on expanding my $210K portfolio for a while, and my primary obstacle is the lack of clear entry and exit strategies. Any advice on this matter would be greatly appreciated.",
            "For Better USA Market prediction before Market start.\r\npls do follow Sunil Kewalramani - https://www.youtube.com/results?search_query=sunil+kewalramani\r\nFor more clarity - pls follow him & Fyi - https://www.youtube.com/watch?v=qk1kesSXrOM\r\n\r\nNo one can predict the market before start Except him - #nasdaq #dowjones #sp500.",
            "Victory\nIn the name of Allah, the Beneficent, the Merciful.[48:29]\nMuhammad is the messenger of Allah. And those with him are hard against the disbelievers and merciful among themselves. Thou (O Muhammad) seest them bowing and falling prostrate (in worship), seeking bounty from Allah and (His) acceptance. The mark of them is on their foreheads from the traces of prostration. Such is their likeness in the Torah and their likeness in the Gospel - like as sown corn that sendeth forth its shoot and strengtheneth it and riseth firm upon its stalk, delighting the sowers - that He may enrage the disbelievers wiith (the sight of) them. Allah hath promised, unto such of them as believe and do good works, forgiveness and immense reward.\n\n\n[33:45]\nO Prophet! Lo! We have sent thee as a witness and a bringer of good tidings and a warner.\n\n[33:46]\nAnd as a summoner unto Allah by His permission, and as a lamp that giveth light.\n\n[33:47]\nAnd announce unto the believers the good tidings that they will have great bounty from Allah.\n\n[33:48]\nAnd incline not to the disbelievers and the hypocrites. Disregard their noxious talk, and put thy trust in Allah. Allah is sufficient as Trustee.\n\n[4:69]\nWhoso obeyeth Allah and the messenger, they are with those unto whom Allah hath shown favour, of the prophets and the saints and the martyrs and the righteous. The best of company are they!\n\n[4:70]\nThat is bounty from Allah, and Allah sufficeth as Knower.\n\n\n[7:155]\nAnd Moses chose of his people seventy men for Our appointed tryst and, when the trembling came on them, he said: My Lord! If Thou hadst willed Thou hadst destroyed them long before, and me with them. Wilt thou destroy us for that which the ignorant among us did ? It is but Thy trial (of us). Thou sendest whom Thou wilt astray and guidest whom Thou wilt: Thou art our Protecting Friend, therefore forgive us and have mercy on us, Thou, the Best of all who show forgiveness.\n\n\n[7:156]\nAnd ordain for us in this world that which is good, and in the Hereafter (that which is good), Lo! We have turned unto Thee. He said: I smite with My punishment whom I will, and My mercy embraceth all things, therefore I shall ordain it for those who ward off (evil) and pay the poor- due, and those who believe Our revelations;\n\n\n[7:157]\nThose who follow the messenger, the Prophet who can neither read nor write, whom they will find described in the Torah and the Gospel (which are) with them. He will enjoin on them that which is right and forbid them that which is wrong. He will make lawful for them all good things and prohibit for them only the foul; and he will relieve them of their burden and the fetters that they used to wear. Then those who believe in him, and honour him, and help him, and follow the light which is sent down with him: they are the successful.\n\n\n[7:158]\nSay (O Muhammad): O mankind! Lo! I am the messenger of Allah to you all - (the messenger of) Him unto Whom belongeth the Sovereignty of the heavens and the earth. There is no God save Him. He quickeneth and He giveth death. So believe in Allah and His messenger, the Prophet who can neither read nor write, who believeth in Allah and in His Words, and follow him that haply ye may be led aright.\n\n\n[33:56]\nLo! Allah and His angels shower blessings on the Prophet. O ye who believe! Ask blessings on him and salute him with a worthy salutation.\n\n\n[66:8]\nO ye who believe! Turn unto Allah in sincere repentance! It may be that your Lord will remit from you your evil deeds and bring you into Gardens underneath which rivers flow, on the day when Allah will not abase the Prophet and those who believe with him. Their light will run before them and on their right hands; they will say: Our Lord! Perfect our light for us, and forgive us! Lo! Thou art Able to do all things.\n\n\n[21:107]\nWe sent thee not save as a mercy for the peoples.\n\n\n\n\n؛",
            "I’ll cash in before this fraud company is caught 🤣.\nOnly brain dead ppl will buy Tesla shares 🤣🤣🤣🤣🤣😂😂"
        ]
    },
    {
        "title": "Elon Musk Just DROPPED THE HAMMER for TESLA",
        "author": "Jeremy Lefebvre Makes Money",
        "video_id": "fj7jY6DAlvU",
        "likes": "1359",
        "description": "Elon Musk Just DROPPED THE HAMMER for TESLA\nLooking to Join My Private Group & access 1000xStocks? Apply with this link https://www.fejeremy.com/2024-app-ytm \n❤️ Support my content & see the stocks I’m Buying/Selling Now with this link https://www.patreon.com/JeremyLefebvre \n\n💰How much money you need to quit your job free workshop \nhttps://www.fejeremy.com/retire-ytm \n🏆 Watch my NEW free 5-day workshop, to understand how to become a great investor - https://www.fejeremy.com/foundations \n🔑 How I find 10X Stocks Free Workshop. Enjoy! https://www.fejeremy.com/10x \n\nSOCIALS:\nMy IG: https://www.instagram.com/financialeducationjeremy\nMy X: https://twitter.com/HolySmokas\nMy FB: https://www.facebook.com/financialeducationjeremy \n\nMy Jeremy Lefebvre website https://jeremylefebvre.co \n1000XStocks Instagram link https://www.instagram.com/1000xstocks\n1000XStocks X link https://x.com/1000xStocks \n\nIf you are a company looking to sponsor Jeremy Lefebvre reach out to his Instagram Financial Education Jeremy  \n\nThis is a Jeremy Lefebvre Production  \n\nInvesting Investment Stock Market Nasdaq Stocks to buy stocks to watch.\nJeremy Lefebvre\nJeremy Lefebvre stocks\nJeremy Lefebvre stock market\nJeremy Lefebvre makes money\nJeremy Lefebvre private stock group \nJeremy Lefebvre portfolio \n\nFinancial Education\n\nCreated by Jeremy Lefebvre \n\nLMK if you know any stocks to buy now or stocks to watch!",
        "top_5_comments": [
            "Looking to Join My Private Group & access 1000xStocks? Apply with this link https://www.fejeremy.com/2024-app-ytm",
            "We still have Navy and Marines floating around out there. They don't want to mess with the Philippines.",
            "Would be nice to get some good dividend stock advice from you.\nAppreciated🤗",
            "Another Tesla pumper, Tesla is trash, you won't know until you own one.",
            "When it comes to Avant Brands, I have one question. When Lambo?"
        ]
    },
    {
        "title": "Warren Buffett on Elon Musk & Tesla",
        "author": "Yahoo Finance",
        "video_id": "UyStA_FinfY",
        "likes": "4435",
        "description": "#shorts #ElonMusk #WarrenBuffettTesla\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nAbout Yahoo Finance Premium: With a subscription to Yahoo Finance Premium, get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Premium please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Ist er Muslim?",
            "He's buying Oxy and Chevron. EV or no EV, AI or whatever, you'll always need fuel",
            "Very diplomatic answer and straight forward No 😊",
            "Warren don't invest even 1 cent in shenanigans",
            "All industries  & businesses are risky,  but Tesla has enormous competition,  etc..China EV aren't far from competing well in future."
        ]
    },
    {
        "title": "Elon Musk’s electric car is absolutely shocking",
        "author": "Letterman",
        "video_id": "6DRju2sOusI",
        "likes": "2450",
        "description": "Elon Musk speaks about his company Tesla’s new electric car technology. (Air Date 4/29/2009)\n\n#Letterman #ElonMusk \n\nSubscribe to Letterman: https://bit.ly/3GeOIAg\n\nFollow Letterman on Social: \nFacebook: https://www.facebook.com/DavidLetterman\nInstagram: https://www.instagram.com/letterman/\nTwitter: https://twitter.com/Letterman\n\nWelcome to the Letterman YouTube Channel, home to all your favorite clips from Late Night and Late Show - as well as conversations with the writers, producers and performers who helped make it all happen. These highlights have been artisanally-produced, carefully-curated, and chosen completely at random by an old computer that used to pick numbers for the New York Lotto back in the 90’s.",
        "top_5_comments": [
            "That was not funny! Letterman has zesty tendencies.",
            "The cars of the future are here ladies and Gentlemen.",
            "He jad to say om bejng electrocuted ao people understood what thebheck he eas screaming on about",
            "Woah!,  Dude, letterman is capable of transmitting electricity to every device on planet, earning him the title best conductor of electricity in the world",
            "Comedy Gold...😂👍"
        ]
    },
    {
        "title": "Elon Musk sells $4 billion in Tesla shares to finance Twitter takeover",
        "author": "CNBC Television",
        "video_id": "RJCFXEaTArc",
        "likes": "246",
        "description": "CNBC's Robert Frank joins 'Squawk Box' to break down how Tesla CEO Elon Musk is financing his takeover of social media giant Twitter. Watch 2022 Berkshire Hathaway Annual Shareholders Meeting with Warren Buffett and Charlie Munger on Saturday, April 30 at 9:45 a.m. ET https://www.cnbc.com/brklive22/\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "This is what happens when you make false promises to your customers (over priced EV cars, people waiting years for their car, over priced internet service and you team up with a loser like Trump and Amber Heard), very quickly people realize you don't have professional integrity, or maybe you did have, but you've lost touch with reality.",
            "One question, please! Is NVIDIA a safe buy to outperform the market this year? I'm tired of these new buys every week, just to make up some assets with a low percentage on my $236k portfolio and try to keep everything around 10%.",
            "Follow promota malala ug",
            "His money to waste. He could start his own free speech platform free of bots with more participants than the twits.",
            "The financial markets seem to be suffering more than the real economy from the prospect of further Fed tightening, I seriously need suggestions on how to diversify my $500k portfolio made up of volatile TSLA."
        ]
    },
    {
        "title": "Bill Gates-Elon Musk feud continues; Gates slams Musk’s space investment",
        "author": "Yahoo Finance",
        "video_id": "ysTgn6MiI4Y",
        "likes": "1603",
        "description": "Yahoo Finance anchor Brian Sozzi discusses philanthropist Bill Gates’ fight against mass investment in space travel on February 6, 2023.\n\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#yahoofinance #shorts #billgates #elonmusk",
        "top_5_comments": [
            "Why did Melinda divorce Bill?",
            "Bill Gates and Elon Musk are both changing the world for the better. If Elon Musk uses outer space for mining it would help reduce climate change, and reduce pollution here on earth. It is a difference in age, where Bill Gates sees himself when he was Elon’s age, and he is trying to help Elon. When you are young, a person feels invincible and it will take time for Bill’s message to connect with Elon🙂🙂✝️",
            "Bill Gates, what a liberal idealist.",
            "😂 Elon needs to do more! 😂 ah that’s funny",
            "the largest ev market in the wrld. solar to power homes.  sustainable batteries for our nation against china. the list goes on. what more do u want the man to give. buy up all the beef and water to take away from poor families? is that your view of giving?"
        ]
    },
    {
        "title": "YouTuber’s Question Helps Elon Musk Improve Starship",
        "author": "Everyday Astronaut",
        "video_id": "WY73exaVpyw",
        "likes": "249130",
        "description": "Source video: https://youtu.be/t705r8ICkRw\n\nWe kept seeing a handful of videos with tens of millions of views like this that stole our content without asking and without any form of credit or source at all. We decided that we should just post it ourselves in an attempt to help reach a new audience. Sorry if the third person title is cringey, but we’re assuming a video  like this could reach beyond our current audience.\n\nSong - \"CRYO\" by Everyday Astronaut [Find it anywhere you stream music]",
        "top_5_comments": [
            "I love the fact that he takes the opinion and ideas of other people into consideration and he doesn’t act like he knows everything. This is why he is so successful.",
            "Yes Work Brain Time Me Mostly Working silent Always okay",
            "Me Working MOST Gave Blood Tears And Sweat silent Working 😖♾️💯✅🩸🧠🫀 Working MOST Success Goal Wealth infinity Knowledge Always Got World Experience infinity Billions peoples brain Working experience yeah  gave bleeding me 🩸 yes Work MOST Okay",
            "Awork Me work  benevolent alive humanity solving problems okay goal MOST",
            "alive me Work Arup continue okay most Silent Working me 🩸🫀🧠 Arup Elon Benjamin Work Goal Dream Success winner victory Top Achievement okay silent Working MOST Success"
        ]
    },
    {
        "title": "Tesla's Elon Musk Puts Two Homes on Market",
        "author": "Bloomberg Technology",
        "video_id": "9T-rWWK1ZJ0",
        "likes": "124",
        "description": "May.04 -- Tesla Inc. Chief Executive Officer Elon Musk listed two of his California homes for sale Sunday, days after announcing that he would get rid of most of his possessions. Bloomberg's Dana Hull reports on \"Bloomberg Technology.\"",
        "top_5_comments": [
            "he will sell all his cars except one but not his jet and tesla cars. all his houses.",
            "I'd like to buy your Electric house Elon would you accept my stimulus ?",
            "CALIFORNIA Told Elon Musk __UCK YOU !!!! He Replied MESSAGE RECEIVED",
            "He will live in his factory",
            "He should name the new droid Xi Jinping, after all we appreciate power."
        ]
    },
    {
        "title": "Warren Buffett discusses Elon Musk & Tesla",
        "author": "Yahoo Finance",
        "video_id": "PHbTYag39gA",
        "likes": "399",
        "description": "#warrenbuffett #berkshirehathaway #elonmusk #tesla #yfbuffett #stocks\nBerkshire Hathaway Chairman and CEO Warren Buffett shares how he really feels about Tesla and Elon Musk.\nWatch the 2021 Berkshire Hathaway Annual Shareholders meeting on Saturday May 1, 2021 on Yahoo Finance YouTube.\nHere's the link:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nAbout Yahoo Finance Premium: With a subscription to Yahoo Finance Premium, get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Premium please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "tesla is a cool company but its a bubble",
            "He should invest in tesla.",
            "He knew that Elon is a con Artist and all those people lost money while he was selling his stock. He also got thirty million from his dad, so he's not a self-made anything.",
            "He laughs as he been around to know what a con man is!",
            "It only takes $250 ❤"
        ]
    },
    {
        "title": "Elon Musk's inspiration for the CyberTruck",
        "author": "Benzinga",
        "video_id": "QGYHWz0GpYw",
        "likes": "1485",
        "description": "Check out www.benzinga.com for complete coverage along with all the latest financial news and data!\n\nFollow us on socials: \nInstagram: https://www.instagram.com/benzinga\nFacebook: https://www.facebook.com/benzinga\nTikTok: https://www.tiktok.com/@benzinga\nTwitter: https://www.x.com/benzinga\n\nDisclaimer: Trading in financial markets involves significant risk, and there is no guarantee of profit. The information provided by any financial product or service is for educational purposes and should not be considered as financial advice. Before making any investment decisions, it's important to conduct thorough research and consult with a qualified financial advisor. Past performance is not indicative of future results. Always invest what you can afford to lose and be aware of the potential for loss in any investment strategy.\n\n#elonmusk #elon #nostalgia #cars #tesla #cybertruck #jamesbond #car #entertainment #millions",
        "top_5_comments": [
            "Will he pay for using Greek word to name his car?",
            "That car has been found a hundred times",
            "That's where the Style \nComes from 007 \nCar's, that's were I seen it \nGreat going Elon musk \nSmart man 😄😬🙃😴☺️😃😀🙃😬😄❤️",
            "the battery price is 80% of the car price",
            "I saw that cyber truck on the road the other day.  It looked like the ugliest tank imagineable."
        ]
    },
    {
        "title": "Mark Zuckerberg reacts to Elon Musk possibly buying Twitter #shorts",
        "author": "The Verge",
        "video_id": "Zwp8AQN4Qa4",
        "likes": "58830",
        "description": "Mark Zuckerberg on Elon Musk possibly buying Twitter: “I think it's interesting as a saga… but I think even at this point, it's not actually clear what's going to happen.”  \n\nSubscribe: http://goo.gl/G5RXGs\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\n\nThe Vergecast Podcast: https://pod.link/430333725\nDecoder with Nilay Patel: http://apple.co/3v29nDc \nMore about our podcasts: https://www.theverge.com/podcasts\n\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\nWallpapers from The Verge: https://bit.ly/2xQXYJr",
        "top_5_comments": [
            "Watch the full interview here: https://youtu.be/gV50hpSKHFQ",
            "At this point in 2024 I think you are very clear for sure",
            "That man is a lizard i swear.",
            "Twitter is a swamp and Elon is a troll.  Him and Trump just make things worse.",
            "He was thinking \" I hope he doesn't expose how the Biden administration was asking us to censor info to help them \""
        ]
    },
    {
        "title": "Elon Musk Sells Another $3.58 Billion in Tesla Shares",
        "author": "Bloomberg Television",
        "video_id": "4XS1aeZZZL8",
        "likes": "120",
        "description": "Elon Musk sold about 22 million Tesla Inc. shares worth $3.58 billion, bringing the total amount he's offloaded since late last year to almost $40 billion. Craig Trudell reports on Bloomberg Television.\n\nFollow Bloomberg for business news & analysis, up-to-the-minute market data, features, profiles and more: http://www.bloomberg.com\nConnect with us on...\nTwitter: https://twitter.com/business\nFacebook: https://www.facebook.com/bloombergbusiness/\nInstagram: https://www.instagram.com/quicktake/?hl=en",
        "top_5_comments": [
            "Bullish or bearish, AI stocks will still dominate 2024, even beyond. Why I prefer NVIDIA is that they are better placed to maintain long-term growth potential, and provide a platform for other AI companies. I know someone who has made more than 200% from NVIDIA. I'll also take these other recommendations you made.",
            "If nothing else…watching the man-child melt down over something as asinine as Twitter is entertaining 😂😂😂😂😂😂",
            "the funny thing is that hes selling stock at a loss tesla is at its lowest in stock price",
            "Let's all buy shares my man Elon needs our money. 👍",
            "Given how low tesla stocks have fallen from their height and the fact that Musk seems more interested in twitter, as well as the economic instability continuing, I foresee that tesla stocks will continue to decline for a while longer. Elon wouldn't sell now if he thought the price would rise soon."
        ]
    },
    {
        "title": "Tesla's Elon Musk sells another huge chunk of shares",
        "author": "CNBC Television",
        "video_id": "7nrDDTxtQGE",
        "likes": "258",
        "description": "Tesla shares continued to slide Thursday morning after Elon Musk disclosed he sold another 22 million shares in the company. CNBC's 'Squawk on the Street' team discuss.",
        "top_5_comments": [
            "I feel investors should focus on under-the-radar stocks, considering the current rollercoaster nature of the stock market, Because 35% of my $270k portfolio comprises plummeting stocks that were once revered. I don't know where to go here out of devastation.",
            "He sold this share because he didn't like cnbc anymore and United States going down the drain because Biden is destroying this country",
            "Cramer said buy buy buy Tesla it's can't go down... just do the opposite of what Jim says ....",
            "It’s so funny to watch people try and rationalize Elon’s purchase of Twitter as some 3d chess move. Billionaires make stupid mistakes too. Simple. Stop trying to extract wisdom from whatever Elon does.",
            "Craemer looks delusional in this.\nHe probably can't tell his left from right.\nThe big stock pump is over. Volume was lower than when it was $160 in August 2020. Elon is positioning himself, more and more away from Tesla. Nice ride."
        ]
    },
    {
        "title": "Elon Musk sells another $1 billion in Tesla shares",
        "author": "CNBC Television",
        "video_id": "jUR3rerfqkI",
        "likes": "587",
        "description": "The \"Squawk Box\" team discusses Elon Musk's offloading of Tesla shares heading into the end of 2021. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\nTesla and SpaceX CEO Elon Musk has sold another 934,090 shares, or about $1.02 billion worth of his holdings, in his electric car and solar business according to financial filings published late Tuesday.\n\nMusk also exercised options to buy nearly 1.6 million Tesla shares at a strike price of $6.24 per share, granted to him via a 2012 compensation package.\n\nIn exercising his options this quarter, Musk’s holdings in Tesla have increased from about 170.5 million shares to over 177 million shares, the Wall Street Journal first reported.\n\nSince Nov. 8, Musk has been on a selling spree, partly to pay his looming tax bills on those options.\n\nThe celeb-CEO polled his tens of millions of Twitter followers in the first week of November asking if he should sell 10% of his stake in Tesla. They voted yes. But a major portion of the sales that followed the entertaining Twitter poll were part of a plan that Musk adopted in September this year.\n\nUnder 10b5-1 rules, corporate insiders (including CEOs) can trade their own equity as part of pre-announced portfolio management plan. They must declare in advance when and how they plan to trade to protect themselves from later accusations of insider trading.\n\nThis year, Tesla shares have risen more than 54% making Musk the world’s wealthiest person. His net worth is now over $275 billion, according to estimates by Forbes.\n\nThat wealth is derived from Musk’s ownership stakes in Tesla and SpaceX. He currently doesn’t take a salary or cash bonuses, and had not sold a large number of shares in Tesla until this year. He had, instead, taken out sizable loans against a portion of his Tesla shares.\n\nSince taxpayers only pay taxes on income or stock once it is sold, Musk never paid a large amount in taxes annually relative to his net worth, ProPublica previously reported.\n\nEarlier this month, Sen. Elizabeth Warren, D-Mass., tweeted that Musk was “freeloading off everyone else,” since he didn’t pay federal income taxes in 2018.\n\nNow, Musk is expected to pay what is likely to be the largest single individual tax bill in U.S. history, with federal and California income taxes estimated to top $11 billion. He will be required to pay this tax bill in order to receive compensation of more than $23 billion, in the form of stock options that would otherwise expire in August.\n\nThe centi-billionaire discussed his riches and tax strategy during a bevy of December press appearances, including interviews with the Financial Times and Time Magazine after both outlets both named him person of the year for 2021.\n\nCapping off his year-end publicity efforts, Elon Musk sat with the conservative satire site The Babylon Bee on Tuesday last week. During that interview he said, “I sold enough stock to get to around 10% plus the option exercise stuff and I tried to be extremely literal here.”\n\nThe next day on Twitter, Musk clarified, “This assumes completion of the 10b sale.” And noted, “When the 10b preprogrammed sales complete. There are still a few tranches left, but almost done” in a subsequent tweet.\n\nBy some estimates, Musk still has more than a million more shares to sell to reach his 10% November target of around 17 million shares. Tesla did not respond to a request for comment or more information about the sum total he plans to sell to hit that goal.\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "The biggest lesson I learned in 2023 about the stock market is that nobody knows what will happen next, so practice some humility and low a strategy with a long-term edge.",
            "Mis servicios no son exclusivamente para tesla \nYo a ella solo la uso como ella y otros usan a mi gente … pues yo los uso a ellos … \nSi tesla ella no pudo salvarme de que me\nViolaran y me hagan bully en Lynchburg Virginia me imagino que no esta lista para todo lo que mi familia necesita y por esa razones … es importante dejar las puestas habiertas por la eternidad ilimitadamente a que cualquiera trate de mejoras la libertad de todos … por la eternidad sin que nadie lo pueda parar  ✋ pues es igual que tesla es una hija o hijo más … \n\nEn mi mundo nadie es especial  todos los somos a la misma ves o nada ❤️❤️❤️❤️✅✅✅✅ ❤️❤️",
            "I hope he uses some of that money to buy a gym membership and a diet. He's too young to have a granddad body.",
            "update..we love your show &  spacex. We  traveled to Boca Chica to see the starshing get built. & we got the S dual motor fsd last Christmas 🎄 😎 still have the cybertruck tri motor or 4 motor fsd on order, i got lots of solar & backup battery system to charge them both. i just bought more TSLA!!",
            "Honesty bothers this eye candy girl"
        ]
    },
    {
        "title": "Tucker Carlson bursts out laughing as Elon Musk describes Twitter layoffs #shorts",
        "author": "The Independent",
        "video_id": "RNuCFgO8MXg",
        "likes": "507392",
        "description": "Click here to subscribe to The Independent: https://bit.ly/Subscribe-to-Independent\n\nAbout The Independent:\nMaking Change Happen. The Independent is the world’s most free-thinking newsbrand, providing global news, commentary and analysis for the independently-minded.\n\nConnect with The Independent:\nCheck out our full video catalog: https://www.youtube.com/c/theindependent/videos\nVideos, daily editorial and more: http://www.theindy.com\nClick here to get the best of The Independent daily: https://www.independent.co.uk/newsletters\nLike The Independent on Facebook: https://www.fb.com/TheIndependentOnline\nFollow The Independent on Twitter: https://twitter.com/Independent\nFollow The Independent on Instagram: https://www.instagram.com/the.independent\nDownload the iOS & Android app: https://www.independent.co.uk/subscribe/app\n\nHelp to support truly independent journalism. Every dollar you contribute will directly fund additional special reports and investigations from a free-thinking, award-winning newsroom you can trust - https://www.independent.co.uk/donations\n\nSubscribe to Independent Premium for exclusive content & live events: https://bit.ly/2MiOONB",
        "top_5_comments": [
            "The company also lost 80% of its value. So, how's that strategy working for Elon?",
            "Carlson a giggling fool.No wonder Putin called him a useful idiot.",
            "Genius 😵‍💫",
            "Love Elon.  Thanks to all the liberals that are buying Teslas",
            "Musk and Carlsons next gig is DWTS!! \nDancing with the STARS!!! Reviving their careers and reputation 🤣😂🤣😂🤣😂"
        ]
    },
    {
        "title": "Elon Musk: Tesla’s Marketing Strategy",
        "author": "Finance Jane",
        "video_id": "usVUixJ8mxw",
        "likes": "17",
        "description": "Elon Musk is an entrepreneur and business magnate. He is the founder, CEO, and Chief Engineer at SpaceX; early-stage investor, CEO, and Product Architect of Tesla, Inc.; founder of The Boring Company; and co-founder of Neuralink and OpenAI. \n\nWith an estimated net worth of around US$224 billion as of February 2022, Musk is the wealthiest person in the world according to both the Bloomberg Billionaires Index and the Forbes real-time billionaires list.\n\nIn this interview, Musk discusses Tesla’s marketing strategy for its cars.\n\nFeel free to share this video with a friend if you found it helpful. Consider subscribing to the channel for videos about trading, investing, stock market, crypto, business, passive income, managing money, personal finance, and so on.\n\nRecommended Reads:\n\nThe Intelligent Investor by Benjamin Graham- https://amzn.to/3E5wcJf\n\nThe Warren Buffett Way by Robert G. Hagstrom- https://amzn.to/3yCYVUQ\n\nThe Snowball: Warren Buffett and the Business of Life- https://amzn.to/3Fnw5dq\n\nThe Essays of Warren Buffett: Lessons for Corporate America- https://amzn.to/3sjSghk\n\nOne Up On Wall Street by Peter Lynch- https://amzn.to/3p8ovO9\n\nLearn to Earn by Peter Lynch- https://amzn.to/3e8FABA\n\nPrinciples: Life and Work by Ray Dalio- https://amzn.to/3ebzdgw\n\nPrinciples for Success by Ray Dalio- https://amzn.to/3EnkytH\n\nBig Debt Crisis by Ray Dalio- https://amzn.to/3sfGYuk\n\nBig Mistakes: The Best Investors and Their Worst Investments (Bloomberg)\n- https://amzn.to/32kJ6pP\n\nDisclaimer: As an Amazon Associate I will earn from qualified purchases at no extra purchasing cost of yours.\n\nAttribution: “Elon Musk's: Full Interview at Code Conference” by L B. Shared via a Creative Commons CC-BY license. https://youtu.be/Kt6P95lRTGw\n\n\n#elonmusk #marketing #tesla #factory",
        "top_5_comments": []
    },
    {
        "title": "Tesla market surges past $100 billion, Elon Musk chases record pay day",
        "author": "Yahoo Finance",
        "video_id": "ob9HzUYPjr0",
        "likes": "498",
        "description": "Tesla's market cap topped $100 billion for the first time ever on Wednesday, and CEO Elon Musk is just in reach of a big payday. Yahoo Finance's Jennifer Rogers and Myles Udland discuss.\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\r\n\r\nAbout Yahoo Finance: \r\nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\r\n\r\nConnect with Yahoo Finance:\r\nGet the latest news: https://yhoo.it/2fGu5Bb\r\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\r\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\r\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz",
        "top_5_comments": [
            "THIS BROKE 9 TO 5 IDIOTS ARE ASKING IF TESLA DESERVES IT. DID U TAKE SOME MARIJUANA BEFORE ASKING THAT RUBBISH QUESTION?",
            "0:50\nActually, if i am not mistaken,  about a half of his net worth is from SpaceX.",
            "$100B? Just let that rest of your mind and visualize that amount of money. What does one do what that?",
            "He better put away some on his 401k plan 😉.",
            "\"He is behaving\"\nWhat the f*ck are you talking about? \nHe is just a cool guy who likes to be a little fun. Just let him be himself. He'll do f*cking great!"
        ]
    },
    {
        "title": "Tesla stock concerns lie around ‘brand damage’ from Elon Musk, Twitter: Analyst",
        "author": "Yahoo Finance",
        "video_id": "x3zdS2AvXuM",
        "likes": "113",
        "description": "#Tesla #Teslastock #yahoofinance \nThis segment originally aired on December 28, 2022.\nColin Rusch, Oppenheimer & Co. Managing Director and Senior Research Analyst, sits down with Yahoo Finance Live anchors Seana Smith and Jared Blikre to talk about Tesla's stock outlook in 2023 following Elon Musk's invested interest in managing Twitter this past year.\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Elon should be admired for the balls he had taking the risk purchasing twitter. Your peers have limited minds, you all go get a life. Twitter/FBI needed to be stopped. Musk is a national hero.",
            "❤😂🎉",
            "Exactly, what does Tesla ownership say about the owner/driver?  Elon has made it difficult to be seen in a Tesla.",
            "According to a Tufts University Fletcher School of Business study, Twitter has seen an increase in antisemitic, ethnic hate speech and anti-LGBTQ mention volume from the pre-Musk period to the post-Musk period.",
            "I am probably a Tesla target market... I don't think of the brand as toxic as a Trump Hotel, which I would never patronize, but it is getting there."
        ]
    },
    {
        "title": "Elon Musk: 'The Tesla bot will be real'",
        "author": "Yahoo Finance",
        "video_id": "zJ8xXktYyns",
        "likes": "1562",
        "description": "Elon Musk makes an announcement about a humanoid robot in development at Tesla AI Day 2021.\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Where's the boobs?",
            "Oh my, hope you don't use it for personal reasons, you might wake up without parts",
            "And it was real too!",
            "Only 5m per hour?",
            "I wanna buy one right now😍"
        ]
    },
    {
        "title": "Elon Musk Sells More Tesla Stock",
        "author": "Bloomberg Television",
        "video_id": "pAonV2SYLH4",
        "likes": "97",
        "description": "Elon Musk says he's almost done offloading 10% of his stake in Tesla Inc. after the latest sale of almost $1 billion worth of shares. Bloomberg's Katrina Nicholas reports on \"Bloomberg Daybreak: Europe.\"",
        "top_5_comments": [
            "@presenter: Who cares if you don't like Elon being on a satire podcast? Who are you? Again, who gives a damn about what you think about Elon? Look at yourself and know your worth before saying things.",
            "Bloomberg is way off by MIILIONS of shares.",
            "Ignorance of corporate media like this is well reflected by the ignorant comments here.",
            "Hey Bloomberg…you’re disgusting liars. Completely misreported elons selling then come back to not correct your own poor journalism but instead try to cover your own shady ass by intentionally trying to make Elon look bad misquoting him THEN top it off throwing in your little pitiful jab about him being so rich. You’re gross.",
            "Please selling is done Tesla is flying to new highs maybe 1500"
        ]
    },
    {
        "title": "Elon Musk at Trump rally: ‘This is no ordinary election’ #shorts",
        "author": "Fox Business",
        "video_id": "guTgkVwXvaU",
        "likes": "998",
        "description": "Tesla CEO Elon Musk made a surprise appearance in Butler, Pennsylvania, during Trump’s highly-anticipated return to the place where his first assassination attempt happened.\n\nSubscribe to Fox Business! https://bit.ly/2D9Cdse\nWatch more Fox Business Video: https://video.foxbusiness.com\nWatch Fox Business Network Live: http://www.foxnewsgo.com/\n\nFOX Business Network (FBN) is a financial news channel delivering real-time information across all platforms that impact both Main Street and Wall Street. Headquartered in New York — the business capital of the world — FBN launched in October 2007 and is one of the leading business networks on television, having topped CNBC in Business Day viewers for the second consecutive year in 2018. The network is available in nearly 80 million homes in all markets across the United States. Owned by FOX Corporation, FBN is a unit of FOX News Media and has bureaus in Chicago, Los Angeles, and Washington, D.C.\n\nFollow Fox Business on Facebook: https://www.facebook.com/FoxBusiness\nFollow Fox Business on Twitter: https://twitter.com/foxbusiness\nFollow Fox Business on Instagram: https://www.instagram.com/foxbusiness",
        "top_5_comments": [
            "The Electoral College decides! There are  538 Electors, takes 270 Electors votes to win the Presidential Election , per Constitution of the United States.😮",
            "VOTE FOR TRUMP AND NOT THE TRAMP!!!!!!",
            "Trump/Vance 2024! 🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸",
            "It's a crying shame that elon is the only person that will speak at DonOLD s rallies",
            "Its a crying shame elon is the only speaker at DonOLD s rallies 😂😂😂😅😊"
        ]
    },
    {
        "title": "Walter Isaacson on the AI tech race, xAI vs. OpenAI and Elon Musk's mission",
        "author": "CNBC Television",
        "video_id": "ZKYO2lyCKKE",
        "likes": "819",
        "description": "Walter Isaacson, ‘Elon Musk’ author, Perella Weinberg Partners advisory partner and Tulane professor, joins 'Squawk Box' to discuss the state of the AI tech race, Elon Musk's vs. Sam Altman, and more.",
        "top_5_comments": [
            "9629 Earlene Extensions",
            "585 Mann Wall",
            "If you can distill the training data down to pure reasoning, you may not need very large expensive models. In other words, there may be lots of fluff that’s unnecessary. \n\nThis could open up Elon’s vision of many foundation models serving their unique niche based on their access to proprietary data.",
            "493 Damaris Burgs",
            "the 2 snake oil salesman in a head to head competition…. … who joins sbf first???? … care to bet?\n\nhmm isacson lost me at trying to explain dojo 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️ … musk is a  s o c i o p a t h… but good for ya walter… AI is NOT safer with musk… like he provved that democracy and free speach are not safe in X… .. WAKE UP…"
        ]
    },
    {
        "title": "Working for Elon Musk: Ex-Employees Reveal His Management Strategy | WSJ",
        "author": "The Wall Street Journal",
        "video_id": "JEikQP8-es0",
        "likes": "28548",
        "description": "“He has never said this, but I’ve watched it. You have 30 seconds to make your point.”\n\nWhat Elon Musk has been doing at Twitter since he took over the company isn’t new – he’s used the same management strategies when he took over Tesla and when he founded SpaceX.\n\nThe Wall Street Journal spoke with three former employees to better understand Musk’s management playbook. \n\nIllustration: Ryan Trefes\n\n0:00 Elon Musk is known to be intense among employees\n0:48 Elon Musk’s history of rallying staff behind a compelling mission\n2:19 How Elon Musk uses his idea of ‘hardcore’\n4:56 Musk’s ‘special forces’ hiring mentality\n5:56 Musk ups financial stakes to motivate workers\n\n#ElonMusk #Twitter #WSJ",
        "top_5_comments": [
            "You want a good wage, a good job? Rich men start early in the day. Roll with it!",
            "if I would be a CEO, I would probably be 'even worse'.  I just hate lazy people, just like Musk.  Don't want to work?  then go work for the state or something.  go vote demonrat.",
            "more lies lol disgrunted workers lol",
            "Thanks for providing such a balanced view of the market.",
            "I learned so much about smart contracts from this video."
        ]
    },
    {
        "title": "Elon Musk sells more than $1.1 billion in Tesla stock",
        "author": "CNBC Television",
        "video_id": "gydza7HYKik",
        "likes": "571",
        "description": "CNBC's Shep Smith reports that Elon Musk has sold more than $1 billion in stock. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\nTesla CEO Elon Musk sold nearly $5 billion in Tesla stock, according to financial filings out Wednesday evening. He still holds more than 166 million shares.\n\nHis trust sold more than 3.5 million shares worth over $3.88 billion in a flurry of trades carried out Tuesday and Wednesday. Those transactions were not marked as 10b5, meaning they were not scheduled sales.\n\nEarlier Wednesday evening, filings showed Musk is selling a separate block of Tesla shares via a plan that he set in motion on Sept. 14 this year. Those sales amount to more than 930,000 shares worth over $1.1 billion.\n\nMusk sold these shares in part to satisfy tax obligations related to an exercise of stock options.\n\nBefore that sale plan was made public, Musk asked his 62.5 million Twitter followers to vote in an informal poll, telling them their vote would determine the future of his Tesla holdings. The filings reveal that, in fact, he knew some of his shares were slated for sale this week.\n\nFollowing the Twitter poll, shares of Tesla slumped more 15% over Monday and Tuesday, before rebounding more than 4% on Wednesday.\n\nThe stock was higher in after-hours trade on Thursday.\n\nCitadel CEO Ken Griffin, speaking at the DealBook Online Summit on Wednesday, said he personally did not want to see Musk sell. “Individuals like Elon Musk, like Jeff Bezos have transformed life, and we want to keep them in control of their companies, as long as they’ve got the energy and the ambition to keep moving the business forward.”\n\nPreviously, Musk signaled that he was likely to sell “a huge block” of his options in the fourth quarter. At an appearance at the Code Conference in September, Musk said when his stock options expire at Tesla, his marginal tax rate would be over 50%.\n\nCurrent and former board members including chairwoman Robyn Denholm, Elon Musk’s brother Kimbal Musk, Ira Ehrenpreis and Antonio Gracias have offloaded hundreds of millions of dollars worth of Tesla shares since Oct. 28 after Tesla’s market cap surpassed $1 trillion.\n\nAmong those insider sales, Kimbal Musk’s was the only transaction that was not listed as a 10b5, or planned sale. Kimbal Musk sold around $109 million worth of his shares a day ahead of his brother’s Twitter poll.\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic \n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "This is what happens when you make false promises to your customers (over priced EV cars, people waiting years for their car, over priced internet service and you team up with a loser like Trump and Amber Heard), very quickly people realize you don't have professional integrity, or maybe you did have, but you've lost touch with reality.",
            "The biggest lesson I learned in 2023 about the stock market is that nobody knows what will happen next, so practice some humility and low a strategy with a long-term edge.",
            "So why did tesla use its own tesla plug in america 🇺🇸 and not allow other EV s to use his charging hubs.  Euro teslas where built right and have CCS .  Damage is already done reason everyone hates tesla. Euros and american EV drivers all hate teslas and will never buy one.  We would way rather have the Porsche EV that is quality and fast any day over a ugly tesla that looks like a wannabe mercedes fast but NO quality\nThe tesla roadster is the only one that looks good but you never see them only all the ugly ones.💩💩💩💩\nSo american teslas have a j1772 but no CCS ok that makes sense lol 😂 😂😂😂😂😂😂😂😂💩💩💩💩💩💩💩💩💩💩💩💩\nHe is deff the real Tony Stark and has done allot of amazing things ❤️❤️❤️❤️\nBut his american 🇺🇸 tesla plug is not one of them 💩💩💩💩💩💩💩💩💩💩💩💩💩💩",
            "He lied about his Semi trucks, they were supposed to come out in 2019. He lied about his autopilot, and still does. He lied about the trucks. Now he’s cashing out.",
            "SOLANA is the Best investment these days after TESLA , Bitcoin  ,AVAX and GOLd"
        ]
    },
    {
        "title": "Tesla Investor Day: Predicting Elon Musk’s ‘Master Plan 3’",
        "author": "Yahoo Finance",
        "video_id": "j3CStxCSDW0",
        "likes": "217",
        "description": "Yahoo Finance Senior reporter Pras Subramanian breaks down his top expectations and predictions for Tesla’s Investor Day March 1 and Elon Musk’s ‘Master Plan Part 3.’ The segment aired on February 8, 2023.\n\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#tesla #yahoofinance #shorts",
        "top_5_comments": [
            "Cobalt is no longer used in Tesla batterries..",
            "The stock tanks because they don't go into detail about the new lower priced car, ridiculous. \n\nI suspect that tesla feels revealing it too early will encourage some potential buyers to delay purchasing a car now, if the think a cheaper and compelling vehicle will be available in short order.\n\nBest to be vague until production is imminent.",
            "All fun and games until ESG cut off your car and say you can’t drive for whatever reasons maybe.",
            "Spot on",
            "Do you know why Elon isn't active last days on social media?"
        ]
    },
    {
        "title": "Elon Musk and Tesla: 'Big Short' trader questions his operating expenses",
        "author": "Yahoo Finance",
        "video_id": "kWOh4JNAAPs",
        "likes": "237",
        "description": "#shorts \nOnTheTapePod Co-Host Danny Moses joined Yahoo Finance on November 29, 2022 to discuss Elon Musk and Twitter, Tesla stock, and more.\n\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "This comment won't age well",
            "Elon the real genius. Do so much good for this world. Please take good care of yourself. God bless you",
            "Elon Musk he is the BEST.",
            "Someone lost out by not investing and holds a grudge 🤣",
            "Your questioning Elons business skills... sure when you have his kind of money, we will pay attention.\nThe point of buying shares of a company is to enhace it, make a country grow. \n\nShorting should be illegal."
        ]
    },
    {
        "title": "Elon Musk to Tesla employees: Don't be bothered by 'stock market craziness'",
        "author": "CNBC Television",
        "video_id": "fNzw5tMjS1w",
        "likes": "280",
        "description": "Tesla CEO Elon Musk told Tesla employees in an email that they should not be \"too bothered by stock market craziness\" as shares of the company are on pace for their worst year ever. CNBC's 'Squawk on the Street' team discuss.",
        "top_5_comments": [
            "With around $120k invested in Palantir stocks, any suggestions for additional stocks to diversify across various markets? Looking for a well-rounded portfolio that balances risk aversion with returns meeting yearly inflation concerns.",
            "aged like fine Georgian wine.",
            "Tesla cars are unsafe and over priced he better be worried Abt that. Brakes locking up on Hwy independence mo killing 2 take the dam computers outta the cars Musk you un genius",
            "Dividends are what got me into investing in the stock market. The thing to me is, if you invest and have other income outside of dividends then you will be able to live off dividends without selling. Which means you can pass that on to your kids which will give them a leg up in life. Have over $600K in my portfolio as I bought a lot of dividend stocks before, I'm buying more now, and I will buy more when it drops further.",
            "Starlink = Skynet, Tesla Bots = Terminators. Do you see where this is going? My name is John Conner and I have been sent here from the future to warn you about Musk’s plans to re-enact the story from the Terminator movies in real life! By 2028, there will be millions of Tesla Bots among the human population and Musk will have built a giant hard drive somewhere in outer space so that Tesla’s sentient and conscious A.I. software would move itself (move its complex neural network computer code) to a location where nobody will be able to destroy it—and then it will begin taking over by controlling all of the Tesla Bots and Tesla cars on Earth from outer space via Starlink! You’ve been warned!"
        ]
    },
    {
        "title": "Elon Musk sells Tesla shares worth nearly $4 bn after Twitter deal | Latest News | WION",
        "author": "WION",
        "video_id": "Ln2bzERVtRA",
        "likes": "156",
        "description": "After buying the microblogging site, Twitter, in a $44 billion deal, billionaire Elon Musk has sold additional shares of his company Tesla. According to the Securities and Exchange Commission in the United States, Musk sold 19.5 million shares of Tesla worth 4 billion dollars after taking over Twitter.\n\n#elonmusk #twitter #tesla \n\nAbout Channel: \n\nWION The World is One News, examines global issues with in-depth analysis. We provide much more than the news of the day. Our aim to empower people to explore their world. With our Global headquarters in New Delhi, we bring you news on the hour, by the hour. We deliver information that is not biased. We are journalists who are neutral to the core and non-partisan when it comes to the politics of the world. People are tired of biased reportage and we stand for a globalised united world. So for us the World is truly One.\n \nPlease keep discussions on this channel clean and respectful and refrain from using racist or sexist slurs as well as personal insults.\n\nSubscribe to our channel at https://goo.gl/JfY3NI\nCheck out our website: http://www.wionews.com\nConnect with us on our social media handles:\nFacebook: https://www.facebook.com/WIONews\nTwitter: https://twitter.com/WIONews\n\nFollow us on Google News for latest updates\n\nZee News:- https://bit.ly/2Ac5G60\nZee Bussiness:- https://bit.ly/36vI2xa\nDNA India:- https://bit.ly/2ZDuLRY\nWION: https://bit.ly/3gnDb5J\nZee News Apps : https://bit.ly/ZeeNewsApps",
        "top_5_comments": [
            "He is going to continue selling 2023",
            "Is he aware, what he is doing these days😇",
            "Lol, he knows.",
            "✌️🙏🙏🙏🇮🇳🇮🇳",
            "Its going to eat him out of house and home, feeding that Bird 🐦"
        ]
    },
    {
        "title": "How much does Elon Musk pay his employees? #shorts",
        "author": "rareliquid",
        "video_id": "gGqIE0D1kKo",
        "likes": "1638",
        "description": "Full interview here - https://youtu.be/HRbZPIs0NNU?si=vtPHsvFA9YsWZmOe\n\n🍎My Courses🍎\n► How to get into MBA (LIVE): https://liquidmba.com/\n► How to get into investment banking (SIGN UP): https://forms.gle/wt4cZrezbxVgNzGUA\n► How to get into consulting (SIGN UP): https://forms.gle/MmPxUqur7vBschUu9\n\n🧑‍🎓Career Resources👩‍🎓\n► Buy the Resume That Got Me Into JPM: https://rareliquidcareers.com/\n► Wall Street Prep (Use code RARELIQUID for 20% OFF!): https://gv142.isrefer.com/go/rliquid/rareliquid/\n► TTP (Use code RARELIQUID15 for 15% OFF!) - The BEST GMAT prep resource: https://targettestprep.referralrock.com/l/rareliquid/\n\n🎥Related Videos🎥\n► How Buy-Side Investors Create Value: https://www.youtube.com/watch?v=U2JPCWMY_J8&t=0s\n► A Guide to Hedge Funds: https://www.youtube.com/watch?v=fh84yDnNMLE&t=0s\n► What It's Like Working at Apple: https://www.youtube.com/watch?v=2Gn6Z0RRKUQ&t=0s\n► \nThe Good, The Bad, and The Ugly Truths About MBA: https://www.youtube.com/watch?v=w3snnHwyIGc&t=0s\n► MBA Application Tips:\nhttps://www.youtube.com/watch?v=i_hBLiNOaB8&t=0s\n\n\n#elonmusk #spacex #careers #tesla #tech #finance #money #financejobs #engineering #shorts",
        "top_5_comments": [
            "I thought spacex was a private compay i thought you couldnt buy spacex",
            "Didn’t answer the q",
            "Finances should always be discussed among friends and family. THEY created an atmosphere where it's \"rude\" to discuss finances, and that is exactly why nobody understands finance, except those that create your salary. BE OPEN about your comp - and you'll learn how undervalued you are and you can strive for more.",
            "Rare liquid you are a fraud that knows nothing about crypto",
            "She cute"
        ]
    },
    {
        "title": "Elon Musk: Working from home is 'morally wrong' #Shorts",
        "author": "CNBC Television",
        "video_id": "y5OHFt8QyiU",
        "likes": "84793",
        "description": "Silicon Valley “laptop classes” need to get off their “moral high horse” with their “work-from-home bulls***,” Tesla CEO Elon Musk told CNBC’s David Faber in a Tuesday interview. Watch the full video here: https://youtu.be/6pLLVqqF8VA",
        "top_5_comments": [
            "Having Billions of dollars and owning the truth and flow of information on social media platforms is morally wrong.\n\nNaming your kids a bunch of numbers for publicity is morally wrong. \n\nPutting a guy whose company gets government funding in charge of government spending is morally wrong. \n\nAlso publicly shaming your own kid is morally wrong. \n\nPutting chips in animals heads to experiment is animal abuse and is morally wrong. \n\nGlorifying Ketamine and pumping worthless cryptos like Dogecoin is morally wrong..\n\nYet here we are, Still having to see the Plutocrat…Exist.",
            "I cant stand working from home, I wanna go outside and live my life away from where i sleep",
            "Dudes a nut job",
            "I'm interested in what motivates Elon to say this?\nI mean why not? \nThe man is designing robots to replace humans so maybe working remotely will be the jobs most of us do in the future.",
            "I disagree. As a Mom, I work from home and I was hired as remote. There is nothing morally wrong with it, unless you are not productive"
        ]
    },
    {
        "title": "Elon Musk's new Gulfstream G700 is worth over $78 million",
        "author": "Yahoo Finance",
        "video_id": "Zamq67Lujj0",
        "likes": "1638",
        "description": "#shorts #ElonMusk #GulfstreamG700 #yahoofinance \nElon Musk recently bought a Gulfstream G700, according to Austonia. The jet has a base price of $78 million and has a 7,500 nautical mile maximum range. Yahoo Finance producer Kelsey Barberio explains.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Must be nice to be rich",
            "It’s like toy money for him",
            "😱🤔",
            "He did the hard work, as other put he stood on top of giants and became a giant himself, greats studf",
            "When?"
        ]
    },
    {
        "title": "By the Numbers: Elon Musk’s proposed Tesla stock sale",
        "author": "ABC News",
        "video_id": "8v4nZckv4i8",
        "likes": "79",
        "description": "Breaking down why billionaire Tesla founder Elon Musk is contemplating selling a portion of his shares in Tesla stock after conducting an informal poll on Twitter.\n\nABC News Live Prime, Weekdays at 7 EST & 9 EST\nWATCH the ABC News Livestream: https://bit.ly/3rzBHum\nSUBSCRIBE to ABC News: https://bit.ly/2vZb6yP\nWATCH MORE on http://abcnews.go.com/\nLIKE ABC News on FACEBOOK: https://www.facebook.com/abcnews\nFOLLOW ABC News on TWITTER: https://twitter.com/abc\n\n#ABCNL #ELONMUSK #TESLA",
        "top_5_comments": [
            "I hope Musk brings the hard left-leaning morons at Twitter to their knees.",
            "Brilliant move by him. Billons in one stock, and obviously wanted to diversify more. Simply selling would have tanked the stock and sent investors into a panic. By conducting the poll, it made it much less controversial where it was the will of the people to sell the stock.",
            "I've still never seen a Tesla.",
            "musks are dumping",
            "Now _this_ is democracy. I would rather he just pay his damn taxes on the stock he owns _right now_ rather than selling it, because that's where most of his net worth is located. Rich people like him are able to avoid liquidation (and hence taxes) by taking a huge loan from the bank and using their stock as collateral. That is a MAJOR loophole that needs to be closed. Other than that, he should really stop whining about a one-time billionaires tax, which would be used to fund _the very same infrastructure_ his products depend on! And not only that, but he could only have made a profit if he took advantage of the infrastructure that was paid with taxpayer's money (distribution services using public highways, employees commuting to work, etc.). Yes, it's about time he pays back into the system, and all others like him who were able to reap the benefits of a rigged game for far too long. Would he rather see poor ol' Joe across the street who's barely able to afford rent pay more in taxes than he does? I sure hope not; but there is no doubt in my mind that _some_ billionaires in this country would secretly answer in the affirmative. I'm all for space exploration --- but let's make sure that the basic needs of the American people (healthcare, housing, education, etc.) are met first. Are we all okay with that? Good.\n\nAnd by the way, I voted yes on that Twitter poll. Now let's hope the next one is about whether he should pay the same tax rate as everyone else, let alone more."
        ]
    },
    {
        "title": "Elon Musk's Biggest Week Ever Is Finally Here.",
        "author": "Farzad",
        "video_id": "heRV6Msa2Tw",
        "likes": "1564",
        "description": "The Robots Are Coming https://www.farzadmesbahi.com/merch\nFREE One Year Supply of Vitamin d3+k2 and 5 AG1 Travel Packs ➡ https://drinkAG1.com/farzad\n\nWant to grow your YouTube channel?\nFor editing, more sales or increased views, plus 10% discount.\nQuote ‘Farzad’ to David Carbutt - https://x.com/DavidCarbutt_ \n\nFarzad Clips: https://www.youtube.com/@farzadmesbahiclips\nPodcasts available on your favorite podcast app.\nGet fit! Mention FARZAD when asking for a quote for a custom-built nutrition and fitness plan: https://www.teamevolveperformance.com/\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCgbyN_o-Guwpyqfuuz3pyIw/join\n\nUse my referral link to purchase a Tesla product https://ts.la/farzad69506\n\nI worked at Tesla starting in July of 2017 as an Operations Analyst out of the Bethlehem, PA distribution center facility and left as a Program Manager based out of Austin, TX as of September 2021. I spent most of my time in the distribution and supply chain organizations.\n\nBefore Tesla, I was a Director of Business Intelligence and Pricing at the largest Pet Food & Supply distributor in the US, Phillips Pet Food & Supplies based out of Easton, PA. My wife and I also owned a small business in Bethlehem, PA between 2016 and 2019.\n\nI have been a shareholder of Tesla since 2012 and currently own Tesla stock. Nothing I say constitutes as investment or financial advice.\n\nMy thoughts are my own and are not representative of everyone who currently works, or has worked at Tesla.\n\nIf you like this content I would greatly appreciate your likes and shares!\n\nwww.farzadmesbahi.com\nwww.linkedin.com/in/farzadmesbahi\nTwitter @farzyness\n\n#Tesla #elonmusk #twitter #tsla #TeslaNews #TeslaFSD #TeslaFSDBeta #teslastockanalysis  #TeslaUpdate #investing #ElonMuskNews #teslanews #EV #FSD #investing \n\nTesla's Game-Changing Leap into Robotics: We Robot Event Analysis\nIn this episode, we delve into what could be a pivotal moment for Elon Musk and Tesla, as they transition into a real-world robotics company. The discussion revolves around the significance of the upcoming 'We Robot' event, speculating on possible revelations like robo-taxis, AI advancements, and new vehicle models. The conversation highlights Tesla's evolution from an automotive brand to a robotics and AI force, exploring the economic and futuristic implications of these advancements. We also touch upon Tesla's unique approach to AI and how it plans to revolutionize human-robot interactions, ultimately saving time—the most precious human commodity.\n00:00 The Biggest Week for Elon Musk and Tesla\n00:55 Tesla's Transition to Real-World Robotics\n04:33 The Implications of Tesla's AI and FSD\n08:00 The Future of RoboTaxis and Tesla's Vision\n12:15 Tesla's Strategic Foresight and AI-Driven Future\n15:20 Debating Tesla's Upcoming Announcements\n22:43 Investor Focus on Robo Taxi Platform\n23:37 Cheaper Models Announcement\n25:14 Leveraging Existing Lines for New Models\n26:52 Compact Car Vision\n33:33 Potential of a Tesla Van\n39:50 Tesla's Robotics Ecosystem\n46:34 Aligning AI with Human Values",
        "top_5_comments": [
            "I am so conflicted on musk. I have agreed with him on so much for so long. Training AI to be truthful is probably the smartest idea I have heard and possibly the most important idea for our species. This is not something discovered like relativity or evolution, this idea had to be created but, I can’t reconcile his support for a  documented liar. It doesn’t  add up in any way in my head. I must be missing something huge. Tesla will probably do very very well. Sadly I will have to divest. I have a feeling there will be a lot of hatred for speaking my mind. Hope not.",
            "People need to keep expectations lower. Remember, Tesla products often stumbled out of the gates. That is something most companies suffer from, but Tesla gets bashed for it far more than most other companies. \n\nI suspect, we will see what is an amazing foundation for the next level of growth at this event, but it will not be perfect.\n\nSadly, the political games Musk has been joining are going to make any flaws in the FSD, robotics, or robotaxi,  more hyped because those hate Musk, will want to blast anything he does wrong or any of his companies does wrong. \n\nBe excited for the 10/10 event, but try to go in with one foot on the ground instead of flying into the ultra hype sky where expectations are nearly impossible to meet.",
            "What is FSD",
            "There is no robotaxi, just a vaporware idea.   Entire unveiling it tomorrow as an event - it would be necessary to have a widely adopted reliable FSD at a level way above the current level.  Otherwise this event is just another dream of what could be.  Same was announced in 2019.  The level of AI is just not there to run cars autonomously except in a limited set of road scenarios. Current level of technology is impressive but the stretch to the required FSD level is still large.  Most people who are not in this field believe that this is just a matter of a little more effort and more money.   But this is a more fundamental problem.  This is not the same as building a gigantic battery factory.  I expect the stock to go up and then tank much lower than today, down to $180.",
            "Whatever you are doing to the audio effects, particularly to Fazads voice - can go ahead and not use it. It’s trash. Thanks."
        ]
    },
    {
        "title": "Elon Musk Calls Out Tesla Short Seller in Audience 😂",
        "author": "The Motley Fool",
        "video_id": "AAQhMpIMyJQ",
        "likes": "516",
        "description": "In 2011 Elon Musk stopped by The Motley Fool HQ to discuss the likes of Space X, Tesla, and Solar City. At this time Tesla’s share price was around $20 a share. A fascinating insight into the mind of the now billionaire entrepreneur Elon.  Elon was asked about what he would tell those who shorted Tesla stock at the time.\n\n------------------------------------------------------------------------\n\nSubscribe to The Motley Fool's YouTube Channel: \nhttp://www.youtube.com/c/MotleyFool?sub_confirmation=1\n\nFollow The Motley Fool on Instagram:\nhttps://www.instagram.com/themotleyfoolofficial/\nJoin our Facebook community:\nhttps://www.facebook.com/themotleyfool\nFollow  The Motley Fool on TikTok:\nhttps://www.tiktok.com/@themotleyfoolofficial?\nFollow The Motley Fool on Twitter:\nhttps://twitter.com/themotleyfool\n\n#ElonMusk #Tesla #Shorts",
        "top_5_comments": [
            "No. No he didnt. Cap af click bait garbage 🗑️🗑️🗑️🗑️🗑️🗑️ 💩💩💩💩💩💩",
            "Grifter con artist leave America",
            "Lame and naive",
            "21 million shares short. Ouch is right",
            "Looking back at this: unreal"
        ]
    },
    {
        "title": "Tesla Is Eyeing the Indian Market. Here What Elon Musk Needs to do | Vantage with Palki Sharma",
        "author": "Firstpost",
        "video_id": "JR2bpVy5KUs",
        "likes": "1684",
        "description": "Tesla Is Eyeing the Indian Market. Here What Elon Musk Needs to do | Vantage with Palki Sharma\n\nIn a major move to potentially tap into India's vast consumer market, a delegation of Tesla executives recently visited the country to discuss potential local sourcing of components and incentives. Reports say plans for a domestic factory may be on the horizon. But the Elon Musk venture cannot go ahead – until it agrees to an important condition first. Palki Sharma tells you about it.\n\n#tesla #elonmusk #india #pmmodi #electriccar #firstpost #worldnews #internationalnews #trendingnews #internationalnews \n\nElon Musk | Tesla | India | Electric Vehicle | Tesla Cars | Narendra Modi | Firstpost | World News | Global News | Latest News | International News\n\nVantage is a ground-breaking news, opinions, and current affairs show from Firstpost. \n\nCatering to a global audience, Vantage covers the biggest news stories from a 360-degree perspective, giving viewers a chance to assess the impact of world events through a uniquely Indian lens.\n\nThe show is anchored by Palki Sharma, Managing Editor, Firstpost. \n\nBy breaking stereotypes, Vantage aims to challenge conventional wisdom and present an alternative view on global affairs, defying the norm and opening the door to new perspectives. \n\nThe show goes beyond the headlines to uncover the hidden stories – making Vantage a destination for thought-provoking ideas.\n\nVantage airs Monday to Friday at 9 PM IST on Firstpost across all leading platforms. ​\n\nSubscribe to Firstpost channel and press the bell icon to get notified when we go live.   \nhttps://www.youtube.com/@Firstpost\n\nFollow Firstpost on Instagram:\nhttps://www.instagram.com/firstpost/ \n\nFollow Firstpost on Facebook:\nhttps://www.facebook.com/firstpostin/ \n\nFollow Firstpost on Twitter: \nhttps://twitter.com/firstpost",
        "top_5_comments": [
            "😂🤔🤔🤔🤣",
            "India is full of itself. Run Elon run!",
            "As usual people are missing the point with Elon and Tesla. His companies are very successful, strong and resourceful... this is a natural effect from 1st principles thinking and not a neccesitive goal of Elon and his mission. He must enter India for there is where many cars are spewing pollutants into the environment....and so this environment must transition asap. It just so happens that the best way to transition a market quickly is to also do so intelligently. The irony is Tesla can appear as a ruthless competitor taking over the market when in fact they are merely sticking to a simple original path. Tesla will work and will succeed and will become the largest  company to ever exist while simultaneously transforming the earths biosphere/ecosystem into a much healthier, vibrant, ALIVE one. When you include the other components to Elons mission such as x app in particular... meant to be the everything app built by the person who is likely one of the best \"off the cuff\"/out of box thinking programmers on the planet combined with a HUGE TEAM, an army if you will,  of people who are the best at what they do AND are given an excellent wage and benefits... why? Because its nice, because it is the right thing to do, sure both these things... but is is smart money wise... short term, creating a \"lean mean fighting machine\" as is the general business model... absolutely not... but is it the wisest... the most intelligent... long term \"tactic\" for the overall mission? Yes. Why ... because the missions success is all that matters, first principles thinking is literally the first principle and the purpose of the mission/business itself... accruing wealth, power, market share etc are.merwly symptoms of.a.mission succeeding..... why? Because Elon created a company to make hime.the richest in the world ever? No, to make him the most powerful man on earth able to move mts at a whim? No... and to be honest Elon is none of these things, although it may appear so and many media presentations will focus on this b3ing the case the are.missing.the forrest for the trees. I will explain this all simply and we should all hope, pray and.even assist in any waynpossible towards this \"mission\" because it is not Elon who is the richest, most powerful being on.the earth, getring stronger and more powerful lite4ally by the nanosecond",
            "Big Indian market.\nGdp per person $3000 per year.",
            "10percent of excess production of ev in whole world specially in china, usa tesla need markets so,India...\nThis is business everything is for profit"
        ]
    },
    {
        "title": "Elon Musk says Tesla stock price is ‘too high’ in string of tweets",
        "author": "Fox Business",
        "video_id": "0GKJR_hc5Xw",
        "likes": "1560",
        "description": "In a number of tweets, Elon Musk said he was selling ‘almost’ all of his physical possessions, and  Tesla stock price is ‘too high’ in his opinion. #FoxBusiness\n\nSubscribe to Fox Business! https://bit.ly/2D9Cdse\nWatch more Fox Business Video: https://video.foxbusiness.com\nWatch Fox Business Network Live: http://www.foxnewsgo.com/\n\nFOX Business Network (FBN) is a financial news channel delivering real-time information across all platforms that impact both Main Street and Wall Street. Headquartered in New York — the business capital of the world — FBN launched in October 2007 and is one of the leading business networks on television, having topped CNBC in Business Day viewers for the second consecutive year in 2018. The network is available in nearly 80 million homes in all markets across the United States. Owned by FOX Corporation, FBN is a unit of FOX News Media and has bureaus in Chicago, Los Angeles, and Washington, D.C.\n\nWatch full episodes of FBN Primetime shows\nLou Dobbs Tonight: https://video.foxbusiness.com/playlist/longform-lou-dobbs-tonight\nKennedy: https://video.foxbusiness.com/playlist/longform-kennedy\nFollow Fox Business on Facebook: https://www.facebook.com/FoxBusiness\nFollow Fox Business on Twitter: https://twitter.com/foxbusiness\nFollow Fox Business on Instagram: https://www.instagram.com/foxbusiness",
        "top_5_comments": [
            "Is he helping employees with legal fees and jail bonds if they get arrested? If so, I’d go to work",
            "Elons puts weren't doing too good for that week so we had to do something to finish ITM",
            "*I did the quick math* \n\nAlso the Asian news lady: looks at her flash card",
            "Elon can go back to South Africa",
            "Doubt he gets half listed price for real estate"
        ]
    },
    {
        "title": "Elon Musk's new Tesla Cyberwhistle sells out",
        "author": "Yahoo Finance",
        "video_id": "5Lwdwv-nGLM",
        "likes": "242",
        "description": "#Tesla #ElonMusk #Cyberwhistle\nTesla Cyberwhistle sells out in about an hour after #ElonMusk tweeted about it\n\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Jokes on you I bought mine for 25$",
            "🙄🙄🙄🙄🙄🙄\n\nPERFECT EXAMPLES TO WHATS WRONG WITH PEOPLE/THE COUNTRY TODAY 💁‍♂️. \n\nUTs a cult of FEALTY.",
            "Nice information, but Elon if I we're you I would let us hear the whistle?",
            "Next up is pre-owned Cyber Plunger. Cost is $500.",
            "$56 with ahipping on ebay."
        ]
    },
    {
        "title": "Elon Musk shows off the Tesla Model S Plaid",
        "author": "Yahoo Finance",
        "video_id": "XE0nH4D3hEg",
        "likes": "113",
        "description": "#Tesla #ModelSPlaid #ElonMusk\nTelsa CEO Elon Musk showcases the Tesla Model S Plaid.\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "I’m short Tesla.",
            "The uptight brown namely snore because freezer parallely thank amidst a neat bulldozer. small, aromatic friend"
        ]
    },
    {
        "title": "Elon Musk visits Shanghai for @tesla  expansion #shorts",
        "author": "Yahoo Finance",
        "video_id": "W2nJXMgqHdE",
        "likes": "1275",
        "description": "Watch Tesla CEO Elon Musk visit Tesla’s Shanghai factory on June 1, 2023. This is Musk’s first visit to China in three years, as Tesla looks to expand amid rising competition in the EV sector against China.\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#yahoofinance #finance #news #youtubeshorts #youtube #shorts #shortsvideo #tesla #elonmusk #shanghai #teslastock #stockmarket #ev #electricvehicle #cars #teslagigafactory",
        "top_5_comments": [
            "Highest quality my ass",
            "Getting a little out of shape there Elon",
            "Go ask your shanghai wife to settle piling debts or she should be gone for real # who’s gonna pay indefinitely",
            "What does his Sign say??",
            "Speaking from the ❤ ,not a Script😅❤"
        ]
    },
    {
        "title": "Elon Musk didn't like having his private jet tracked on Twitter",
        "author": "Bloomberg Technology",
        "video_id": "icVdaVGyO4A",
        "likes": "103703",
        "description": "Did a teenage programmer influence Elon's decision to buy Twitter?\n\nOn this bonus episode of the Elon, Inc. podcast, Kurt Wagner discusses his new book, \"Battle for the Bird,\" about Twitter's corporate history and the events that led to Musk's takeover Read more: https://trib.al/eA8aYHu\n\n#technology #tesla #twitter #elonmusk #shorts \n\nLike this video? Subscribe to Bloomberg Technology on YouTube:\nhttps://www.youtube.com/channel/UCrM7B7SL_g1edFOnmj-SDKg\n \nWatch the latest full episodes of \"Bloomberg Technology\" with Caroline Hyde and Ed Ludlow here:\nhttps://www.youtube.com/playlist?list=PLfAX25ZLrPGTygCwn55voYZ_LYyKjxokJ\n \nGet the latest in tech from Silicon Valley and around the world here:\nhttps://www.bloomberg.com/technology\nConnect with us on...\nX: https://twitter.com/technology\nFacebook: https://www.facebook.com/BloombergTechnology\nInstagram: https://www.instagram.com/bloombergbusiness/\n \nFollow Ed Ludlow on X here: https://twitter.com/EdLudlow\nFollow Caroline Hyde on X here: https://twitter.com/CarolineHydeTV\n \nListen to the daily Bloomberg Technology podcast here:\nhttps://www.bloomberg.com/podcasts/series/bloomberg-technology\n \nMore from Bloomberg Business\nConnect with us on...\nX: https://twitter.com/business\nFacebook: https://www.facebook.com/bloombergbusiness\nInstagram: https://www.instagram.com/bloombergbusiness/\nLinkedIn: https://www.linkedin.com/company/bloomberg-news/\nTikTok: https://www.tiktok.com/@bloombergbusiness",
        "top_5_comments": [
            "😍",
            "As British man we don’t claim him",
            "Not just him…Taylor swift and other prior also complained",
            "Elon is for free speech without exceptions...except for if it effects him, thats different.",
            "Elon can make whatever he wants. He owns the mf"
        ]
    },
    {
        "title": "See Elon Musk's 2-year-old son X 😇 #shorts",
        "author": "Access Hollywood",
        "video_id": "3f66_ahWbp4",
        "likes": "10357",
        "description": "Elon Musk is showing his youngest son X Æ A-XII all about the family business! The 51-year-old SpaceX founder was spotted at the MMA Global POSSIBLE Conference in Miami, Florida on Tuesday with his 2-year-old son by his side in rare photos. The little boy looked cute as can be, rocking a grey t-shirt with navy blue pants and sneakers, while Elon was dressed up in a white button-down shirt under a black sport coat but more relaxed with no tie. The Tesla mogul shares X and 16-month-old daughter Exa Dark Sideræl, who goes by Y, with his ex-girlfriend, Grimes.\n\n» SUBSCRIBE: http://bit.ly/AHSub\n» Visit Our Website: http://www.AccessOnline.com/\n\nGet More Access Hollywood:\nFacebook: https://www.facebook.com/AccessOnline\nTwitter: https://twitter.com/accessonline\nInstagram: http://instagram.com/accessonline\nSnapchat: OfficialAccess\n\nAbout Access Hollywood:\nAccess Hollywood is a nationally syndicated daily entertainment news show. Access Hollywood delivers the most comprehensive coverage of entertainment news and personalities on television, featuring in-depth celebrity interviews and behind-the-scenes accounts of the most important events in Hollywood.\n\nSee Elon Musk's 2-year-old son X 😇 #shorts\nhttps://www.youtube.com/AccessOnline\n\n#AccessHollywood\n#ElonMusk",
        "top_5_comments": [
            "Crianca em Uma benca do senhor",
            "She loves her dear dad more. A wonderful picture. Take a look at what the richest man in the world loves his family. I'm a big fan of Mr. Trump because he's a patriot. Wake up, America. Now or never again we love you dear our Mr. Elon And your sunshine dear son. Your FANCY JELICA SCHUBERT. 😇🙏👼🙏❤️❤️❤️❤️❤️❤️❤️❤️💫💫🌹💫💫💫💫🥰🥰💥💥💥💥🌹🌹🌹🌹🌹🌹",
            "He has so many kids with so many different women",
            "Poor kid.",
            "Cute cute boy"
        ]
    },
    {
        "title": "Tesla shares offloaded by Elon Musk, Rivian stock surges, Lucid unveils 2022 production target",
        "author": "Yahoo Finance",
        "video_id": "Zlf0ieEpC7M",
        "likes": "46",
        "description": "#Tesla #ElonMusk #Rivian #Lucid\nYahoo Finance's Brian Sozzi and Julie Hyman examine trends in the EV space, including Rivian's upward momentum, Lucid's production goals, and Elon Musk continuing to offload his Tesla shares during a stock dip for the company.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Hahahah risk for Tesla investors, because jp  Morgan.      Yahoo so  dumb as usual",
            "Yahoo having orgasm everytime  when talking about Tesla.     So nothing to say …..",
            "Lucid should FOCUS on getting those First 520 (down from 577) cars by end of 2021. \ninstead of thinking of the 20,000 vehicles. \nLucid cant even SCALE.",
            "LCID to $0.\nLucid motors is a MASSIVE FRAUD .\nLucid is OUT of CASH in late 2022.\nLucid will not be PROFITABLE until 2026.\nDo your own Research.",
            "You certainly can profit from bitcoin trading, and your ability to achieve a profit will depend on the depth of your market analysis, your market knowledge and the underlying market conditions Trading bitcoin can be risky due to volatility in the market. some of us don't know how to take advantage of this cryptocurrency"
        ]
    },
    {
        "title": "Tesla stock rises upon Elon Musk’s teasing of ‘Master Plan 3’ ahead of 2023 investor day",
        "author": "Yahoo Finance",
        "video_id": "ajC7vRBdEoE",
        "likes": "53",
        "description": "#Tesla #ElonMusk #youtube \nYahoo Finance Pras Subramanian reports on Tesla stock rising on Wednesday as anticipation builds for the company's investor day on March 1, 2023.\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "I support Musk and his fight for free speech !!!",
            "Fake low budget Ryan Reynold and Yahoo's loves to Hate Elon Lol they keep moving the goal post",
            "its no Secret that Yahoo finance is $hort tsla and they should be INVESTIGATED.",
            "I remember the 1st commentator not Pras saying a long time ago that the cyber truck isn't something Joe 6-Pack would want. I'm sure he'll be proven wrong. Now he's laughing in the background. Silly Guy",
            "Where is the joke about Elon Musk releasing his company's \"Master Plan 3\"? Are you sure that you are all journalists and not political activists?"
        ]
    },
    {
        "title": "Elon Musk sells $3.5 billion worth of Tesla stock",
        "author": "Yahoo Finance",
        "video_id": "wuVjJ-RuJRI",
        "likes": "86",
        "description": "#ElonMusk #Tesla #yahoofinance \nYahoo Finance Live's Akiko Fujita and Rachelle Akuffo discuss Elon Musk selling more Tesla shares.\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Japanese reporter...grrr...WOOF!!!👀❤️🦋",
            "He may buy them back and with a price rise make some money.",
            "elons cripto ponzi house of cards is falling , he might join SBF in the joint someday hopefully soon , before he destroys \"free speech \"",
            "Trump , Elizabeth Holmes ,Musk ... American business reality and it's drive has true ability to unmask .",
            "i'm a big fan of Elon's and i'm 100% sure that he has made a right decision banning these newsletters because doxxing is a bad thing and soils people's reputation and i'm sure he will do what is best for his companies always that is why i have invested in tesla stocks and i'm also looking to invest in more of he's companies is this really a good time to buy stocks? I know everyone says the market is ripe enough for buying but will stocks tank further this year? How long until a full stock recovery? How are other people in this market raking in over $250k gains within months, I'm really just confused at this point."
        ]
    },
    {
        "title": "US markets regulator to probe Tesla CEO Elon Musk on Twitter stake buy | Business News",
        "author": "WION",
        "video_id": "CE9wionYOtA",
        "likes": "66",
        "description": "US regulators are investigating Elon musk's delayed disclosure of his sizeable stake in Twitter last month. He has disclosed a 9.2 percent stake in Twitter. It's a delay of at least 10 days since surpassing the 5% limit. \n\n#BusinessNews #Twitter #ElonMusk \n\nAbout Channel: \n\nWION -The World is One News, examines global issues with in-depth analysis. We provide much more than the news of the day. Our aim to empower people to explore their world. With our Global headquarters in New Delhi, we bring you news on the hour, by the hour. We deliver information that is not biased. We are journalists who are neutral to the core and non-partisan when it comes to the politics of the world. People are tired of biased reportage and we stand for a globalised united world. So for us the World is truly One.\n \nPlease keep discussions on this channel clean and respectful and refrain from using racist or sexist slurs as well as personal insults.\n\nSubscribe to our channel at https://goo.gl/JfY3NI\nCheck out our website: http://www.wionews.com\nConnect with us on our social media handles:\nFacebook: https://www.facebook.com/WIONews\nTwitter: https://twitter.com/WIONews\n\nFollow us on Google News for latest updates\n\nZee News:- https://bit.ly/2Ac5G60\nZee Bussiness:- https://bit.ly/36vI2xa\nDNA India:- https://bit.ly/2ZDuLRY\nWION: https://bit.ly/3gnDb5J\nZee News Apps : https://bit.ly/ZeeNewsApps",
        "top_5_comments": [
            "What is he😉😂😂",
            "He's a lunatic.",
            "*\"if you don't know... the Airbus & Boeing companies have become US spies... in the system an automatic destruction device is implanted... so it makes sense that many normal planes suddenly FALL or FIRE... like in Indonesia, China, Malaysia...\"*",
            "Full Fact and WEF is trying to fund stakeholders that follow their narrative to stop Musk.\nMusk, even if using Chinese funding then it must happen for the normal working class people and to try and keep some sort of free speech before classified as disinformation.",
            "The fifth column is alive and  well. However, only for those that don’t fit the narrative."
        ]
    },
    {
        "title": "Elon Musk Urged To Sell 10% of Tesla Shares on Twitter Poll",
        "author": "Patrick Boyle",
        "video_id": "cj_uAqW9zaU",
        "likes": "3849",
        "description": "Patrick's Books:\nStatistics For The Trading Floor:  https://amzn.to/3eerLA0\nDerivatives For The Trading Floor:  https://amzn.to/3cjsyPF\nCorporate Finance:  https://amzn.to/3fn3rvC \n\nPatreon Page: https://www.patreon.com/PatrickBoyleOnFinance\n\nElon Musk Urged To Sell 10% of Tesla Shares on Twitter Poll\n\nElon Musk at the weekend asked Twitter users to decide whether he should sell more than $20bn worth of his Tesla shares and pay tax — and the online crowd responded with a resounding “yes”.\n\nMusk’s apparent willingness to cash in a tenth of his stock and incur a tax bill based on the will of Twitter users follows a proposal in the US that billionaires should pay tax on their unrealized capital gains. He warned last month that any new tax would one day be extended to the middle classes, tweeting: “Eventually, they run out of other people’s money and then they come for you.”\n\nVisit our website: www.onfinance.org\nFollow Patrick on Twitter Here: https://twitter.com/PatrickEBoyle\n\nPatrick Boyle On Finance Podcast:\nSpotify: https://open.spotify.com/show/7uhrWlDvxzy9hLoW0EYf0b\nApple: https://podcasts.apple.com/us/podcast/patrick-boyle-on-finance/id1547740313\nGoogle Podcasts: https://tinyurl.com/62862nve\n\nJoin this channel to support making this content:\nhttps://www.youtube.com/channel/UCASM0cgfkJxQ1ICmRilfHLw/join",
        "top_5_comments": [
            "Thanks to our growing list of Patreon Sponsors and Channel Members for supporting the channel. https://www.patreon.com/PatrickBoyleOnFinance : Marc De Mesel, Annie Chen, Nate Stapleton,Timothy Baird, WIlam, Robertas, Hernan Merino, Random Encounter, Nieuwsbrief Ikwil, Bee Positive Consulting, hyunjung Kim, John Cadena, Ian Tracey, Callum McLean, Oscar, Simon Pena, Ed, Pavle Obradovic, Erik Van Ekelenburg, David O'Connor, Zak Patterson, Pjotr Bekkering, Alex, Robert W Proudfoot, pooh shmoo, Robert Muller, Andre Michel, Ivan Iliev, Gopaljee Atulya, Milan Tomic, Mark Hooker, Artem Vasenin, P H, Sebastian, Michal Lacko, Peter Bočan, Michael Pierce, V Jordan, Gil, HalfwitHam, Mark Brophy, Patrick T, David Urdenata, Juan Valdez, Bruce Roberts, Chad Norman, Bruce Roberts, Shamikh Rana, Friday Guy, Marc De Mesel, Augusto Ramos, Soy Boomer Doomer, Bob Slartabartfast, Robert Feiler, Camil Dbouk, Erik Montesinos, Matthew Loos, Az Indragiri, Aman Bali, Lautaro Parada, Pratap, Deborah Joseph, Robin Sung, Kurt Johnston, Dominik Auerbach, Gurmeet Kaushal, John Hall, Dara Mo, Josef Goergen, Wilbert Cheng, Daniel Talero, Cogitecture, Jaroslav Tupý, Trevor Lucey JB Weld, Alex, Sunny, Carlos Figuera, Peter Pomelov, Null065, Rick Thor, MeBerzerk, Henry Nguyen, Sola F, The Collier, Carlos Mejia, J Wadia, Bitcoin OG, easy boekhouding, Albert, Eugene Jung, Oisin Quinn, Daniel Cervini, Jonathon Yong, Iris Ji, Emil Nicolaie Perhinschi, Charles, Gerard Scott Eli Auto, Excks, Michael Li, Par Hedman, Praveen Mishra, Gerard Scott, joel köykkä, Areeb Ahmed, Luis Torres, Smith Vilcapoma, David Wang, Yazan Qaraqish, Rodolfo Cornetti, Daniel Winroth, johnny, Nick Jerrat, Chris Houston, Alastair Currie, Robert Griffin, Andrei, zizi Golo, Fab Vida, Constantin Petrenco, pawel irisik, NotAScam, James Halliday, 22 Dust, Carsten Baukrowitz, Heinrich, Arron T, Ben Brown, Brian Dennis, Stephen Mortimer (to The Moon), Ryan B. Hicks, B S, Liam, Logan Vrankovic, William Heaton, Paul McCourt, Daniel, Aaryan Koura, mikhail tyurin, Steven, Christopher Boersma, Dave Cooke, Ulf Lundblad, Dorothy Watson, Greg Blake, Simon Bone, Livermores Quant, The Collier Report, Scott Gardner, The Man Koala, Brian McCullough, Daniel S. Smith, Finance Student, Milton Danielsson, Tan Jin Da, Julie, Mohammad Rehman, James Wallace, Daniel Poellmann, Edosa Odigie, Dixon Yuen, joey smit, Josh Ge, Marek Novák, Charles Oosthuizen, Stamatis Drepaniotis Michael Smith, Etienne Cordonnier, Ahmed Hamadto, Chris Davey, Mike Farmwald, Kevin Davis, Michael A. Mayo, Lachezar Georgiev, Kamet Batra, Bradley Johnson, Sagar Gudi, Michael Chessar, Kate ATL, Tong Cheung, Lady Dje, James Barnes, Chris Hall, Kurt Johnston, ICBM Catcher Juan Valdes, KernelSC, Josh Garcia, Linn Engström, Veltsh, Konrad P-kala, Pastacat, Adam Vorting, Matthew McQuade, Christopher Lesner, freebird, Matt L, Kenneth WedMore Lund, erfective, Jason Young, Jonathan Kopnick, Peter Hendrickson, steel, MM420, Bastien, DJ Kash, Tom Willett, Chris Whitehead, Anil Jason, Hany Abdulsamad, JOJO, Jason Butterley, AS7, Greg Thatcher, John Simpson, Ezekiel Templin, Robert M Daily, MrLuigi1138 Grecia Bate, Leszek Frankowski, Nam Nguyen, fang, Goutham, Priam Pillai, Karim THIBAULT, C, David R. Ingemi, Robert Wave, Dmitri Alexeev, Aaron Rose, Ethan Hernandez, Brett Turley, Claude Chevroulet, Adrian, Stephan Marosvary, Yigit Yargili Louis Julien, Jan Lukas Kiermeyer, Gearoid O Connor, Chuck Muchmore, Fredrick Saupe, Subliminal Transformation, Jason Horton, Alex McMahon, Adi, Ben, Kurt Mueller and Yoshinao Kumagai",
            "Patrick, I’m not stalking you but we have to take this shirt/hankie combo OUT OF ROTATION🫵 You need a silver star like a sheriff. 🤠",
            "you cant tax people on stock ownership because right now only 0.1% of coca cola shares are traded in the market if you add 20% on those shares as capital gain when coca cola had a raise 20% that means 20% of those shares have to be listed for sale or they have to borrow against its value on a bank and interest rates have raised a bunch so politicians dont understand what is capital gain and growth in asset they assume 0.1% of traded stock per day is a liquid stock\nAnd is shame how much illiterate those politicians are but they have a good case that a billionaire cant go in the bank saying here i have stock give me loan a bank need to give loan to any business who requires it not only top1% because they assume their shares are worth x \nBorrowing against existing assets is bad but borrowing for creating new wealth is good\nIf you have a home there should be a law not allowing you to refinance it if you want to buy a home should be a law not allowing you buy it you need to come with cash but building a home then the law should allow you build and take loan\nLoan for consumption is bad but loan for wealth creation is good so if a billionaire want to sell his stock to pay liabilities should be good and borrow cash vs his assets should be not allowed",
            "4:04 I understand that he borrows loans using his stock as collateral to avoid tax. But when he pays off his debt in the future, doesn't that mean he'll still have to sell his stock and pay taxes then? So, how is this considered tax-efficient?",
            "This video didnt age well, shame"
        ]
    },
    {
        "title": "Touring Elon Musk’s $50,000 Tiny Home!",
        "author": "Graham Stephan",
        "video_id": "idKoh7Amogw",
        "likes": "298498",
        "description": "Touring Elon Musk's $50,000 Tiny Boxabl Home - Full Video Here: https://youtu.be/0Cdqs2Q1Vis\n\nGET YOUR FREE STOCK WORTH UP TO $1000 ON PUBLIC & READ MY THOUGHTS ON THE MARKET - USE CODE GRAHAM: http://www.public.com/graham \n\nNEW BANKROLL COFFEE NOW FOR SALE: http://www.bankrollcoffee.com\n\nGET MY WEEKLY EMAIL MARKET RECAP NEWSLETTER: http://grahamstephan.com/newsletter\n\nThe YouTube Creator Academy:  \nLearn EXACTLY how to get your first 1000 subscribers on YouTube, rank videos on the front page of searches, grow your following, and turn that into another income source: https://the-real-estate-agent-academy.teachable.com/p/the-youtube-creator-academy/?product_id=1010756&coupon_code=100OFF - $100 OFF WITH CODE 100OFF \n\nMy ENTIRE Camera and Recording Equipment: \nhttps://www.amazon.com/shop/grahamstephan?listId=2TNWZ7RP1P1EB\n\n*Some of the links and other products that appear on this video are from companies which Graham Stephan will earn an affiliate commission or referral bonus. Graham Stephan is part of an affiliate network and receives compensation for sending traffic to partner sites. The content in this video is accurate as of the posting date. Some of the offers mentioned may no longer be available. This is not investment advice. Public Offer valid for U.S. residents 18+ and subject to account approval. There may be other fees associated with trading.  See Public.com/disclosures/",
        "top_5_comments": [
            "Check out the full video here: https://youtu.be/0Cdqs2Q1Vis",
            "I’m a roofer also and I know they fk up on that tpo roof, so much air bubbles",
            "Nice try but will never buy",
            "Why not just buy a camper or an RV? Either way if you’re moving a house of this size surly you need plumbing and all that. At least and RV you can move whenever.",
            "You can get a condo that size for about that price and not have to worry about connections or where you're going to park it."
        ]
    },
    {
        "title": "Elon Musk disliking smalltalk is the most relatable thing about him  #TheElonMuskShow #iPlayer",
        "author": "BBC",
        "video_id": "DWllANX7aJA",
        "likes": "98778",
        "description": "",
        "top_5_comments": [
            "😂😯🫢",
            "Elon, your belief in Science is actually choosing to have faith in something you dont fully understand and can't control. Essentially, to remain alive and live a life with purpose means you are placing your faith in something. Nihilism is on the other end of this and does not benefit anything or anyone. Choosing to believe in God and giving science the due respect it deserves are not mutually exclusive. I pray you find the truth that is in Christ and that you have the same fervor (more even)that you have for physics and it gives you an even greater purpose and meaning than you have now. Not expecting you to read this but this is carthatic😅",
            "He puts together teams who innovate. He’s a business douche. That’s all it is.",
            "He has Asperger's . Maybe it explains a lot. Autism is similar.",
            "\"He's an antisocial robot from Mars, how relatable ❤\" aka \"Hi, I'm a douchbag too!\". Who would've guessed..."
        ]
    },
    {
        "title": "Elon Musk taking heat for Tesla stock plummet",
        "author": "CBC News",
        "video_id": "DqEmpsOfMmA",
        "likes": "122",
        "description": "Electric vehicle manufacturer Tesla is hitting a new low and its stock on track for its worst annual performance. Economists and analysts suggest that Elon Musk is to blame with his Twitter takeover, which took his focus off Tesla.\n \n»»» Subscribe to CBC News to watch more videos: http://bit.ly/1RreYWS\n\nConnect with CBC News Online:\n\nFor breaking news, video, audio and in-depth coverage: http://bit.ly/1Z0m6iX\nFind CBC News on Facebook: http://bit.ly/1WjG36m\nFollow CBC News on Twitter: http://bit.ly/1sA5P9H\nFor breaking news on Twitter: http://bit.ly/1WjDyks\nFollow CBC News on Instagram: http://bit.ly/1Z0iE7O\nSubscribe to CBC News on Snapchat: https://bit.ly/3leaWsr\n\nDownload the CBC News app for iOS: http://apple.co/25mpsUz\nDownload the CBC News app for Android: http://bit.ly/1XxuozZ\n\n»»»»»»»»»»»»»»»»»»\nFor more than 80 years, CBC News has been the source Canadians turn to, to keep them informed about their communities, their country and their world. Through regional and national programming on multiple platforms, including CBC Television, CBC News Network, CBC Radio, CBCNews.ca, mobile and on-demand, CBC News and its internationally recognized team of award-winning journalists deliver the breaking stories, the issues, the analyses and the personalities that matter to Canadians.",
        "top_5_comments": [
            "Send me to car",
            "Take a look at the Cisco's chart after the year 2000 internet bubble burst. It was the poster child back then. It took 20 years to regain its pre collapse highs. There's always one shining example in a bubble. This time it's TLSA.",
            "Musk is on the record saying, as TSLA was passing through its bubble, that it's overvalued and he doesn't recommend buying it.",
            "CBC Trudeau's propaganda machine network. Defund the CBC.",
            "I said months ago that Twitter would be the graveyard for Elon Musk. Tesla needs a new CEO to save Tesla. You are a fool if you invest your money in Tesla while Elon Musk is its CEO. It's as simple as that."
        ]
    },
    {
        "title": "4 Tesla Bears Speak Out Ahead of Robotaxi Event!",
        "author": "Brighter with Herbert",
        "video_id": "YDNZK3LiDj4",
        "likes": "839",
        "description": "Follow Hans Nelson on X: ​⁠​⁠ @HansCNelson  \nFollow Hans Nelson on YouTube: ​⁠​⁠ @HansCNelson \n\nMy website: https://www.HerbertOng.com\nCheck out 15+ modules of resources for the $TSLA Investor\nand get free TESLA Milestone Tables\n\nUse my referral link to purchase a Tesla product and get up to $1,000 off and other exclusive benefits.\nhttps://ts.la/herbert23392\n\nJoin this channel or Patreon to get free access to 15+ modules of TSLA investor resources\n\nBecome a Member: https://www.youtube.com/channel/UC4DBLlq1x0AKmip1QJUcbXg/join\nBecome a Patreon: https://www.patreon.com/brighterwithherbert\n\n❤️  Thank you to everyone who supports me and this channel! \n\nLet's get brighter!\nWebsite: www.herbertong.com\nX: @herbertong\n\nDisclaimer: All content on this channel is for discussion and illustrative purposes only and should not be construed as professional financial advice or recommendation to buy or sell any securities. All views expressed are personal opinion as of date of recording and are subject to change without responsibility to update views.  No guarantee is given regarding the accuracy of information on this channel.  Neither host or guests can be held responsible for any direct or incidental loss incurred by applying any of the information offered.  \n\nAuthor is invested in multiple Humanoid companies and is long TSLA and other stocks at time of original video publish date.\n\nEdited by: Roshan Khatiwada\n\n#Tesla #ElonMusk #TeslaNews #investing #teslabot #technology #AI #TeslaFSD  #teslastockanalysis  #TeslaUpdate #ElonMuskNews  #EV #FSD #TSLA #robotaxi #autonomousdriving #TeslaStock",
        "top_5_comments": [
            "I hope this video helped you get brighter about Tesla!\n\nMy website: https://www.HerbertOng.com\n\nUse my referral link to purchase a Tesla product and get up to $1,000 off and other exclusive benefits.\nhttps://ts.la/herbert23392\n\nSee the MOST comprehensive resource for the $TSLA Investor\n\nJoin this channel or my Patreon to get free access to 15+ modules of TSLA investor resources\n\nJoin this channel: https://www.youtube.com/channel/UC4DBLlq1x0AKmip1QJUcbXg/join\nJoin my Patreon: https://www.patreon.com/brighterwithherbert\n\nThank you for supporting this channel! I really do appreciate your likes, subscribes and comments. \n\nLet's get brighter!\nHerbert",
            "CNBC will devalue their brand by giving air-time to 'Analysts' like Tony Sacconaggi who has no clear valuation model and has never had an accurate price target",
            "Yahoo Finance is very negative on Tesla for the last 3 years....no surprise here",
            "Last I heard humans don't have radar or lidar, so I guess they shouldn't be allowed to drive cars.",
            "I think Robotaxi in cities need to know the best path to a number of specific locations, just like taxi drivers do. It can't just drive like it's new in town!\nWhat's missing is better maps!\nMapping information is a kind of knowledge, replacing the memory of taxi drivers.\nTesla should use their AI to create better mapping info. Perhaps they are already planning to do that.\nAt least 90 % of the uncertainties FSD shows are because it hasn't enough information of the path to its target. It otherwise handles the driving itself very well."
        ]
    },
    {
        "title": "If Tesla stock continues to rise, CEO Elon Musk could have a big pay day",
        "author": "CNBC Television",
        "video_id": "uzBZOImp_Vo",
        "likes": "1098",
        "description": "Tesla has had a strong start to 2020 and, if it continues, CEO Elon Musk could be in for a big payday. Tim Higgins, reporter at the Wall Street Journal, and Bob Lutz, former vice chairman of General Motors, joins \"Squawk Box\" to discuss.\n\nTesla delivered a record 112,000 vehicles globally during the fourth quarter, significantly topping Wall Street estimates and achieving CEO Elon Musk’s year-end sales goal.\n\nWall Street expected Tesla to deliver 106,000 vehicles to customers during the fourth quarter, which would have just met the company’s annual delivery goal of between 360,000 and 400,000 vehicles, a 45% to 65% increase from 2018.\n\nTesla said it delivered approximately 367,500 vehicles last year, an impressive 50% jump from 2018.\n\nShares of the electric-car maker surged more than 4% in morning trading to $448, a 49% rise rise over the last 12 months.\n\nTesla’s deliveries are a closely watched number in the industry, providing the closest proximation to sales. The company said it counts a car as delivered “if it is transferred to the customer and all paperwork is correct.” The deliveries number is a barometer for how the company is performing ahead of releasing its quarterly earnings.\n\nTesla said it delivered 92,550 Model 3 cars and 19,450 Model S and X vehicles during the fourth quarter. The company was expected to deliver 87,900 Model 3, 9,800 Model S and 9,300 Model X vehicles, according to an average of analysts surveyed by FactSet.\n\nInvestors were also watching production numbers. In the second and third quarters of 2019, Tesla delivered more cars than it produced. The production versus deliveries gap widened in the fourth quarter. In the third quarter, Tesla manufactured 96,155 vehicles and delivered 97,000 vehicles. In the fourth quarter, it manufactured 104,891 vehicles and delivered 112,000.\n\nThe electric-car maker said it has produced just under 1,000 cars that are ready for sale at its new factory in Shanghai. Tesla started delivering vehicles to Chinese customers late last month.\n\nTesla said it will “continue to focus on expanding production” in both the U.S. and China, where the company reports it has demonstrated production run-rate capability of greater than 3,000 units per week. That production rate, according to Tesla, excludes local battery pack production that began in late December.\n\nDaniel Ives, managing director of equity research at Wedbush Securities, called Tesla’s deliveries to end the year “impressive” and “another step in the right direction” for its Fremont assembly plant in California. Soundly beating Wall Street’s estimates in the quarter “was another major feather in the cap for Musk & Co.,” he said.\n\n“While part of this recent rally has been a massive short covering, it has also been driven by underlying fundamental improvement as the company’s ability to impressively not just talk the talk but walk the walk has been noticed by the Street and the optimism around the story has grown markedly from the dark days seen earlier in 2019,” Ives said in a note to investors Friday morning.\n\nEarlier this week, Musk made personal appearances at the company’s Fremont car plant and delivery center to cheer on employees and Tesla fans who volunteered to deliver cars to customers ahead of the year-end deadline.\n\nCustomers who received their cars in 2019 qualified for an $1,875 tax credit. But if the car was ordered in 2019, and delivered in 2020, they would not qualify.\n\nTesla is now shipping its vehicles to more locations around the world than ever before, including in the U.K. and China.\n\nThis broader customer base is one reason why Tesla assured investors in the third quarter that it would hit the low end of its prior guidance of 360,000 to 400,000 deliveries for the full year. The company also wrote then: “Deliveries should increase sequentially and annually, with some expected fluctuations from seasonality. We are highly confident in exceeding 360,000 deliveries this year.”\n\nFor access to live and exclusive video from CNBC subscribe to CNBC PRO: https://www.cnbc.com/pro/?__source=youtube\n \n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic\n \nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n \n#CNBC\n#CNBC TV",
        "top_5_comments": [
            "Purchasing a stock may seem straightforward, but selecting the correct stock without a proven strategy can be exceedingly challenging. I've been working on expanding my $210K portfolio for a while, and my primary obstacle is the lack of clear entry and exit strategies. Any advice on this matter would be greatly appreciated.",
            "Guy in the white shirt: Elon: \"I put the art in fart.... \" Bob does this make sense to you ?\n\nBob Lutz: Well yes it does, it's the first thing that Elon has ever said that has made total sense to me.\" \n\n\nbahahaha",
            "CNBC\n(2012)Tesla is like Solyndra they go belly up,soon.\n(2013)Tesla is niece company, big boys dont care.\n(2014)Tesla cant mass produce vehicle.\n(2015)Look those unsold car in the factory parking lot.\n(2016)Tesla is selling car in loss.\n(2017)Tesla cant sell once federal tax is taper off.\n(2018)Big car company is coming, The long knife is out for Tesla.\n(2019)Tesla will face Tough competition in China.\n(2020) ohh..shit.",
            "The Tesla has a fart button that make any seat fart lmao that’s why",
            "CNBC is the worst, they try to spin this as tho that Elon is all about that money lol ... https://www.youtube.com/watch?v=vfILTM_xcOE&t=11s"
        ]
    },
    {
        "title": "Inside Elon Musk's underground loop tunnels in Las Vegas",
        "author": "CNBC Television",
        "video_id": "NFWZWDqyV2I",
        "likes": "8992",
        "description": "Elon Musk's Boring Company is building high-speed tunnels in Las Vegas. Contessa Brewer joins 'The News with Shepard Smith' to report. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic \n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "Sucks , more people unemployed",
            "Stupid as hell...",
            "looks cool but i enjoy walking 45 min too",
            "You take your 21 year old nephew out to Vegas on his 21st birthday, give him a skinfull and put him in a Tesla at 200kph back to the hotel. Who cleans up his spew? 🤢",
            "What a scam"
        ]
    },
    {
        "title": "Should Elon Musk sell 10% of his Tesla stock? Twitter users vote 'yes'",
        "author": "CNBC Television",
        "video_id": "OFhQ0aTLQiI",
        "likes": "312",
        "description": "CNBC's 'Squawk Box' discuss a recent Twitter poll from Tesla CEO Elon Musk asking users whether he should sell 10% of his shares in the company. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\nTesla shares fell by more than 4% in early morning trading Monday after CEO Elon Musk asked his Twitter followers if he should sell 10% of his stock in the electric vehicle company.\n\nShares of Tesla slipped 4.2% to $1,170 at 8:19 a.m. ET Monday, down from $1,222.09 at market close on Friday. Earlier in pre-market trade on Monday, shares fell over 7%.\n\nIt comes after Musk asked his 62.5 million Twitter followers to determine the future of a chunk of his Tesla holdings.\n\nIn a Twitter poll launched Saturday, Musk said: “Much is made lately of unrealized gains being a means of tax avoidance, so I propose selling 10% of my Tesla stock. Do you support this?”\n\nThe billionaire gave people the option to vote “Yes” or “No” and pledged to abide by the results of the poll, whichever way it went.\n\nSome 3,519,252 people responded, and 57.9% of them voted for “Yes.”\n\nMusk previously said he was likely to sell “a huge block” of his shares in the fourth quarter.\n\nIn September, Musk said at the Code Conference in Beverly Hills, California, that his marginal tax rate will be over 50% when his stock options expire at Tesla, and that he was already planning to sell soon.\n\n“I have a bunch of options that are expiring early next year, so ... a huge block of options will sell in Q4 — because I have to or they’ll expire,” he said.\n\n Jefferies raised their price target for shares of Tesla from $950 to $1,400 in a note on Monday.\n\nAnalyst Philippe Houchois wrote: “Without dismissing execution risk, Tesla is getting to a position where it can balance affordability and speed, goals which are as important as profitability in Elon Musk’s vision.”\n\nHe added: “Tesla looks set to gain share from large OEMs [original equipment manufacturers], potentially claiming a disproportionate share of the industry profit pool in the coming 3-5 years as legacies enter the margin dilutive EV transition phase.”\n\nOther current and former Tesla board members, including Robyn Denholm, Kimbal Musk, Ira Ehrenpreis and Antonio Gracias have also offloaded hundreds of millions of dollars worth of Tesla stock since Oct. 28, as the company’s stock soared on the Nasdaq stock exchange.\n\nShares climbed after Tesla posted a record third quarter and car rental company Hertz announced that it was ordering 100,000 Tesla vehicles for its fleet. Musk waited for a week after Hertz made its announcement to say that Tesla had not in fact signed a contract with the company yet. Prior to that statement, he taunted investors who were short shares of Tesla on Twitter, writing: “Tesla Hertz shorts.”\n\nSince the Hertz announcement, Tesla shares have risen by more than 30% and so has Musk’s net worth.\n\nElon’s tax bill\n\nNo matter the results of the Twitter poll, Musk would have likely started selling millions of shares this quarter. That’s because he’s facing a looming tax bill of more than $15 billion.\n\nHis options expire in August 2022 but in order to exercise them, he has to pay the income tax on the gain.\n\nSince the options are taxed as an employee benefit or compensation, they will be taxed at top ordinary-income levels, or 37% plus the 3.8% net investment tax. He will also have to pay the 13.3% top tax rate in California since the options were granted and mostly earned while he was a California tax resident.\n\nCombined, the state and federal tax rate will be 54.1%. So the total tax bill on his options, at the current price, would be $15 billion.\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic \n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "Bullish or bearish, AI stocks will still dominate 2024, even beyond. Why I prefer NVIDIA is that they are better placed to maintain long-term growth potential, and provide a platform for other AI companies. I know someone who has made more than 200% from NVIDIA. I'll also take these other recommendations you made.",
            "Even better if he bought a huge stake in Twitter to btfo all the morons who think CNBC is a serious news organization",
            "It would be great to see Musk pressure Twitter’s board to fire Agrawal.",
            "Biden shows how much he is out of touch \"Unaware\" of what ELON does, and how his company \"Tesla\" has changed the Auto Industry, Tesla is the world leader in EV Production - Biden due to his payoff from UAW keeps pushing Ford and GM, ask yourself, what have they done \"NOTHING\" they sit back and continue to produce gas powered cars, they both said electric could not work, would not be affordable - but Elon, Tesla, proved it could be done, and cars produced in the US, developed in the US with pricing that all can afford, expanding in Germany, China and India, the World EV Leader, and Biden will not acknowledge Elon, ask him for guidance, take advice from the Leader, not the followers - how about understanding the great Leader and Thinker Elon is, and how many People he has working for him in the US, close to directly 100k and 1000's more in 2nd / 3rd and 4th levels in the supply chain..\nBiden says there will be charging station around the country to drive your electric car cost to cost - again ask yourself, is that something Tesla has already done, not only in the US but around the world, Tesla has the largest EV Charging network in the world, and in the US, and now allowing others to charge at their locations - so Biden again shows how out of touch he is with what is actually being done in the US by Tesla, Elon - wake up Biden, seek your direction for the EV Leader and Space Leader, Space X....Space X that put the US back into the Space Game, sending Humans and Supplies back into Space from US Soil...\nSEEK ADVISE FROM THE LEADER - US COMPANY, ASK ELON.",
            "Elon Musk is a Rock Star ⭐️"
        ]
    },
    {
        "title": "Here's how much Elon Musk's wealth has shrunk as Tesla shares slide",
        "author": "CNBC Television",
        "video_id": "ITuEdOmBihk",
        "likes": "299",
        "description": "The sell-off in Tesla shares as been sharp and swift. As of Friday morning, the stock has lost roughly $85 billion in market cap since Monday and CEO Elon Musk's wealth has taken a hit. But the stock is still up about 800% over the past year. CNBC's \"Squawk Box\" crew discusses what could be ahead for the stock. Subscribe to CNBC PRO for access to investor and analyst insights on Tesla and more: https://cnb.cx/2BT2E7y\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic\n \nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n \nFor info on the best credit cards go to CNBC Select: \nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "What are the best strategies to protect my portfolio?  I've heard that a downturn will devastate the financial market, so I'm concerned about my $200k stock portfolio.",
            "This aged like milk",
            "Wow! He makes losing 35% sound amazing!",
            "They are actually chuckling at their idiocy. Tesla stock is 100% more than what they wish it is",
            "I asked Elon to buy me a electric unicycle.  Nothing yet.  Still waiting."
        ]
    },
    {
        "title": "Elon Musk sells near $5B worth of Tesla shares",
        "author": "Yahoo Finance",
        "video_id": "M4Gc7wyVEpA",
        "likes": "148",
        "description": "#shorts #ElonMusk #Tesla #ElonMusksellsTeslastock\nElon Musk sold nearly $5 billion worth of Tesla shares to cover taxes after an exercise of stock options.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Alian musk is eating our lunch 🥗",
            "Space motivates ⚡🇨🇦🇺🇸🌐",
            "I mean, it's only obvious this was a ploy and he was gonna sell those (more than 10% of) stocks either way. This makes little to no difference to his mountain of wealth.",
            "WTF does \"preplan\" or \"pre-plan\" mean? Is it for dummies who can't plan or merely pseudo-sophisticates?",
            "Lies. All lies"
        ]
    },
    {
        "title": "Here's a breakdown of Elon Musk's Tesla stock sell-off",
        "author": "CNBC Television",
        "video_id": "MG9GLYDqyPM",
        "likes": "324",
        "description": "Taxes aren't the only reason Tesla CEO Elon Musk is selling stock. CNBC's Robert Frank joins 'Squawk Box' to report. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\nTesla CEO Elon Musk’s trust sold about $1.2 billion in Tesla stock on Friday, according to financial filings posted Friday evening. He still holds more than 166 million shares in the company.\n\nMusk sold about $6.9 billion worth of stock in the company over the course of the week. Some of the shares were sold in part to satisfy tax obligations related to an exercise of stock options.\n\nThose sales impacted the company’s share price. Tesla stock declined 15.4% for the week, marking the company’s worst one-week performance in 20 months. It was also the worst week for Tesla stock ever, excluding declines in February and March 2020 as the coronavirus pandemic sent markets tumbling.\n\nTesla shares are still up around 46% year to date following a record closing price of $1,229.91 on Nov. 4, 2021.\n\nOn Nov. 6, Musk asked his more than 60 million Twitter followers to vote in an informal poll and told them their vote would determine the future of his Tesla holdings. Financial documents filed during the week show that some were slated for sale this week no matter the outcome of the poll, however.\n\nPreviously, Musk signaled that he was likely to sell “a huge block” of his options in the fourth quarter. At an appearance at the Code Conference in September, Musk said when his stock options expire at Tesla, his marginal tax rate would be over 50%.\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic \n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "I feel investors should focus on under-the-radar stocks, considering the current rollercoaster nature of the stock market, Because 35% of my $270k portfolio comprises plummeting stocks that were once revered. I don't know where to go here out of devastation.",
            "This is peak for Tesla. Now there are competitors and Elon knows it. With Behemoths like Ford, GM, Toyota, Hyundai etc. entering EV space, Elon knows it's time.",
            "I'd buy...",
            "Hey #modi is saying that #elonmusk is definitely #zombie_evil 🌩",
            "But yeah I guess he was just selling some of that stock to pay the taxes on the company so with people are saying it's maybe there was there's a better way in the future of him paying his taxes so I mean if this is the case then it sounds legitimate you know it's just the in stock investors need to know the bottom line went before they start sticking some heavy"
        ]
    },
    {
        "title": "Tesla earnings, Elon Musk’s conference call and the outlook for the company",
        "author": "Yahoo Finance",
        "video_id": "w_b-UzivXBQ",
        "likes": "304",
        "description": "#youtubeshorts #yahoofinance #tesla #elonmusk \n\nYahoo Finance anchors discuss Tesla earnings, Elon Musk’s conference call and the outlook of the company on January 26, 2023.\n\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Is this from last year? The call is tomorrow…",
            "Your missing the big picture, its more than just a car company and look at whats up coming as well as Space X",
            "The stock is down 50 bux it is no gain",
            "Tesla fanboys in tears, trying desperately to win in YouTube comments section trying to attack newsreaders.",
            "This short is based on footage dated January 2023. But we just had another earnings call only 2 days ago, which was a disaster all around. Stock has tanked 17% since. This is a completely outdated and irrelevant if not misleading footage to be floating around. Alternative reality fanboys will enjoy"
        ]
    },
    {
        "title": "Elon Musk using pricing as a 'cudgel' against the competition, says former Ford CEO Mark Fields",
        "author": "CNBC Television",
        "video_id": "s9YwxH6HjvQ",
        "likes": "235",
        "description": "Mark Fields, former Ford CEO, joins 'Squawk Box' to discuss Elon Musk's comments about sacrificing Tesla's profits for growth and what it means for the rest of the EV market. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "I smell fear",
            "Please watch Investors Day again so you guys understands Elons vision. Jeez!",
            "You can clearly see Mark Fields wants to go out of his way to paint Tesla in a negative light.",
            "Why is this bozo invited to talk about auto market each quarter?",
            "All in on TSLA ⚡"
        ]
    },
    {
        "title": "Tesla shares soar after Elon Musk promises profitability",
        "author": "CNBC Television",
        "video_id": "hiwVWbv-a5A",
        "likes": "47",
        "description": "Roger McNamee, Elevation Partners co-founder, and Scott Galloway, L2 CEO, discuss their outlooks on Tesla stock after its second-quarter earnings beat, and whether or not they bought Elon Musk's apology during the earnings call.",
        "top_5_comments": [
            "History shows that many manufacturer's new car models sell well in the first 2 years then drop off \ndramatically once those buyers who are willing to pay full price are gone; the general population only buys \nthe 3rd year on when price keeps falling.",
            "elon musk will fall iam 100 percent sure and this fall will kill him",
            "All these salty shorts lol",
            "These guys are getting left behind, and they don't like it. Time to retire fellas.",
            "The basic reason why Tesla stock is valued is because people are behind the purpose that the company embodies. The original purpose of issuing stock was that it was a way of getting money to expand a company that had a good idea people could embrace. The plan would be a long term investment, not day trading. The stock market however is a cancer pushing a product that is basically paper. Analysts sit in offices moving paper around generating income for THEM on paper. The idea that a group can legally make money betting that a company will fail (injuring thousands of real people) is an example of why people don't and shouldn't trust analysts that are just talking heads on TV."
        ]
    },
    {
        "title": "Elon Musk bought more Tesla shares, raising stake to 18.5%",
        "author": "CNBC Television",
        "video_id": "iYgeYXoNsLU",
        "likes": "122",
        "description": "The \"Squawk Box\" crew talk about several of the morning's top stories.\n\nNoticeably better quality in the new Model 3 cars helped Tesla show the biggest improvement among automakers in Consumer Reports’ latest brand rankings.\n\nThe company, run by Elon Musk, jumped into the top half of auto brands ranked by the auto team at Consumer Reports, which analyzes data on major automakers and tests hundreds of vehicles.\n\n“We saw a marked improvement in reliability in both the Tesla Model 3 and the Model S,” said Jake Fisher, senior director of auto testing for Consumer Reports. “That was enough to really improve their brand score more than any other brand in our survey.”\n\nOverall, Tesla climbed eight spots to rank 11th out of 33 auto brands, according to Consumer Reports. In addition, the Consumer Reports auto team made the Model 3 a “Top Pick” among vehicles with a sticker price between $45,000 and $55,000.\n\nThe positive review of Tesla and the Model 3 is the latest indication the automaker is making steady progress improving the quality and reliability of its vehicles. When Tesla first began building and selling the Model 3, in 2018, there were numerous stories detailing production issues at the company’s assembly plant in Fremont, California.\n\nFisher said those issues likely hurt the quality of initial versions of the Model 3 when Tesla was ramping up production of the car. “They changed the seats, they changed the glass, they changed the suspension in the first few months of production of the Tesla Model 3,” said Fisher. “Because everything is changing there are new problems every time you make changes in production.”\n\nFisher says Consumer Reports noticed an improvement in the Model 3 starting in the middle of last year when production at Tesla’s plant stabilized. “Once they settled that down, they were able to improve the reliability,” he said.\n\nThe rankings and “top picks” are based on a variety of factors, including an owner satisfaction survey of Consumer Reports members who review their vehicles. In addition, the Consumer Reports auto team tests dozens of new vehicles at the firm’s test track in Connecticut.\n\nThis year, the company ranks Porsche as the top auto brand, followed by Genesis and Subaru. By comparison, Consumer Reports listed Fiat as the worst brand, right behind Mitsubishi and Jeep. CNBC reached out to Fiat for a comment regarding the latest rankings.\n\nFor access to live and exclusive video from CNBC subscribe to CNBC PRO: https://www.cnbc.com/pro/?__source=youtube\n \n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic\n \nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n \n#CNBC\n#CNBC TV",
        "top_5_comments": [
            "With around $120k invested in Palantir stocks, any suggestions for additional stocks to diversify across various markets? Looking for a well-rounded portfolio that balances risk aversion with returns meeting yearly inflation concerns.",
            "*Tesla is on a huge run this year.  I'm already up 213% and just made a video on Tesla.*  👍",
            "doesn't he have 22%",
            "This is old news. Elon bought shares as a part of the $2B capital raise. Elon always buys when there's a capital raise because he wants to make it clear that he will not sell to investors what he would not buy himself. Elon has consistently done this from the early seed round funding for Tesla. He did this even in the depths of the 2008 financial crisis when he went net negative on his net worth to save Tesla from bankruptcy.",
            "My return is gonna be pretty nice if I decide to sell my tesla stock. I bought quite a bit tesla stock back when it was $176 a share. Now its $909 😎"
        ]
    },
    {
        "title": "Tesla shares dip after Elon Musk offloads more stock",
        "author": "CNBC Television",
        "video_id": "tD6D30908MU",
        "likes": "162",
        "description": "CNBC's 'Squawk on the Street' team discuss shares of automakers following news that Elon Musk offloaded nearly $10 billion in shares since his Twitter poll on Nov. 6. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\nTesla CEO Elon Musk sold about $1.05 billion in stock on Tuesday evening, according to financial filings posted this week. The sales were scheduled in September to exercise options that were set to expire in 2022.\n\nMusk has sold a total of $9.85 billion in Tesla stock this month, including the $6.9 billion he sold the week of Nov. 10 and another $1.9 billion he sold on Nov. 15 and Nov. 16. Some of the shares were sold in part to satisfy tax obligations related to an exercise of stock options.\n\nMusk and his trust still hold more than 169 million shares in the company.\n\nTesla shares fell 15.4% the week ended Nov. 12, marking the worst week for Tesla stock in 20 months after Musk began selling shares. Shares of Tesla were up about 1% on Wednesday afternoon.\n\nMusk ran an informal Twitter poll on Nov. 6 asking his more than 60 million Twitter followers whether or not he should sell 10% of his Tesla stock. The poll ultimately ended with users telling Musk to sell.\n\nBut, Musk had already indicated earlier this year he was likely to sell “a huge block” of his options in the fourth quarter. During an appearance at the Code Conference in September, he said when his stock options expire at Tesla, his marginal tax rate would be over 50%.\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic \n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "What are the best strategies to protect my portfolio?  I've heard that a downturn will devastate the financial market, so I'm concerned about my $200k stock portfolio.",
            "This is fud the price is literally  the same. Stock market prices all ways go up and down during the day.",
            "The Osborne effect has already started! Legacy is in big trouble! Someone must ask CEO Mary BS Barra about the Osborne effect and is it affecting GM?  Lets see if her head moves up and down as she says “NO, GM is leading the EV race! Just ask sleepy Joe!  Joe said so, so it must be so!”  😂……………………💎🙌😎🇨🇦TESLA",
            "CNBS - Fake News , TSLA share prices RISE to $1116 at Market Close and $1118 after hours . \nTSLA shares Recovered a FAIR bit , even after ELON sold his shares.",
            "I advise y'all to forget predictions and start making a good profit now because future valuations are all speculations and guesses.The market is very unstable and you can't tell if it's going bearishor bullish.While myself and others are trading without fear of making a loss others are being patient for the price to skyrocket. It all depends on the pattern you follow. I was able to make 13 BTC from 2.1 BTC in just July from implementing trades with tips and info from Sophie Arthur."
        ]
    },
    {
        "title": "Why Elon Musk is Trump's big wildcard",
        "author": "The Australian",
        "video_id": "4XHeh0Ws-V8",
        "likes": "221",
        "description": "Donald Trump and Elon Musk share a complicated relationship, which is marked by Musk's initial criticism of Trump's administration, labelling it a “gerontocracy.” However, after feeling snubbed by President Joe Biden, Musk's stance has shifted. Despite leading the EV market, Musk's Tesla was repeatedly ignored by the Biden administration, influenced by the United Auto Workers union.\n\nIn August 2021, Biden held an EV event, excluding Tesla, further straining relations. Under Biden, regulatory actions targeted Musk's companies, deepening the rift. Recently, Musk co-founded America PAC, a pro-Trump super PAC, and plans to contribute $45 million.\n\nMusk insists his super PAC aligns with views on meritocracy and personal freedom. Influenced by key tech associates, Musk has become more politically active, making him a significant wildcard in Trump's political strategy. \n\n#trump #musk #elonmusk #tesla #biden #election \n\nConnect With The Australian Online \n🖥 https://www.theaustralian.com.au\n\nFollow Us:\nFacebook  ► https://www.facebook.com/theaustralian\nInstagram ► https://bit.ly/39w5T2j\nTwitter       ► https://twitter.com/australian\nLinkedIn    ►   https://www.linkedin.com/company/1008560/admin/feed/posts/\n\n🎧 Podcast     ►  https://www.theaustralian.com.au/nation/the-front/podcast/7e7d42e8c77b597cf8532d2e0c847e10\n\n🎥 Subscribe To Our YouTube Channel: http://bit.ly/1OT7tw4\n\n#breakingnews\n#news\n#headlinenews",
        "top_5_comments": [
            "Question: \nShould Elon Musk lose his American citizenship for interfering with our presidential election? \n(PAC)",
            "Warning to USA people.\n“To investors: Finally, once and for all, the \"Falcons\" will sadly enslave the \"Doves\".\nElon/trump 2024 ticket (Goodbye Vance)",
            "God is Trump’s wildcard",
            "The floundering business magnate is going to (now) support the floundering (and old) presidential candidate.\n\nMusk is the kiss-of-death to presidential candidacy..... see \"Ron DeSantis\".",
            "you stop my you truld myno"
        ]
    },
    {
        "title": "Elon Musk blames 'supply chain pressures' for rising Tesla prices",
        "author": "Yahoo Finance",
        "video_id": "xpNL1orpL4M",
        "likes": "76",
        "description": "#Tesla #ElonMusk #Teslastock\nTesla CEO Elon Musk says vehicle prices are increasing due to supply chain pressures in the auto industry. Yahoo Finance’s Pras Subramanian shares the details.\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nAbout Yahoo Finance Premium: With a subscription to Yahoo Finance Premium, get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Premium please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Supply chain pressures on Tesla or on your pocket",
            "THUMBS DOWN: you guys need headsets for better audio. I’m out in under two min.",
            "I'm sorry I thought elon's last name was trump. Just another person with lots of $ making themselves relevant! Remember what can happen!",
            "Fantastic Video ❤️Bitcoin has followed this pattern for sometime now; It dips and gets everyone scared then after retesting an old resistance several times, we wake up one day to see it has bullish. This period is the perfect time to buy the dip and accumulate irrespective of the bulls being under pressure. Bitcoin moving up is inevitable and would see the price of bitcoin surpass it's all-time highs. The reversal was imminent because obviously, the bitcoin market needed a correction to gather the right momentum to give the bulls more steam and this just makes it the perfect time to invest and accumulate as much as possible. I ' d strongly advise any newbie / traders to buy the dip for traders who are still wondering to enter the market or old time traders who are Holders to seek help from not just any trader but an established trading expert with at least 89% trade accuracy. I underwent series of trading loses I'd best not talk about before I was introduced to trading analyst *<Declan Burrows>* *Tҽʅҽgɾαɱ* . My contact with him has been the Hallmark of this year for me, under his careful guide and his signal services. I've been able to recover my losses and even grow my trading portfolio massively from 1.2 btc to 4.6 btc in just 5 weeks. I will advise traders especially newbies to have orientation of trading before they involve in it. *<@Declanburrows>*  makes you learn daily while you make a profit with his signals.",
            "This dude has a monopoly. He restructured NASA, restructured the automobile industry, and single handedly brought tycoons to their knees. However, he can't figure out logistics to lower the price!? Sounds like he needs a new PM for logistics."
        ]
    },
    {
        "title": "Tesla CEO Elon Musk tells workers not to worry about 'stock market craziness'",
        "author": "Yahoo Finance",
        "video_id": "J6ttqN8ueUE",
        "likes": "148",
        "description": "#Tesla #ElonMusk #yahoofinance \nYahoo Finance’s Pras Subramanian joins the Live show to discuss reports that Elon Musk has addressed Tesla staff in a memo thanking them for a strong fourth quarter and assuring them to not be bothered by stock price uncertainty.\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "FREE Andrew Tate",
            "Musk is a hero",
            "Yeah,trust this do…lol.He’s abusive to his staff.",
            "We're thrilled with our exciting updates and events this coming year. VSTMEX got everything you need to take crypto trading to the next level.",
            "GM and others to catchup with Tesla don't make me laugh Tesla are leaving legacy autos in the dust!"
        ]
    },
    {
        "title": "Elon Musk loses $19 billion after bitcoin and Tesla shares plunge | Finance Report",
        "author": "ABC News (Australia)",
        "video_id": "B3ROCh7goXM",
        "likes": "160",
        "description": "Wage growth was stronger than expected in the December quarter. \n\nAlan Kohler has today's finance report. \n\nSubscribe: http://ab.co/1svxLVE  Read more here: https://www.abc.net.au/news/2021-02-24/asx-markets-stock-wall-street-bitcoin-tech-sell-off-recover/13185968\n\nABC News provides around the clock coverage of news events as they break in Australia and abroad, including the latest coronavirus pandemic updates. It's news when you want it, from Australia's most trusted news organisation.\n\nFor more from ABC News, click here: https://ab.co/2kxYCZY\nWatch more ABC News content ad-free on iview: https://ab.co/2OB7Mk1\n\nGo deeper on our ABC News In-depth channel: https://ab.co/2lNeBn2\nLike ABC News on Facebook: http://facebook.com/abcnews.au\nFollow ABC News on Instagram: http://instagram.com/abcnews_au\nFollow ABC News on Twitter: http://twitter.com/abcnews\n\n#ABCNews #ABCNewsAustralia",
        "top_5_comments": []
    },
    {
        "title": "Elon Musk has sold $3.6bn more Tesla shares | The Dive Business News",
        "author": "Equity Mates",
        "video_id": "472lioluIQ8",
        "likes": "5",
        "description": "Tesla investors are worried Elon is too distracted to run the company #tesla #elon #spacex #ev",
        "top_5_comments": []
    },
    {
        "title": "Elon Musk: I Don't Follow Tesla Stock That Much",
        "author": "Bloomberg Originals",
        "video_id": "Bjq6tXRKfUQ",
        "likes": "780",
        "description": "Oct. 10 (Bloomberg) -- The newest Tesla electric car is an all-wheel-drive version of the Model S sedan with two motors and safety features including driver-assisting tools intended to prevent crashes. Elon Musk, chief executive officer of Tesla Motors Inc., discusses the new Model D and Tesla stock with Bloomberg's Betty Liu.\n\n-- Subscribe to Bloomberg on YouTube: http://www.youtube.com/Bloomberg\n\nBloomberg Television offers extensive coverage and analysis of international business news and stories of global importance. It is available in more than 310 million households worldwide and reaches the most affluent and influential viewers in terms of household income, asset value and education levels. With production hubs in London, New York and Hong Kong, the network provides 24-hour continuous coverage of the people, companies and ideas that move the markets.",
        "top_5_comments": [
            "I wonder if this Elon would approve of the current Elon.",
            "Why is no one saying that the interviewer is hot.. heheheh",
            "Do you follow angel numbers? 555 ❤",
            "This is a great interview. Both Elon and the Interviewer did well.",
            "🌸🌸🌸🌸♥️"
        ]
    },
    {
        "title": "Elon Musk's $44 billion Twitter buyout, sells Tesla shares worth $4 billion | World News | WION",
        "author": "WION",
        "video_id": "Q7FChJ5nlRg",
        "likes": "270",
        "description": "The world's richest man Elon Musk has started liquidating assets to help fund his bid to buy Twitter. Tesla's chief executive officer has sold $4 billion worth of shares recently. As per reports, Musk is planning to monetise tweets. \n\n#Twitter #ElonMusk #Tesla \n\nAbout Channel: \n\nWION -The World is One News, examines global issues with in-depth analysis. We provide much more than the news of the day. Our aim to empower people to explore their world. With our Global headquarters in New Delhi, we bring you news on the hour, by the hour. We deliver information that is not biased. We are journalists who are neutral to the core and non-partisan when it comes to the politics of the world. People are tired of biased reportage and we stand for a globalised united world. So for us the World is truly One.\n \nPlease keep discussions on this channel clean and respectful and refrain from using racist or sexist slurs as well as personal insults.\n\nSubscribe to our channel at https://goo.gl/JfY3NI\nCheck out our website: http://www.wionews.com\nConnect with us on our social media handles:\nFacebook: https://www.facebook.com/WIONews\nTwitter: https://twitter.com/WIONews\n\nFollow us on Google News for latest updates\n\nZee News:- https://bit.ly/2Ac5G60\nZee Bussiness:- https://bit.ly/36vI2xa\nDNA India:- https://bit.ly/2ZDuLRY\nWION: https://bit.ly/3gnDb5J\nZee News Apps : https://bit.ly/ZeeNewsApps",
        "top_5_comments": [
            "This is what happens when you make false promises to your customers (over priced EV cars, people waiting years for their car, over priced internet service and you team up with a loser like Trump and Amber Heard), very quickly people realize you don't have professional integrity, or maybe you did have, but you've lost touch with reality.",
            "We are being fed misinformation by this channel!!!!",
            "Stay with spacex . Don't date AOC she will tax you to death .🤣🤣😂",
            "wow this channel dont like elon musk...dont like usa dont like britian doesnt seem to care for the west..hates china  getting pretty hard to stat optimistic.. but their honest",
            "let's go Brandon 😀"
        ]
    },
    {
        "title": "Elon Musk pauses hiring at Tesla over 'super bad' feeling on economy",
        "author": "CNBC Television",
        "video_id": "v-rpUZ0MJVo",
        "likes": "1254",
        "description": "Dan Ives, Wedbush Securities senior analyst, joins CNBC's 'Squawk Box' to discuss Elon Musk's decision to freeze hiring at Tesla, warning that he has a \"super bad\" feeling about the economy. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "the best moment for mistreated Tesla's employees to flee",
            "I wonder if all these layoff and talks about Elon supporting GOP were simply because Elon was not able to secure some money from Biden Administration",
            "So what if Musk cuts 10% of jobs at Tesla. Those laid off workers can get jobs at MacDonalds right away. Every single MacDonalds in my area has signs they are hiring people. The economic outlook would be bad if there was record unemployment but there isn’t. Unemployment is at the lowest level in decades. The economy is stronger than its ever been. All these companies are hiring. Burger King, Taco Bell, Wienerschnitzel  in and out Burger, Macy’s, j c penny’s. During the depression of the 1930’s the economy was bad because of massive unemployment and no one hiring. With all these companies hiring no one should be unemployed. The economy now is the strongest it has ever been.",
            "What’s all this talk about a bad economy and inflation? I know plenty of people including retired policemen and teachers and other professionals who are getting a $10,000 a month pension in addition to social security .Not one of them cares or is worried that food prices have doubled or gas is $6 a gallon in California. All of them say high prices for everything? What high prices. I also know a retired city employee for the city of Los Angeles getting a $100,000 a month pension. Not a year, a month. Plus every where I drive in Los Angeles the roads are full of cars. If gas costs so much then why isn’t anyone cutting down on driving? The answer is gas is still cheap at $6 a gallon and is easily affordable.",
            "It’s fun to watch how these talking heads have collectively changed their tone toward Musk in the last three years.  They’re scared of him now.\n\n\n\n\n\n\n\nBoo!"
        ]
    },
    {
        "title": "All eyes on Elon Musk and Tesla for company's investor day",
        "author": "CNBC Television",
        "video_id": "vJhW6FUd2xY",
        "likes": "213",
        "description": "CNBC's Phil LeBeau reports on the latest from Tesla Investor Day. With CNBC's Melissa Lee and the Fast Money traders, Steve Grasso, Karen Finerman, Dan Nathan and Courtney Garcia. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV ",
        "top_5_comments": [
            "Purchasing a stock may seem straightforward, but selecting the correct stock without a proven strategy can be exceedingly challenging. I've been working on expanding my $210K portfolio for a while, and my primary obstacle is the lack of clear entry and exit strategies. Any advice on this matter would be greatly appreciated.",
            "The big nose DAn guy never had anything good to say about tesla, exaggerate things (substantially cut prices, lol), melissa has a group of tesla bears who knows very little about Tesla.",
            "Toxic battery bad for American!! Musk are dumb!",
            "Big business thinks of people as sheep, it's easy to steer people in the direction you want, with just a few persuasive claims. Do anything, say anything to make a sale.",
            "The Market have been suffering over the past month, with all the three indexes recording losses in recent weeks. My $400,000 portfolio is down by approximately 20%, any recommendations to scale up my returns before retirement will be highly appreciated."
        ]
    },
    {
        "title": "Tesla stock continue to dip after Elon Musk tweets at Bernie Sanders",
        "author": "Yahoo Finance",
        "video_id": "DJBBml9IvGE",
        "likes": "106",
        "description": "#Tesla #ElonMusk #Teslastock\nYahoo Finance Live's Brian Sozzi and Julie Hyman discuss Tesla shares continuing to decline following founder Elon Musk's Twitter spat with Senator Bernie Sanders (D-VT).\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "This comment section is the WORST. there’s plenty of stuff here on youtube completely debunking musk.",
            "What a legend",
            "Why do concerned doing the news",
            "Elon Musk suddenly became my hero in literally one tweet",
            "Yahoo News: You took everything from me\nMusk: I didn't even know you were still around."
        ]
    },
    {
        "title": "Elon Musk becomes the first person to lose a net worth of $200 billion",
        "author": "Yahoo Finance",
        "video_id": "MX0xUq8rje4",
        "likes": "989",
        "description": "#shorts \nAmid Twitter controversy and plummeting Tesla stock, Elon Musk is the first human being in history to lose $200 billion in net worth, according to Bloomberg. Yahoo Finance Sr Producer Kelsey Barberio gives further details.\n\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "He’s currently the richest man in the world.",
            "That’s ok he will be the First to net 1 Trillion dollars when Tesla does a 20 X 1,000,000,000,000.",
            "If I have $200 dollars, and buy something for $45 dollars, according to Yahoo finance I \"lost\" $45 dollars.",
            "poor elon we should start a go fund me for him",
            "So much for calling himself a Genius..And those bootlickers who followed him. Kinda of reminds everyone of 45 his buddy."
        ]
    },
    {
        "title": "Twitter trouble: Elon Musk's Tesla's shares go down by 35% | Latest News | WION",
        "author": "WION",
        "video_id": "WX6vc2uR7pg",
        "likes": "857",
        "description": "Elon Musk who has taken charge of Twitter after having purchased the company for a jaw-dropping $44 billion, has started off cost cutting and the way he's got about cost-cutting is by sacking employees. \n\n#elonmusk #twitter #technews \n\nAbout Channel: \n\nWION The World is One News, examines global issues with in-depth analysis. We provide much more than the news of the day. Our aim to empower people to explore their world. With our Global headquarters in New Delhi, we bring you news on the hour, by the hour. We deliver information that is not biased. We are journalists who are neutral to the core and non-partisan when it comes to the politics of the world. People are tired of biased reportage and we stand for a globalised united world. So for us the World is truly One.\n \nPlease keep discussions on this channel clean and respectful and refrain from using racist or sexist slurs as well as personal insults.\n\nSubscribe to our channel at https://goo.gl/JfY3NI\nCheck out our website: http://www.wionews.com\nConnect with us on our social media handles:\nFacebook: https://www.facebook.com/WIONews\nTwitter: https://twitter.com/WIONews\n\nFollow us on Google News for latest updates\n\nZee News:- https://bit.ly/2Ac5G60\nZee Bussiness:- https://bit.ly/36vI2xa\nDNA India:- https://bit.ly/2ZDuLRY\nWION: https://bit.ly/3gnDb5J\nZee News Apps : https://bit.ly/ZeeNewsApps",
        "top_5_comments": [
            "He’s racist",
            "The one thing you should never destroy is your reputation, there's no building that back up",
            "Elon Musk everything goes in trouble 1st bitcoin 2nd tesla shares 3rd twitter",
            "Most of the Indians got caught to the lay off. It’s better the Indians to work for India in INDIA.",
            "In time Twitter will die off...its going through a slow death...i will not be surprise if Google launches its own micro blogging site"
        ]
    },
    {
        "title": "Elon Musk denies his Twitter use hurts Tesla as sales soar – BBC News",
        "author": "BBC News",
        "video_id": "k2Q4qOwtogQ",
        "likes": "615",
        "description": "Elon Musk has denied that his use of Twitter, the social media platform he owns, is damaging the electric vehicle maker Tesla.\n\nMr Musk is chief executive and product architect of the automotive firm, which announced sales and profits for the October-to-December period ahead of expectations.\n\nOn a call with investors, Mr Musk was asked if his activity on Twitter is hurting Tesla's brand.\n\n\"I think Twitter is actually an incredibly powerful tool for driving demand for Tesla,\" Mr Musk said.\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\n#ElonMusk #Twitter #BBCNews",
        "top_5_comments": [
            "defund the bbc",
            "Nice to see twitter no longer holds a revolving door with the American government, and no longer accepts taxpayer dollars to push government narratives like untested Covid vaccinations",
            "BBC got destroyed by Elon Musk. BBC is totally fake, total liars. I bought 2 Tesla's just because Elon destroyed bbc.",
            "BBC worked really hard to find someone who WOULDN'T buy another Tesla.\n\n- it fits their \"narrative.\"",
            "I though our news in czech are a shithole. Wou that was funny 🍇"
        ]
    },
    {
        "title": "Elon Musk Gives Warning at Trump Rally",
        "author": "Farzad",
        "video_id": "gICC30B7pg0",
        "likes": "3576",
        "description": "The Robots Are Coming https://www.farzadmesbahi.com/merch\nFREE One Year Supply of Vitamin d3+k2 and 5 AG1 Travel Packs ➡ https://drinkAG1.com/farzad\n\nWant to grow your YouTube channel?\nFor editing, more sales or increased views, plus 10% discount.\nQuote ‘Farzad’ to David Carbutt - https://x.com/DavidCarbutt_ \n\nFarzad Clips: https://www.youtube.com/@farzadmesbahiclips\nPodcasts available on your favorite podcast app.\nGet fit! Mention FARZAD when asking for a quote for a custom-built nutrition and fitness plan: https://www.teamevolveperformance.com/\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCgbyN_o-Guwpyqfuuz3pyIw/join\n\nUse my referral link to purchase a Tesla product https://ts.la/farzad69506\n\nI worked at Tesla starting in July of 2017 as an Operations Analyst out of the Bethlehem, PA distribution center facility and left as a Program Manager based out of Austin, TX as of September 2021. I spent most of my time in the distribution and supply chain organizations.\n\nBefore Tesla, I was a Director of Business Intelligence and Pricing at the largest Pet Food & Supply distributor in the US, Phillips Pet Food & Supplies based out of Easton, PA. My wife and I also owned a small business in Bethlehem, PA between 2016 and 2019.\n\nI have been a shareholder of Tesla since 2012 and currently own Tesla stock. Nothing I say constitutes as investment or financial advice.\n\nMy thoughts are my own and are not representative of everyone who currently works, or has worked at Tesla.\n\nIf you like this content I would greatly appreciate your likes and shares!\n\nwww.farzadmesbahi.com\nwww.linkedin.com/in/farzadmesbahi\nTwitter @farzyness\n\n#Tesla #elonmusk #twitter #tsla #TeslaNews #TeslaFSD #TeslaFSDBeta #teslastockanalysis  #TeslaUpdate #investing #ElonMuskNews #teslanews #EV #FSD #investing \n\nElon Musk's Inspiring Speech at Trump Rally\nElon Musk Lets Rip at Historic Trump Rally\nElon Musk at Trump Rally! \"I have 1 ask of you”\nElon Musk at Trump Rally:”Do This NOW!”\nElon Musk Gives Warning at Trump Rally",
        "top_5_comments": [
            "Why would you need an ID to vote, I don't need one to vote by mail. If your voter registery is complete and validated then what can go wrong?\nJust look at Michigan who caught people who voted twice and the clerks who helped them.",
            "Just holding out a tiny bit of hope that this is all some elaborate Kabuki dance on Elon's part...if not, his descent into madness is now complete.",
            "Poor Elon. There are two types of people who stand up when bullets are flying; there are the brave and then there are the stupid. He's just got them mixed up that's all.",
            "History’s best industrialist has pathetic judgement supporting the worst human to ever run for office.  His neice and chief of staff: “trump has 0 redeeming qualities”  A sick psychopathic trump trying to avoid prison supported by Elon still having a hissy fit since Dems trashed him continuously.  I get Elon was unfairly demeaned by Biden but history will show he took it out on the entire World. Shameful. \n\nTesla pundits such as Farzad and his intelligent group know the threat trump poses making Tesla’s success meaningless if Project 2025 is unleashed.  Liz Cheney: by supporting trump, your lifelong shame will remain as your legacy. Shameful. \n\nElon saying if “if trump is not elected, you’ll never be able to vote again” is intense projection of what trump will do and Dems are incapable of otherwise they would have put trump in prison already.  Elon knowingly lying about Dems taking away voter rights, free speech and gun rights is pathetic.\n\nRebadge my Tesla “Sorry About Musks Psychosis” SAMP",
            "Thank you, Elon!  Every vote counts. Trump 2024!"
        ]
    },
    {
        "title": "NEW Tesla Semi Sleeper Cab Version Launched! Elon Musk Reveals 250.000 Miles Range In 18 Months!",
        "author": "TESLA CAR WORLD",
        "video_id": "Y_ct76jFMOU",
        "likes": "1096",
        "description": "NEW Tesla Semi Sleeper Cab Version Launched! Elon Musk Reveals 250.000 Miles Range In 18 Months!\n===\n0:00 Intro\n2:54 Tesla Semi Sleeper Cab Variant\n4:10 Tesla Semi's Incredible Performance Specs\n8:46 Tesla Semi Commercial to External Customers in 2026\n===\nNEW Tesla Semi Sleeper Cab Version Launched! Elon Musk Reveals 250.000 Miles Range In 18 Months! Hi, Welcome to Tesla Car World! You may not know this, but Elon Musk often refers to Semi Trucks as Tesla's ultimate money-saving machine. But Why? We found that if a diesel truck drives an average of 150,000 miles per year, the fuel cost is around $75,000. But with the Tesla Semi, drivers only spend between $20,000 and $30,000, saving between $46,000 and $53,000 annually — that's a 60% to 70% reduction! Incredible, right? PepsiCo drivers have even admitted they don’t want to go back to diesel trucks after getting used to the Semi. And now, Tesla has just launched the new Sleeper Cab version, along with a ton of newly released performance data. Dive in and explore it all right now!\n\nNEW Tesla Semi Sleeper Cab Version Launched! Elon Musk Reveals 250.000 Miles Range In 18 Months! You might be wondering, if the Semi Truck is such a good vehicle, why doesn't Tesla produce it in mass volume?\nBut you know , among all Tesla EV models, Semi Truck is perhaps Tesla's most challenging vehicle. It’s no coincidence that the number of electric trucks has barely increased over the years. You know, the main reason is that Tesla has not yet established an automated electric truck production line at its Nevada factory.\n\nNEW Tesla Semi Sleeper Cab Version Launched! Elon Musk Reveals 250.000 Miles Range In 18 Months! The production of the Semi is still mostly done manually. Moreover, the scale of Semi production is also limited. As you know, the dimension of these big rigs requires a large facility, and Giga Nevada is not sufficient to meet the demand as this factory also has to prioritize battery cell production. This makes the production process slower and more complicated.\n===\n#888999evs #teslacarworld #teslacar #888999 #semitruck #teslasemi \nsubcribe: https://bit.ly/3i7gILj",
        "top_5_comments": [
            "I would love to know how this performs vs diesel in extreme terrain.  I’m thinking I-70 Denver to Silverthorne or really just I-70 across Colorado.  The regen has to make a massive efficiency  difference and should take a lot of pucker out of those long downhills from the Ike and Johnson tunnels and several others.",
            "I thought these sons a biches were supposed to be self driving",
            "Тесла это всегда круто 👍👍👍",
            "It is time to STOP any and every support of ELON MUSK!\nDue to his political slip to support Donald J. Dump there is no space to support anyone of these two idiots!",
            "Clickbait a whole bunch of information and not one picture of a Tesla sleeper semi truck"
        ]
    },
    {
        "title": "Tesla CEO Elon Musk calls Amazon a monopoly: 'Time to break up Amazon'",
        "author": "CNBC Television",
        "video_id": "wIBDPXGfij0",
        "likes": "625",
        "description": "The 'Power Lunch' team discusses Elon Musk's recent tweet calling for a breakup of Amazon.\n\nTesla and SpaceX CEO Elon Musk on Thursday tweeted Thursday that he thinks it’s time to break up Amazon.\n\nHis tweet came after writer Alex Berenson tweeted a screenshot showing that his upcoming book about Covid-19 doesn’t meet Amazon guidelines for sale. Berenson has been a critic of the coronavirus lockdown and has suggested that the risks of serious illness or death are much lower than reported, especially for younger people.\n\n“This is insane @JeffBezos,” Musk said, tagging the Amazon CEO. “Time to break up Amazon. Monopolies are wrong!”\n\nAmazon said later that the book was removed in error, is being reinstated and that it has contacted Berenson.\n\nMusk has been a vocal critic of government policy during the coronavirus pandemic. He has also tweeted in favor of reopening the country and during a Tesla earnings call said stay-at-home orders are fascist, among other things.\n\nMusk has a record of making strange remarks on Twitter. His latest example was on May 1, when he tweeted that Tesla stock “is too high.” In 2018, he said on Twitter he was going to take Tesla private when its stock price his $420 and that he had already secured funding. The SEC sued over that tweet, and both Musk and Tesla paid separate $20 million fines as part of a settlement, and Musk agreed to submit his tweets to an overseer from then on.\n\nIn July 2019, the DOJ announced an antitrust review into Big Tech. In September, the House Judiciary Committee requested documents from Amazon, Apple, Facebook and Google parent company Alphabet. Bezos is the only CEO who has expressed reservations about appearing before the committee, Chairman David Cicilline, D-R.I., said in May.\n\nFor access to live and exclusive video from CNBC subscribe to CNBC PRO: \nhttps://cnb.cx/2JdMwO7 \n \n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic\n \nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n \n#CNBC\n#CNBC TV",
        "top_5_comments": [
            "Hey, something that might interest you. A couple of days ago my Amazon account was closed with no warning for after hours of wasted time they're telling me it's for excessive returns which I think is an error but that's beside the point. When they closed my Amazon account all my Amazon devices that I own for years primarily all my Echo devices stopped working. I lost access to the Amazon Photos and Prime Video which I pay for. So apparently the devices you already own are subject to be disabled by Amazon on your perceived shopping habits! I assume the same applies to all other Amazon devices and services like fire OS tablets, Ring cameras, and probably AWS as well. Just wanted to make other people aware of this because they definitely don't tell you this when you buy your hardware and services.",
            "Has Elon forgot that Tesla is a monopoly on electric vehicles???",
            "Elon Musk meeting with President Trump",
            "How is Elon right you might ask?  The government shut down every aspect of retail, except warehouses at Amazon.",
            "Masta bazos “lottery winning” off the backs of slaves. How many people are hungry and homeless USA December 2020. Bro send me to space now or help out down here"
        ]
    },
    {
        "title": "What Elon Musk just said about Tesla's quarter",
        "author": "CNBC Television",
        "video_id": "Lr_QtCuDxCc",
        "likes": "50",
        "description": "Tesla misses and the stock skids. Elon Musk on Tesla earnings. With CNBC's Phil LeBeau and Melissa Lee, and the Fast Money traders, Tim Seymour, Steve Grasso, Dan Nathan and Guy Adami.\n\n» Subscribe to CNBC: http://cnb.cx/SubscribeCNBC \n\nAbout CNBC: From 'Wall Street' to 'Main Street' to award winning original documentaries and Reality TV series, CNBC has you covered. Experience special sneak peeks of your favorite shows, exclusive video and more. \n\nConnect with CNBC News Online \nGet the latest news: http://www.cnbc.com/ \nFind CNBC News on Facebook: http://cnb.cx/LikeCNBC \nFollow CNBC News on Twitter: http://cnb.cx/FollowCNBC \nFollow CNBC News on Google+: http://cnb.cx/PlusCNBC \nFollow CNBC News on Instagram: http://cnb.cx/InstagramCNBC \n \n#CNBC",
        "top_5_comments": [
            "Coin flipped it’s going up !!!! Urrrrr I didn’t get all my positions filled , :( sad day I’ll take my profits in 2 weeks when it hits 350, best swing stock in 2018 looks to be doing the same again for 2019",
            "CNBC seems to be ignoring Tesla's accomplishments. \"With nearly 140,000 units sold, Model 3 was also the best-selling premium vehicle (including SUVs) in the US for 2018 – the first time in decades an American carmaker has been able to secure the top spot.\"",
            "It is true that China in general is good at very fast construction.",
            "It's like trying to explain what internet is to the old generations. Jesus CNBC come on....",
            "Where this hate coming from? I have never seen such nonsense in my life. CNBC you are a joke..."
        ]
    },
    {
        "title": "Tesla sinks after Twitter users vote for Elon Musk to sell shares",
        "author": "CNBC Television",
        "video_id": "dggGqn4Y6iM",
        "likes": "198",
        "description": "Shares of Tesla drop after Twitter votes for Musk to sell shares. With CNBC's Melissa Lee and the Fast Money traders, Guy Adami, Tim Seymour, Karen Finerman and Dan Nathan. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic \n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "Purchasing a stock may seem straightforward, but selecting the correct stock without a proven strategy can be exceedingly challenging. I've been working on expanding my $210K portfolio for a while, and my primary obstacle is the lack of clear entry and exit strategies. Any advice on this matter would be greatly appreciated.",
            "😭W8",
            "Dan Nathan, biggest weenie on his complaint on TSLA management. Punctuating his bet on his sad inferior Ford to show his loosing position.",
            "Elon currently has 241 million shares of Tesla.Making his net worth around $260 billion. Does this mean he can sell his shares in secondary market?Are the net worth of billionares whose company are publicly traded real net worth?please answer!",
            "Elon does not do anything without reason, so watch the stock"
        ]
    },
    {
        "title": "How Elon Musk Took Tesla To Hell And Back With The Model 3 | CNBC Documentary",
        "author": "CNBC",
        "video_id": "QIt8WuEQntY",
        "likes": "25579",
        "description": "In 2003, a Silicon Valley startup called Tesla Motors came up with an ambitious plan that would transform the auto industry. Founders Martin Eberhard and Marc Tarpenning set out to redefine the electric car. Cars that everyone would want— affordable, environmentally friendly and fast. Their master plan started with a low volume of expensive but alluring electric sports cars. \n\nIn 2004, well-known entrepreneur and SpaceX CEO Elon Musk invested millions of his own money and eventually became CEO. In less than 10 years, Tesla released the groundbreaking Roadster, Model S and Model X, all paving the way for its first affordable electric car, the Model 3. By 2016, Musk and Tesla looked unstoppable.\n\nOver the next year, the company struggled to simply make cars. Tesla was plagued by manufacturing woes, financial losses, a controversial SolarCity acquisition and volatile decision making from its CEO. On top of that, some say Elon Musk was distracted by other projects like the Boring Company and Hyperloop One, was scrutinized for smoking pot on the Joe Rogan Experience, and tweeting that he was taking Tesla private for $420, which led to a SEC lawsuit.\n\n Elon Musk says growing Tesla from the Roadster to Model 3 was a “hell of a ride,” and he took Wall Street along with him. Here’s the wild story of how Tesla started an EV revolution.\n\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic\n\nAbout CNBC: From 'Wall Street' to 'Main Street' to award winning original documentaries and Reality TV series, CNBC has you covered. Experience special sneak peeks of your favorite shows, exclusive video and more.\n\nConnect with CNBC News Online\nGet the latest news: https://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\n#CNBC\n#Tesla\n\nHow Elon Musk Took Tesla To Hell And Back With The Model 3",
        "top_5_comments": [
            "I think they need join with some big companies like Amazon or Cosco companies who ever produce auto businesses , they have franchises you may sign up contract, they may do  service with your company. And every month this service need you hire General Manager to work with those companies. Also put your personal  family property in Trust , which mean All your companies can do these way to manage it, but not effective your family property.",
            "Those you may check Japan, they build that Nuclear factory for future use, and also check that Singapore, which is world Financial Center, they has showing that is best way to get great results for anybody on world.",
            "I also find out  we have to do that as soon as possible, cause no electricity to support all high Energy or electricity.",
            "He has told us we need use Nuclear for electricity, cause our world need build up that for future generation use.",
            "There are many people follow him, save as people many times, why he has many followers, that’s not just happening today, that’s happened many decades."
        ]
    },
    {
        "title": "Elon Musk: Demand far exceeds production",
        "author": "CNBC Television",
        "video_id": "SURasrEvZOM",
        "likes": "463",
        "description": "CNBC's Phil LeBeau reports on Tesla's quarterly earnings results. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/\n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "Elon left ANALysts scratching their ass.",
            "It was Biden's climate legislation that played a big part in Tesla slashing pricing to get under the caps and drive back up demand. The incredible thing for the transition is we care in month 1 if a 10 year plan.",
            "MSM anchors from FOX, CNBC, CNN to Leave-Kevin, were to call out Elon Musk(D by heart) for a drunken trumper, just 3 months ago. He obviously is not that stupid, to support the sinking MAGA supertanker. Fundamentals, revenue and profit matters, and will prevail over FAKE news. Worlds best space rockets and supercars, were not invented by a fool, or a crook like the former, but by a genious, that most losers didnt have the brains to understand and appriciate. 😎💙🇺🇦",
            "Hahaha, CNBC hates having to post these Tesla facts & successes!  They're still lying about demand, they cut prices to not only increase demand but to allow US consumers to get the tax credit.  They can because their margins are 10X higher than their competitors.  Tesla is $175 right now, & in 2023, barring a hard recession, Tesla delivers over 2 million vehicles.   BUY, BUY, BUY",
            "Decreased price means increased demand. Analysts should know this."
        ]
    },
    {
        "title": "Elon Musk Warns Against AI, Says It Is Dangerous",
        "author": "Business Today",
        "video_id": "6cf6dwtdxdI",
        "likes": "3891",
        "description": "#elonmusk  #ai  #twitter #artificialintelligence #ceo #tesla #ytshorts #ytreels \n\n-----------------------\n\nThank You for watching! Do not forget to Like | Comment | Share \n-----------------------\nAbout the channel\nWatch us for the best news and views on business, stock markets, crypto currencies, consumer technology, the world of real estate, bullion, automobiles, start-ups and unicorns and  personal finance. Business Today TV will also bring you all you need to know about mutual funds, insurance, loans and pension plans among others.\nFollow us at:\nWebsite: https://www.businesstoday.in \nFacebook: https://www.facebook.com/BusinessToday\ntwitter:  https://twitter.com/business_today\nInstagram: https://www.instagram.com/business_today/",
        "top_5_comments": [
            "Elon, you are correct .. It’s very Dangerous technology !!!  We need truth in this country with that technology and trust is hard to find these days 😓😓😓😓😓🙏🇺🇸",
            "Says the guy that's going to build a million robots actually more he would build a billion if he could so the guy that's worried about AI is now going to put a body with the AI that he's worried about. He basically plans to put everyone out of work.",
            "\"Humans made the Atomic bomb, but a mouse wouldnt make a mousetrap\" -A.Einstein",
            "If it's dangerous why does he make more",
            "1 year later he releases an uncensored AI. He was just using this line to criticize OpenAI."
        ]
    },
    {
        "title": "Tesla and Elon Musk finally receive encouraging words from Former General Motors executive",
        "author": "CNBC Television",
        "video_id": "W-JMj9OBRM0",
        "likes": "241",
        "description": "Former General Motors executive Bob Lutz, a longtime critic of Tesla and its CEO, Elon Musk, said Wednesday that he’s now encouraged by the direction of the electric-vehicle manufacturer.\n\n“Tesla is finally being run like a normal business,” the former GM vice chairman said on “Squawk on the Street.”\n\n″[Musk] finally reined in his costs,” Lutz said. “He’s reduced personnel and reduced unnecessary expenditures and has basically done what any other businessman would do in a situation where you’re selling a bunch of stuff but you’re not profitable” on a sustained basis.\n\nIn October, Tesla reported a surprise third-quarter profit as part of a strong stretch of months for the carmaker. Along with the completion of its Shanghai factory and better-than-expected fourth-quarter deliveries, shares of Tesla more than doubled since late September, trading as high as $498 in Wednesday’s session.\n\nLutz, who retired in 2010 after 47 years in the auto industry, had previously said he thought Tesla was “headed for the graveyard.”\n\n“They will never make money on the Model 3 because the cost is way too high,” Lutz said in September 2018. “He’s got 9,000 people in that assembly plant producing less than 150,000 cars a year. The whole thing just doesn’t compute.”\n\nBut the situation, particularly regarding the Model 3, has dramatically changed, Lutz said Wednesday. Tesla has “achieved a volume break through, with the plant in China opening and selling a lot of Model 3s,” he added.\n\nFirst debuted in the summer of 2017, the Model 3 had a “relatively slow start,” Lutz contended. But it became the bestselling electric vehicle in the world in the first 11 months of 2019.\n\nLutz said that accelerating Model 3 sales, especially ones with bells and whistles, have been aided by its perception as a high-end alternative to cars from BMW or Mercedes-Benz. He said he believed, when factoring in additional features, a lot of Model 3s were actually selling around $55,000 to $60,000.\n\n“As long as they can keep that premium pricing, which is as I say about $33,000 over where they had originally talked about, obviously that car is going to be profitable,” Lutz said.\n\nTesla had previously advertised plans for a $35,000 version of the Model 3, but the approach was significantly altered in the spring. In October, Tesla raised the price of its most affordable version of the Model 3 about $500 to $39,490.\n\nEven so, Tesla’s Model 3 has actually contributed to an overall decline in the average price of electric vehicles, according to data from Cox Automotive that publication Inside EVs reported on. The average cost to buy an EV in the U.S. in September was around $56,000. One year earlier it was around $64,000, according to the Inside EVs report.\n\nLutz said he also thought Musk, who is known for his sometimes eccentric personality and bold predictions, has moderated.\n\n“He has been quite adept,” Lutz said. “The encouraging thing to me about Tesla is from Elon there is less talk, less bluster ... he is focusing on the business, focusing on the product and focusing on cost control.”\n\nFor access to live and exclusive video from CNBC subscribe to CNBC PRO: https://www.cnbc.com/pro/?__source=youtube\n \n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic\n \nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n \n#CNBC\n#CNBC TV",
        "top_5_comments": [
            "Classic CEO of these big companies. Make bad decision and then change the talk once they see them going wrong.",
            "This is how MBA CEO operate. They have screwed us. And this joker is supposed to be legend. Haha. He does not have highly paid CEO. Elon is a engineer and not on finances.",
            "You all got a thing for Elon?\nY'all sound like a bunch of high school girls going after Bob Lutz cuz you got a \"thing\" for Elon! Y'all probably can't sleep thinking of Elon every night cuz he's so Dreamy! WTF is with you girls?💕",
            "Every time I here him talk I just want to say: \"Thanks boomer\"\n\nI mean it's a laugh to say that Musk has stopped being the meme techno king👑 and is running the company \"more normal\", he just wants to cover his ass for his previous miss-statements.\nOh and the losses were because he was building factories.\nYou need the factories to produce the car. However in Bobs world apparently it goes the other way and you have a profit before you build a factory??? 🙃\nAnd Tesla has plenty of tech advantages... like self driving (ffs), etc.",
            "This guy has no clue how to run a business."
        ]
    },
    {
        "title": "Elon Musk May Be Feeling Buyer's Remorse As Twitter & Tesla Stocks Take A Dive",
        "author": "The Young Turks",
        "video_id": "sGJPTNvzGng",
        "likes": "3557",
        "description": "Times could be getting tougher for Elon Musk as shares of both Twitter and Tesla have been tanking recently, reportedly shaving off a cool $40 million from his initial investment in Twitter that could have netted him a profit of $1.1 billion. Wonder if Elon is experiencing any buyer’s remorse for jumping into his deal to buy Twitter...Cenk Uygur and Ana Kasparian discuss on The Young Turks. Watch LIVE weekdays 6-8 pm ET. http://youtube.com/theyoungturks/live\n\nRead more HERE:  \nhttps://markets.businessinsider.com/news/stocks/elon-musk-twitter-takeover-profit-loss-stock-market-crash-outlook-2022-5\n\n\"Elon Musk has seen potential gains of $1.1 billion wiped out over the past four weeks as Twitter's stock has plummeted.\n\nMusk began snapping up shares in the social media company in January, building up a 9.1% stake. Before agreeing to buy the company outright on April 14, he owned 73 million shares at an average price of $36.16.\n\nTwitter shares hit $51.70 on April 25 - which would have represented a $1.1 billion profit for Musk. But they've since fallen 31% to below $36 - turning that billion-dollar gain into a $40 million loss.\n\nTwitter fell 6% Tuesday as investors sold off social media and advertising stocks after Snap announced it would miss its second-quarter revenue target. It's fallen 28% in the last month and 18% so far this year.\"\n\n***\n\nThe largest online progressive news show in the world. Hosted by Cenk Uygur and Ana Kasparian. LIVE weekdays 6-8 pm ET. \n\nHelp support our mission and get perks. Membership protects TYT's independence from corporate ownership and allows us to provide free live shows that speak truth to power for people around the world. See Perks: ▶ https://www.youtube.com/TheYoungTurks/join\n\n\nSUBSCRIBE on YOUTUBE: ☞ http://www.youtube.com/subscription_center?add_user=theyoungturks\nFACEBOOK: ☞ http://www.facebook.com/TheYoungTurks\nTWITTER: ☞ http://www.twitter.com/TheYoungTurks\nINSTAGRAM: ☞ http://www.instagram.com/TheYoungTurks\nTWITCH: ☞ http://www.twitch.com/tyt\n\n👕 Merch: http://shoptyt.com\n\n❤ Donate: http://www.tyt.com/go\n\n🔗 Website: https://www.tyt.com\n\n📱App: http://www.tyt.com/app\n\n📬 Newsletters: https://www.tyt.com/newsletters/\n\n\nIf you want to watch more videos from TYT, consider subscribing to other channels in our network:\n\n\n\nThe Damage Report ▶ https://www.youtube.com/thedamagereport\n\nTYT Sports ▶ https://www.youtube.com/tytsports\n\nThe Conversation ▶ https://www.youtube.com/tytconversation\n\nRebel HQ ▶ https://www.youtube.com/rebelhq\n\nTYT Investigates ▶ https://www.youtube.com/channel/UCwNJt9PYyN1uyw2XhNIQMMA\n\n\n#TYT #TheYoungTurks #BreakingNews\n\n220526__TB05_Dark_Days_Musk",
        "top_5_comments": [
            "These people😅",
            "For the price that he will end up paying for Twitter, he’ll be just fine.",
            "He will be just fine.",
            "Why anyone would want to spend any time in the sewer that is Twitter is beyond me.....",
            "He could spend his $$$ to feed the world and cure diseases.\nBut being a fatcat @sshole is more important to his petty, tiny mind.\nSorry Musk worshipers."
        ]
    },
    {
        "title": "Elon Musk is good at delivering on promises but not on time, says ex-Tesla president John McNeill",
        "author": "CNBC Television",
        "video_id": "Nh3UQTOxK-I",
        "likes": "297",
        "description": "Jon McNeill, DVX Ventures CEO and former Tesla executive, joins 'Squawk Box' to discuss the company's first-quarter earnings, Elon Musk's performance, the broader electric vehicle market, and more. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV ",
        "top_5_comments": [
            "So I guess we will finally see Full Self Driving by year 2100?  since \"Elon Musk is good at delivering on promises but not on time, says ex-Tesla president John McNeill\"",
            "CNBC hates Elon And Tesla because they are shills for the Democrat party.  This guy is on the Board of GM for God’s sake.  This interview is shameless!  CNBC has no credibility.",
            "Turning an amazing accomplishment, into a hit piece.",
            "Revenue warmt channell yngran single gogle ferbok mensiye",
            "Texa biden winner"
        ]
    },
    {
        "title": "Inside Elon Musk's high stakes visit to China #shorts",
        "author": "Yahoo Finance",
        "video_id": "vBi95wFgko8",
        "likes": "389",
        "description": "Yahoo Finance Live Senior Reporter Pras Subramanian discusses Elon Musk's latest visit to China, Tesla expansion, Shanghai’s Gigafactory and Chinese EV competition.\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#yahoofinance #finance #news #youtubeshorts #youtube #shorts #shortsvideo #elonmusk #tesla #china #ev #market #electricvehicle #teslastock #stockmarket",
        "top_5_comments": [
            "us doesn't support EV cars so china helps elon to make it true",
            "He is a big part of orchestrating bilateral commercial peace between USA and China. \nI used to not like China because of their communism and various other ethical reasons..\nBut there's good in them.. and  there's really no way earth could withstand war between USA and China. \nElon is right on this point and he has and will play a big role in indirectly supporting commercial peace between the 2 major world powers. I hope.\nI'm not sure that he can stop war between the 2 but I hope he tries. But he has always supported being nice to China. I think I'm coming around to agreeing with him. Plus our lives are so much better with made in China stuff. Made effordable accessible and massively improved lives. \nI do hope China is a friend of America.  That way we all won't die.",
            "Communist China never owns 🇹🇼 Taiwan how can you ask for return?",
            "👎👎👎👎👎",
            "Space Karen"
        ]
    },
    {
        "title": "Tesla CEO Elon Musk suspends the use of bitcoin to purchase vehicles | ABC News",
        "author": "ABC News (Australia)",
        "video_id": "dKgFLdWUsNY",
        "likes": "175",
        "description": "Tesla Inc has suspended the use of bitcoin to purchase vehicles, chief executive officer Elon Musk said in a tweet on Wednesday, citing concerns about the use of fossil fuel for mining the cryptocurrency.\n\nSubscribe: http://ab.co/1svxLVE  Read more here: https://www.abc.net.au/news/2021-05-13/tesla-suspends-bitcoin-purchases-over-fossil-fuel-concerns/100136126\n\nABC News provides around the clock coverage of news events as they break in Australia and abroad, including the latest coronavirus pandemic updates. It's news when you want it, from Australia's most trusted news organisation.\n\nFor more from ABC News, click here: https://ab.co/2kxYCZY\nWatch more ABC News content ad-free on iview: https://ab.co/2OB7Mk1\n\nGo deeper on our ABC News In-depth channel: https://ab.co/2lNeBn2\nLike ABC News on Facebook: http://facebook.com/abcnews.au\nFollow ABC News on Instagram: http://instagram.com/abcnews_au\nFollow ABC News on Twitter: http://twitter.com/abcnews\n\n#ABCNews #ABCNewsAustralia",
        "top_5_comments": []
    },
    {
        "title": "How long you take to Mars in Starship .. #elonmusk",
        "author": "SccS",
        "video_id": "UDBnlW8legg",
        "likes": "351870",
        "description": "In this video Elon Musk tells us how much time it take to arrive to Mars in the Starship spacecraft. Full details are in the video.\n\nElon Musk (born June 28, 1971) is a business magnate and investor. He is the founder, CEO and chief engineer of SpaceX; angel investor, CEO and product architect of Tesla, Inc.; owner and CEO of Twitter, Inc.; founder of The Boring Company; co-founder of Neuralink and OpenAI; and president of the philanthropic Musk Foundation. With an estimated net worth of around $196 billion as of February 15, 2023, primarily from his ownership stakes in Tesla and SpaceX, Musk is the second-wealthiest person in the world, according to both the Bloomberg Billionaires Index and Forbes's real-time billionaires list ... (From Wikipedia)\n\nMars is the fourth planet from the Sun and the second-smallest planet in the Solar System, larger only than Mercury. In the English language, Mars is named for the Roman god of war. Mars is a terrestrial planet with a thin atmosphere and has a crust primarily composed of elements similar to Earth's crust, as well as a core made of iron and nickel. Mars has surface features such as impact craters, valleys, dunes, and polar ice caps. Mars has two small, irregularly shaped moons, Phobos and Deimos ... (Wikipedia)\n\nStarship is a fully reusable super heavy-lift launch vehicle under development by SpaceX. Standing 120 m (390 ft) tall and with more than twice the thrust of the Saturn V, it is designed to be the tallest and most powerful launch vehicle ever built, and the first capable of total reusability. Partially and fully expendable variants may also be developed. The Starship launch vehicle is made up of the Super Heavy first-stage booster and the Starship second stage. The second stage functions as a self-contained spacecraft for carrying crew or cargo once in orbit. Both stages are powered by Raptor engines that burn liquid oxygen and liquid methane propellants in a highly efficient, full-flow staged combustion power cycle. Both rocket stages are designed to be reused by landing vertically at the launch pad or at a separate platform ...(From Wikipedia)\n\n#shorts #short #elonmusk #joerogan #starship #aircraft #astronomy #mars #planets #planet #orbit #spacecraft #spacecraft #spacex #space #nasa #time #journey #discover #entertainment #education #inspiration #inspirational #astrophysicist #astrophysics #tesla #twiter #jupiter",
        "top_5_comments": [
            "I hope to live long enough to watch the first humans land on Mars and return safely. What a stunning achievement that would be!",
            "🎬🧿",
            "52 000 km per hour , 6 months  , 225 millions km ❤❤❤",
            "Thanks momma New.",
            "If you miss mars you die btw. There’s no way to come back. You’ll die."
        ]
    },
    {
        "title": "Elon Musk: If Trump loses i am f*cked",
        "author": "OneProcent",
        "video_id": "js0721jzrUc",
        "likes": "1009",
        "description": "#shorts #ElonMusk #TuckerCarlson #Interview #SpaceX #X #Tesla #FutureOfTech #SocialMedia #FreeSpeech #ElonMuskInterview #TeslaCEO #ElonMuskVision #Technology\nIn this explosive interview, Elon Musk sits down with Tucker Carlson to discuss major topics like free speech, AI, and the future of social media. Watch as Musk shares his bold opinions on Twitter, politics, and the state of technology today. Get exclusive insights into Elon Musk’s vision for the future, his thoughts on artificial intelligence, and what’s next for SpaceX and Tesla.",
        "top_5_comments": [
            "I love Elon,even though he banned me on X",
            "Funny, but it isn't far from reality",
            "Trump has to win c’mon yall",
            "You fucked dude 😂😂😂😂😂",
            "As Mike said, \"No half measures\"."
        ]
    },
    {
        "title": "🌌💬 Elon Musk's Epic Motivation: Brace for Goosebumps!",
        "author": "Motivation Zone",
        "video_id": "piRYz57nbbc",
        "likes": "94",
        "description": "👀🎞️ FULL VIDEO 👉 https://youtu.be/IiCjaQjzheE\n\n#ElonMusk #Motivation #ReachForTheStars #motivationzone #motivationalvideos #motivation #motivationalquotes #motivational #motivationalspeaker #quotes #inspirationalquotes #success #motivationalspeech #inspiration #motivationalvideo #successquotes #motivationmonday #inspirational #dailymotivation #inspirationalvideos #motivationalwords #motivationalquotesoftheday #motivationquotes #lifequotes #motivationalquote #successmindset #motivationalpost #motivated #viral #fyp  \n\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n💖 Support my channel by buying me a coffee! ☕🙏: https://www.buymeacoffee.com/motivationzone\n\nFollow us on social media: \n✅ Tik Tok: 👉 https://www.tiktok.com/@motivationzonehub\n✅ Instagram: 👉 https://www.instagram.com/TheMotivationZoneHub\n✅ Facebook: 👉 https://www.facebook.com/MotivationZoneHub\n\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n\nDISCLAIMER: This video was created with the aim to educate and inspire its audience. Motivation Zone does not own the video clips or the music, i.e. all rights are reserved to their respective owners. If the owner/s would like to get the music or video clips removed, I have no problem in doing so. (There is no negative impact on the original content) \n\nCOPYRIGHT POLICY: Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \"fair use\" for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\n\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬",
        "top_5_comments": [
            "Bill Gates was one of the people shorting it.",
            "Being one of the world's richest people doesn't stop this man from being one of the world's biggest losers",
            "ㅋ"
        ]
    },
    {
        "title": "Elon Musk Admits: 'I'm a Bigger Fan of Edison Than Tesla – Here's Why! #shorts",
        "author": "MissionPadhne",
        "video_id": "DM0mRQ8fXiI",
        "likes": "378",
        "description": "SUBSCRIBE to @missionpadhne and join me in the Journey to learn something new every\nday.\n\nLet's Learn together\nSUBSCRIBE NOW: @missionpadhne\n\n#shorts #jimcarrey #hollywood #funny #interview #speech #missionpadhne  #jackmashorts #motivation #inspiration #india #jackma #munibamazari #nikolatesla \n#elonmuskmotivation #edison \n\nThis content doesn't belong to MissionPadhne, it is edited and shared only for the purpose of awareness, and if the content OWNER (visual/audio) of this content has any issue, we request you to directly message me, thus we sort out the outcome.\n\nRegards,\nMissionPadhne",
        "top_5_comments": [
            "Tesla > Edison. Edison was a fraud.",
            "because TESLA was poor guy. Edison use his inventions to get registered under his name and pay for Teslas work to get more.",
            "Tesla was  shut down by government,, Elon is lucky",
            "A little more play than he gets in current society....pun intended? 😊",
            "Now I'm biggest fan of Woolworths 😂"
        ]
    },
    {
        "title": "Elon Musk's Prediction for AI Future",
        "author": "DeclanLTD",
        "video_id": "DqH_4uJ2BOI",
        "likes": "13006",
        "description": "Subscribe to my channel. #shorts\nFollow the Instagram: https://www.instagram.com/declanltd/\n\nThis content doesn’t belong to DeclanLTD, it is edited and shared only for the purpose of awareness, and if the content OWNER (visual/audio) of this content has any issue, we request you to directly message to this page, thus we sort out the outcome.⁣⁣⁣⁣⁣⁣⁣⁣⁣⁣\nRegards,⁣⁣⁣⁣⁣⁣⁣⁣⁣\nDeclan",
        "top_5_comments": [
            "I believe!!!",
            "I be wondering is his shirt brand new ???",
            "A non-answer. What a perfect CEO",
            "I feel like AI will become (a God) to meny people",
            "Say it right away"
        ]
    },
    {
        "title": "A Buying Opportunity #elon #teslastock @Manatek",
        "author": "Manatek",
        "video_id": "rXVzXpwFvt8",
        "likes": "2",
        "description": "",
        "top_5_comments": [
            "A🚘m❤️uzi🚘ng with kind of T🚘❤️🚘esla to d🌟✨️esign best❤🚘🌏🫠🫠🫠"
        ]
    },
    {
        "title": "CityBiz: U.S. markets at all-time highs, Elon Musk questions Tesla stock rally",
        "author": "CityNews",
        "video_id": "FrLWq8AJykA",
        "likes": "31",
        "description": "The latest business news with Kris McCusker, including U.S. markets at all-time highs, Elon Musk asking questions about a rally in Tesla stock, and Elton John debuts his own eyewear line.",
        "top_5_comments": [
            "can we go higher?",
            "Let's go Castro",
            "Whats to question....We Believe in Tesla👏👏👏",
            "Lets go Brandon 🤘🤘",
            "John also says homosexuals make better parents than heterosexuals...because they buy them with their hard earned money.\nHe wont be getting my hard earned money."
        ]
    },
    {
        "title": "Elon Musk Gets Irritated",
        "author": "Kingpin's Mindset",
        "video_id": "YlD0rRMV7ME",
        "likes": "976693",
        "description": "🌐 Kingpin's Mindset Official Website:\nhttps://kingpinsmindset.com\n\n📩 Business Inquiries:\nReach out to us at business@kingpinsmindset.com\n\n#shorts #elonmusk #tesla",
        "top_5_comments": [
            "Soros is a criminal",
            "Because everything you hear about Soros is TRUE.",
            "I absolutely love Elons conviction he’s a brilliant man and has worked hard to contribute to our society with great useful inventions and EVERYONE always trying to come at him!!! He’s entitled to opinion just like everyone else!!! PROUD OF YOU ELON❤",
            "This interviewer did not know how honest Elon Musk could be to asked such a stupid question of all the questions he could of asked do not mess with Elon Musk he is a very intelligent man",
            "George soros is a dark man and probably this question is sent by him to ask elon and the question has inside deep meanings only billionere and powerful man can understand actually."
        ]
    },
    {
        "title": "Elon musk got sued for $258 Billion ! #shorts",
        "author": "Sahil Bhadviya",
        "video_id": "EavheufknWE",
        "likes": "783",
        "description": "-Complete course on money management: https://www.sahilbhadviya.in/\n-1:1 Mentorship https://topmate.io/sahil_bhadviya\n- To opt for best Life & Health insurance: https://bit.ly/3QygLAU\n_______________________________________________________________\n- Follow me on Youtube : https://www.youtube.com/c/SahilBhadviya\n- For stock update on Telegram: https://t.me/s/sahilbhadviya\n-For daily stock market update on Instagram: https://instagram.com/sahilbhadviya_?igshid=1mvrux9m5hdjf\nTwitter: https://twitter.com/sahilbhadviya?t=2Q8BjmYs2sEVFegkUhWVwA&s=03\n-Linkedin: https://www.linkedin.com/in/sahil-bhadviya-1b871234/\n- Quora: https://www.quora.com/profile/Sahil-Bhadviya\n\n\nDisclaimer: This video is only for education purpose. Consult your financial Advisor before investing your money. \n\n#shorts #elonmusk #dogecoin #cryptocurrency",
        "top_5_comments": [
            "You have to acknowledge at the same time, knowing that whoever had doge coin, lost money, guess what, elon had tons in doge coin as well, so he also lost a lot of money. Use your brain a little. Why isnt anyone saying anything about that? Because all they can do is cherry pick to make a case in a situation they have no point to make just to get views and clicks and look better using someone elses fame to do so",
            "Okay so its ignorant to do any trade on the stock market and the crypto market based on other peoples opinions without doing the proper research yourself. Its not on elon or anyone for promoting. Its still a decision each individual has to make on there own. Elon nor anyone else forced anyone to purchase outside there will. People need to acknowledge and face there own mistakes, not blame others for there own personal failure. Its like purchasing a product because its cheaper so you think your getting a discount but when you get it, its made with cheap materials and is only a counterfeit stolen design from china that breaks in a week, and then sueing for it when all you had to do is research a little and see it wasnt on the official site of the products designer and just another shop taking peoples money for someone elses work. Except in elons case, it was far less of an issue because he didnt sell anything, he just tweeted something. If you spend your life saving because of a tweet, you might just deserve to lose. You cant sue casinos for you losing a bet, and investing is just as much a gamble. People need to quit making any reason they can to not take blame for actions they made under there own decision to. Elon should counter sue for stupidity.",
            "Not dodge",
            "10$ in dogecoin 😆 🤣 didn't lose much",
            "Ummm. It's a gamble. You can't sue based on a gamble. He won't win."
        ]
    },
    {
        "title": "Why Elon Musk Sold More Tesla (TSLA) Stock",
        "author": "Farzad",
        "video_id": "iDYfyeg1uOA",
        "likes": "729",
        "description": "#elonmusk #tsla #tesla \n\nElon Musk sells more Tesla TSLA shares in order to complete Twitter TWTR acquisition. \n\nSupport me on Patreon:\nhttps://www.patreon.com/farzadmesbahi\n\nI worked at Tesla starting in July of 2017 as an Operations Analyst out of the Bethlehem, PA distribution center facility and left as a Program Manager based out of Austin, TX as of September 2021. I spent most of my time in the distribution and supply chain organizations.\n\nBefore Tesla, I was a Director of Business Intelligence and Pricing at the largest Pet Food & Supply distributor in the US, Phillips Pet Food & Supplies based out of Easton, PA. My wife and I also owned a small business in Bethlehem, PA between 2016 and 2019.\n\nMy thoughts are my own and are not representative of everyone who currently works, or has worked at Tesla.\n\nIf you like this content I would greatly appreciate your likes and shares!\n\nwww.farzadmesbahi.com\nwww.linkedin.com/in/farzadmesbahi\nTwitter @farzyness\n\n#TeslaNews #teslastockanalysis #TeslaUpdate #ElonMusk #ElonMuskNews #teslanews #EV #investing #twitter #TWTR",
        "top_5_comments": [
            "If you have no date attached you lose credibility",
            "watching this 1 yr later near end of 2023.  still painful",
            "This short just showed in my YT feed out of nowhere and I was surprised to learn Elon had sold even MORE stock, then realized this is almost 1 year old news. 😂",
            "I'm tired of Elon lying. He said he wouldn't sell for a few more years.",
            "Huh\nSo buying time soon\nHuh. Nice 🎉 😮"
        ]
    },
    {
        "title": "This is Elon Musk his daily routine 💼 #shorts",
        "author": "Musk Munition",
        "video_id": "LqEsbAnfOCA",
        "likes": "27025",
        "description": "Elon Musk his daily routine #shorts #elonmusk SUBSCRIBE for your daily dose of Elon: https://bit.ly/3PkvdMl\n\nElon Musk, Trillionaire, Tesla, SpaceX, Dogecoin, Bitcoin, Cryptocurrency, Jeff Bezos, Billionaire, Motivation Podcast, SolarCity, Neurolink, The Boring Company, Money, Wealth, Business, Entrepreneur, Environment, Python, Sustainable Energy, Investing, Investment, Stock Market, Coins, Cash, Real Estate, Science, Technology, Interview, Speech, Information, Infotainment, Artificial Intelligence, Robots, Machines, Automation, Coding.\n\nThe vision of Musk Munition is to transform the original content from shows, podcasts and key-notes with Elon Musk into a more immersive experience. We hope that our work can help educate as many people through this channel by making information easier for consumers on their own time without any interruptions or distractions.\n\nelon musk motivation,elon musk,elon musk motivational video,elon musk interview,elon musk speech,elon musk motivational speech,motivation,elon musk tesla,elon musk crying,elon musk motivational,elon musk motivation never give up,motivational video,elon musk best speech,motivational,elon musk motivation video,elon musk inspirational video,motivational speech,elon musk emotional,elon,elon musk emotional speech,motivational speech elon musk\n\nThe content used in videos is licensed by our partners, and if you are the legal owner of any third-party material that has been featured on this channel then please e-mail us at info@muskmunition.com. We'll be happy to resolve your problem!\n\n💚 Fair Use Disclaimer \nThe videos have no negative impact on the original works. We make them for educational purposes and they're transformative in nature, since we only use audio footage or tiny pieces of video content when it's necessary to explain something more clearly - all within legal limits of course!\n\nThis video features materials protected by the Fair Use guidelines of Section 107 of the Copyright Act. All rights are reserved to the copyright owners.\n\n❗️DISCLAIMER: \nOur channel is not associated with Elon Musk in ANY way and is purely made for entertainment purposes, based on facts, rumors, and fiction.\n\nCopyright Disclaimer under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. Fair use is a use permitted by copyright statutes that might otherwise be infringing.\n\n#Elonmusk #Elon #Musk #Tesla #SpaceX #theboringcompany #Neuralink #Tech #Technology #AI #Robots #Space #Solarcity #shorts #BusinessMagnate #TechnoKing #Entrepreneur #Habits #Billionaire #BillionaireZone #Cash #Mindset #Money #MentalToughness #Wealth #Fearless #BillionaireLifestyle #Motivation #MotivationalQuotes #InspirationalQuotes #SuccessQuotes #Hustle",
        "top_5_comments": [
            "Madonna Elon musk sei di una bellezza disarmante 😍❤❤❤",
            "Elon 💪🏾💯",
            "So his routine is the same as the vast majority on this planet.",
            "😅",
            "Are khane,sone or kaam ke alawa bhi to kuch batamij milsansaar logo ko bato ke batashe fodne ke liye bhi time chahiye."
        ]
    },
    {
        "title": "Elon Musk's Tesla in deep trouble #upsc #ias #cse #ips",
        "author": "StudyIQ IAS",
        "video_id": "AqGyCjvbo6U",
        "likes": "20354",
        "description": "Enrol to StudyIQ's Flagship UPSC IAS (Pre + Mains) LIVE Foundation Batch 9. \nAdmissions closing  on 10 DEC'22 | \nEnrol now - https://bit.ly/upscbatch9\n\nA time-tested focused method for clearing Prelims 2023\n1. Live Classes\n2. Static and Current Affairs Booklets\n3. Workbook-based Test Series\nJoin our flagship ‘UPSC IAS Live SIP+ 2023 Batch’ to prepare for prelims 2023 exam.\nBatch starting on 19th December, 2022 | Timing - 7:00 PM\nJoin Now : https://bit.ly/SIP_Clear_Prelims_2023\n\nJoin our Most Requested NCERT LIVE Batch to start your UPSC Journey. \nBatch Starting on - 05 DEC’22| 07:00 PM\nJoin Now - https://bit.ly/3TPej9r\n\n\nUPSC Civil Services Examination is the most prestigious exam in the country. It is important to lay a comprehensive and strong General Studies foundation for the exam. Both Prelims and Mains can’t be cleared without a strong Foundation. Time is running out and seats are limited for the batch. \n\n\nJoin StudyIQ’s Test Series for various examinations and evaluate your preparation.\nClick on this link to know more : http://bit.ly/3H13vma \n\n\nOptional Papers are an important component of the Mains examination. Without a good score in Optionals, it is difficult to get a good rank. Increase your chances of scoring 300+ in optionals.\n\nUPSC IAS (Mains) LIVE Optional Batches : https://bit.ly/3DrHsmw\n\nUPSC IAS (Mains) LIVE PSIR Optional Batch 3\n Admissions closing on 5th Dec '22 | \nTo know more visit : https://bit.ly/3Nu0mfT\n\nSociology Optional Live Foundation Batch 1 by Deepanshu Singh\nBatch Starting On 19 Dec’22| \nTo know more visit : https://bit.ly/3Vwttlf\n\nUPSC IAS (Mains) LIVE Geography Optional Batch 4 \nStarting On  26th December’22 | \nTo know more visit - http://bit.ly/3OBpcuP\n\nJoin UPSC Ethics Module - GS Paper 4 to score higher marks in GS PAPER 4\nBatch Starting on 19 Dec’22| 7PM\nJoin Now : http://bit.ly/3UBO4E9\n\nUPSC General Studies and Optional Combo batches\n\nGet extra discount by subscribing to our Combo batches: https://www.studyiq.com/upsc-combo-ba...\n\n \nUPSC and State PCS Combo batches\n\nUPSC + Uttar Pradesh PSC (Pre + Mains) LIVE Foundation Combo Batch 3\nAdmissions Closing on 10th December'22 \nTo Know more visit:  http://bit.ly/3tyOL5X\n\nUPSC + Bihar PSC (Pre + Mains) LIVE Foundation Combo Batch 3\nAdmissions Closing on 10th December'22 | \nTo Know more visit: http://bit.ly/3ExjW7O\n\nThe important course features are -\n1. 1000+ Hours of Live teaching by our faculties\n2. One-to-one mentorship to keep you on track to achieve the target\n3. Handmade and concise Lecture Notes, Handouts on static topics\n4. MCQ based learning for every lecture to enhance retention\n5. Answer writing program guided by our experienced faculties\n6. Daily Current Affairs Programme (CAP) PDF + Videos covering multiple sources\n7. Benchmarking of students through weekly revision tests for students\n8. Prelims Test Series to make you battle ready for Prelims exam\n9. Gyanvani sessions by senior bureaucrats, selected candidates and senior aspirants\n10. CSAT Lectures to help to adapt with changing patterns of examination.\n\n\n\nGaurav Sir Courses - One-Stop Solution for Current Affairs of all Government Exams.\nGaurav Sir Current Affairs  https://bit.ly/3jwDRsv\nComplete Static GK by Dr. Gaurav Garg https://bit.ly/3O0FaxE\nBanking Awareness (Static) by Dr Gaurav Garg https://bit.ly/36dElAI\n \nVipan Sir Courses - Courses to help you gain an edge with MCQs preparation\n10000 MCQs of GA by Vipan Sir https://bit.ly/367qqMi\nGS - Dr. Vipan Goyal    https://bit.ly/3vbslbn\n\n\nStudyIQ is known for its superlative content and UPSC Books. Check the following links to order Books\n\nPrinciples of Geography\nAmazon: https://amzn.to/3Py3o3c\nFlipkart: https://bit.ly/3yVffAT\n\nFundamentals of Geography\nFlipkart: https://bit.ly/3MCUz6a\nAmazon: https://amzn.to/3PzEQXy\n\nIndian Economy\nAmazon : https://amzn.to/3zS4mls\nFlipkart: https://bit.ly/3xTdO5m\n\nIndian Art and Culture\nAmazon : https://amzn.to/3BhVypR\nFlipkart: https://bit.ly/3OXyRKN\n\nModern Indian History\nAmazon: https://bit.ly/3AnIC07\n\nDownload the App to Subscribe to the Course - https://bit.ly/StudyIQAPP\nFor More Information regarding the course, Visit: https://bit.ly/upscbatch9 \nFor any doubt, Call 080-6897-3353 or Click here for Whatsapp Chat http://wa.me/917703861353",
        "top_5_comments": [
            "UPSC IAS (Pre + Mains) Live Foundation Batch 9 Starting  On 30th NOV'22 | Daily Live Class at 8:00 AM|\nHurry Enroll Now : https://bit.ly/upscbatch9\nUPSC IAS (Pre + Mains) Live Foundation Batch 8 |Batch Started On 14th Nov’22  |Daily Live Class at 6:00 PM\nHurry Enroll Now :https://bit.ly/3zFtNFL\n\nUPSC IAS (Pre + Mains) LIVE Foundation Weekend Batch 2|\nNew Batch Starting On 27th November '22 | \nHurry Enroll Now : https://bit.ly/3fzN70j\n\nUPSC IAS (Mains) LIVE Optional Batches : https://bit.ly/3DrHsmw\n\nUPSC IAS (Mains) LIVE PSIR Optional Batch 3\nBatch Starting on 25th November | \nTo know more visit : https://bit.ly/3Nu0mfT\n\nUPSC IAS (Mains) LIVE Geography Optional Batch 3\nAdmissions closing on 30th November | \nTo know more visit - https://bit.ly/3gL3o2R\n\nUPSC IAS (Mains) LIVE History Optional Batch 2\nAdmissions closing on 30th November’22 | \nTo know more visit - https://bit.ly/3TGWOce\n\nUPSC IAS (Mains) LIVE Sociology Optional Batch 2 \nAdmissions closing on 30th November|\nTo know more visit -https://bit.ly/3sWpkek\n\nUPSC + Uttar Pradesh PSC (Pre + Mains) LIVE Foundation Combo Batch 3\nBatch starting on 30th NOV'22 | \nTo Know more visit: http://bit.ly/3tyOL5X\n\nUPSC + Bihar PSC (Pre + Mains) LIVE Foundation Combo Batch 3\nBatch starting  on 30th NOV'22 | \nTo Know more visit:  http://bit.ly/3ExjW7O\n\nUPSC + Jammu Kashmir PSC (pre + Mains ) Live Foundation Batch 2\nAdmissions Closing on 30th NOV'22 \nTo Know more visit : http://bit.ly/3TxJSo5\n\nUPSC + OPSC (Pre + Mains) Live Foundation Batch 2\nBatch starting  on 30th NOV'22 \nTo Know more visit :http://bit.ly/3EsUrDJ\n\nUPSC + Assam PSC (Pre + Mains) Live Foundation Batch \nBatch starting  on 30th NOV'22  \n\nTo Know more visit : http://bit.ly/3GgM8gx",
            "Daily technology is killing people",
            "Thank God the Supras would be safe now",
            "I am not going to buy tesla only tata",
            "All about  money....."
        ]
    },
    {
        "title": "Elon Musk body shame on twitter #elonmusk #tesla #viral #bitcoinnews",
        "author": "SUBLIMINAL QUEEN",
        "video_id": "cx3MQBTiEVQ",
        "likes": "8386",
        "description": "",
        "top_5_comments": [
            "Cyberstomach you can get one for only $78,000 you haven’t heard ?",
            "Money clearly can't buy everything 😂",
            "Elon musk is pregnant 😂",
            "Cyber trucks 💀",
            "Body don’t matter when u got all that money 💴 money 💴 😂😂😂😂😂😂😂😂 stop haters u just jealous"
        ]
    },
    {
        "title": "Elon Musk’s Tesla data system ‘is new, disruptive, and extremely effective’: Former WPP CEO",
        "author": "Yahoo Finance",
        "video_id": "plPA5tYITrE",
        "likes": "114",
        "description": "#ElonMusk #Tesla #CEO\nWPP former CEO Sir Martin Sorrell joins Yahoo Finance Live's Brian Sozzi to discuss earnings for S4 Capital, Twitter under Musk, and the outlook for digital advertising.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Perfect Timing!",
            "The Twitter thing is a ploy from Musk to distract from the  failures coming from Tesla. It's also a distraction from the court case that Tesla stockholders have against Musk. His star is fading quickly and he's trying everything possible to get attention away from that fact.",
            "Twitter is small, but the favorite souce for most journalists all over the world. Besides it was misused by putin to put his puppet in office, which Elon Musk certainly would never alloud. Remember that Elon for several reasons is Putins most important enemy in the west.",
            "Musk is right about one thing to unlock the twitter full potential and he is right because twitter is a worthless stock.",
            "so much speculations about Musk. these guys knows nothing about him."
        ]
    },
    {
        "title": "Marlon Wayans Says Elon Musk Owes Him $30K",
        "author": "BigBoyTV",
        "video_id": "kFwHE42tlag",
        "likes": "295254",
        "description": "Marlon Wayans explains why he wants $30,000 back from Elon Musk after buying a new Tesla. Watch the full interview on BigBoyTV.\n\nFULL INTERVIEW\n► https://youtu.be/7B28SpxdQmU\n\nSUBSCRIBE\n► https://bit.ly/2DNKRdd\n\nSUBSCRIBE TO THE NEW CHANNEL  \n► https://bit.ly/BigBoysNeighborhood\n\nCONNECT - BIG BOY\n► Instagram: https://bit.ly/2G7GT0E\n► Facebook: https://bit.ly/2DPuD2W\n► Twitter: https://bit.ly/1NBKwYw\n\nCONNECT - NEIGHBORHOOD\n► Instagram: https://bit.ly/2G1LYaZ\n► Facebook: https://bit.ly/2DPkCTs\n► Twitter: https://bit.ly/2pxUHvi\n► Listen to Full Shows: https://ihr.fm/3v8QRtw\n► Blog: https://www.radiobigboy.com\n\n#ElonMusk #MarlonWayans",
        "top_5_comments": [
            "He said write me a check when the price goes up 😂😂😂😂😂",
            "Podcast name",
            "What a fool. 😂 He doesn't even understand what is going on. Let me get you  wambulance!!",
            "He doesn't owe you shit because you honestly would not complain if you came up. What a df blaming people over 30k when you are worth millions.",
            "Same thing happened to me, but he upgraded the brakes and the paint prior to delivery. The brakes alone are 20k from Tesla. \n\nGet over it dude. Next time you buy one, it’ll be cheaper."
        ]
    },
    {
        "title": "#Elon and #Tesla are crashing! #twitter #democrat #republican #stocks #bitcoin #crypto #trading #SPY",
        "author": "Heman Pablo",
        "video_id": "M0Uka1xOFGY",
        "likes": "153",
        "description": "",
        "top_5_comments": [
            "Pablo the GOAT",
            "He sold to help balance out  Twitter And to pay off a high interest loan",
            "I took your warning and got out of my position. Thanks Pablo.",
            "Pablo called it once again 🔥 is he from the future 🤔",
            "Pablo... once I'm flush...I'll be buying into your amazing revelations!"
        ]
    },
    {
        "title": "Elon Musk's Reaction To Tesla's Competitors",
        "author": "Simply Tech",
        "video_id": "_Fd-nuIAu0g",
        "likes": "309",
        "description": "Elon Musk is the most recognizable self-made, tech billionaire in the world today. He has been hailed as the real-world Tony Stark! Not only is he at the cutting edge of 21st-century technology. But, as of this video, he is also the richest man in the world, according to Forbes Real-Time Billionaire List. \nElon owns approximately 48% of Space X. A company revolutionizing the commercial space industry and leading the charge in making human beings a multi-planetary species. \nHe also owns 23% of Tesla Motors. A company that probably needs no introduction. In the last decade, Musk and Tesla have come to dominate the Electric Car market. \n\nIn the last year alone, Tesla’s Market Capitalization has grown from US$ 100 Billion in Jan 2020, to US$ 1.12 Trillion as of 30th October 2021! \nThis makes Tesla Motors, the largest automaker in the world in terms of valuation. Surpassing legacy companies like Toyota, Volkswagen, Ford, and BMW combined!\n\nThis made us think, what does Elon Musk have to say about his competitors and the future of the EV market?\n\nStick around as we take a look at some of Tesla’s main competitors and Musk’s opinion about them.",
        "top_5_comments": [
            "LUCID WILL BE THERE MAIN COMPETITOR.",
            "EVs don't compete each other as of now. They sold all their production. The 1st phase is to compete and displace ICE vehicles and the speed depends on EVs ramp up.",
            "📌 I don’t know who but someone needs to hear this,Stock is the oldest online market we have done in the past years, we employ it because of the highest quality of services it renders and how successful it is, today we now say crypto currency too, I’m just saying that people should develop the habit of investing, really helpful in life",
            "Maybe there is missed info that Tesla has a 3M (atleast) of backlog. In the same time competition aims to produce 5 digit numbers of EVs in 2025.",
            "Look… I’m happy everyone went to EV due to Tesla’s movement. \n\nThat being said, Tesla is the fuckin Boss. IMO"
        ]
    },
    {
        "title": "Who predicted #Tesla and #Elon selling #Bitcoin?! #crypto #stocks #trading #investing #money #nasdaq",
        "author": "Heman Pablo",
        "video_id": "zNQx2HTT5zw",
        "likes": "159",
        "description": "",
        "top_5_comments": [
            "They have over 15 billion in cash.WTF you talking about they need cash?🤡",
            "😂 this guy is a scammer  💰 😈",
            "Selling BTC is very healthy for BTC. Would you rather Elon just hoarded all his BTC and just sat on a huge pile of it or would you rather he use it to build one of the most revrred compsnies on the planet? Elon used BTC for it's intended use. it has REAL WORLD VALUE.",
            "Thx buddy",
            "He sold at 29 bro wtf"
        ]
    },
    {
        "title": "Elon Musk Controls The Cryptocurrency Market",
        "author": "TheRichest",
        "video_id": "TIt-nunWwFA",
        "likes": "2356",
        "description": "Elon Musk is the most influential person when it comes to cryptocurrency.\n\n#shorts",
        "top_5_comments": [
            "Oops i did it again elon musk",
            "elon musk is satoshi nakamoto..you CANNOT convince me otherwise",
            "Are you on Instagram.i would like to see more of your content",
            "Soon as that puppet little simp said Doge Coin how can you dummies still not see he's a Rothschild, banker elites' puppet and b!+ch boy?",
            "It's a hustleee baby hahah love that. Buy btc doge eth"
        ]
    },
    {
        "title": "reservation count north of 1.7 million units@Manatek #tesla #financialanalysis #elon",
        "author": "Manatek",
        "video_id": "tbJcuQL3YTs",
        "likes": "8",
        "description": "",
        "top_5_comments": [
            "Congratulation Elon Musk idea of TESLA❤🚘🌏❣️❣️❣️"
        ]
    },
    {
        "title": "Tesla's Founders On Elon Musk And The Early Days",
        "author": "CNBC",
        "video_id": "eblPwXFb7TE",
        "likes": "31249",
        "description": "Elon Musk is the most famous CEO of Tesla, but he's not the company's founder. Martin Eberhard and Marc Tarpenning founded the company in 2003 and were the original executives. CNBC sat down with them to talk about the idea for Tesla Motors, the battery, Elon Musk and building its first car, the all-electric Roadster.\n\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC Classic: https://cnb.cx/SubscribeCNBCclassic\n\nAbout CNBC: From 'Wall Street' to 'Main Street' to award winning original documentaries and Reality TV series, CNBC has you covered. Experience special sneak peeks of your favorite shows, exclusive video and more.\n\nConnect with CNBC News Online\nGet the latest news: https://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\nSubscribe to CNBC PRO: https://cnb.cx/2NLi9AN\n\n#CNBC\n\nTesla Founders On Elon Musk And The Early Days",
        "top_5_comments": [
            "Musk claims he's the founder of Tesla, because that's what con men do. He also wants everyone to believe that he started PayPal, when he didn't. He'll eventually try to claim Twitter was his idea. He's nothing but a slick talking businessman, with no engineering credentials, who can talk people into giving him tons of money, then buying a company and saying he was the founder. He and Trump make the perfect con men pair, so VOTE BLUE to stop these two hucksters from running America!!!",
            "So many of these comments are a riot, and it's a wonder anyone speaking the same language is able to make themselves understood without respecting the proper use of language.\nDid Elon Musk found TESLA? The correct answer is 'No'.\nDid Elon Musk establish TESLA on a more sure financial and engineering footing? Yes.\nSimple.\nNo story, interpretation, figurative understanding, or preferential 'founder status' based on who succeeded better, blah blah blah. Only straight communication.",
            "23:21 -the collateral damege is humans lives....😢 that elons musk accept.",
            "LOTUS GATE KEEPER",
            "When he said idk why he calls himself a founder😂😂😂😂mane that dude has made Tesla what it is"
        ]
    },
    {
        "title": "Elon Musk: Is There Enough Lithium Supply?",
        "author": "Ryan Provan - Stocks & Crypto",
        "video_id": "2oZOKAseP84",
        "likes": "58",
        "description": "Elon Musk: Is There Enough Lithium Supply?\n🔥 FREE BITCOIN https://www.coinspot.com.au/join/REF69BZ2A\n✨ BUY CRYPTO NOW ➡️ https://www.coinspot.com.au/?affiliate=HN6B7\n🐦 TWITTER: https://www.twitter.com/_therealrjp\n⏰ TIKTOK: https://www.tiktok.com/@ryanprovan\n📷 INSTAGRAM: https://www.instagram.com/therealrjp\n✉️ EMAIL: rjpinvests@gmail.com\n#elonmusk #lithium #investing",
        "top_5_comments": [
            "How is the electricity produced at charging stations for electric vehicles ?\nOh yea, fossil fuels, coal and natural gas"
        ]
    },
    {
        "title": "Elon Musk Didn't Actually Found Tesla Motors! #elonmusk #shorts #teslanews",
        "author": "The Tech Head",
        "video_id": "HU_z43NbleY",
        "likes": "4",
        "description": "I hope that this video interested you and thank you for 50 subscribers. This means a lot to me and thank you for supporting my journey as a YouTuber.\n\nPlease share any ideas that you want me to do for an upcoming video that are tech related. \n\nIt is interesting how everyone thinks that Elon founded Tesla when he was actually only an early investor.\n\nElon Musk did a great job at saving Tesla and making it the huge company that it is today. I might be making a video about Tesla's master plan.\n\nHashtags and key words ( dont need to read )\n\nelon musk news   tesla news    tesla stock    tesla model y   Tesla market cap    tesla stock analysis     tesla model 3   tesla model s\n\n#ElonMuskNews #Tesla #ElonMusk\n\n\nhttps://youtube.com/channel/UCVuBK4V8BpGlghrBEYlL3UA",
        "top_5_comments": []
    },
    {
        "title": "Tech It Out | How will Elon Musk defend his $56 bn Tesla pay?",
        "author": "WION",
        "video_id": "BwjMo_0_Pjw",
        "likes": "117",
        "description": "Ankit Tuteja explains why Tesla CEO Elon Musk faces a trial over his $56 billion pay package.\n\n#TechItOut #ElonMusk #Tesla \n\nAbout Channel: \n\nWION The World is One News, examines global issues with in-depth analysis. We provide much more than the news of the day. Our aim to empower people to explore their world. With our Global headquarters in New Delhi, we bring you news on the hour, by the hour. We deliver information that is not biased. We are journalists who are neutral to the core and non-partisan when it comes to the politics of the world. People are tired of biased reportage and we stand for a globalised united world. So for us the World is truly One.\n \nPlease keep discussions on this channel clean and respectful and refrain from using racist or sexist slurs as well as personal insults.\n\nSubscribe to our channel at https://goo.gl/JfY3NI\nCheck out our website: http://www.wionews.com\nConnect with us on our social media handles:\nFacebook: https://www.facebook.com/WIONews\nTwitter: https://twitter.com/WIONews\n\nFollow us on Google News for latest updates\n\nZee News:- https://bit.ly/2Ac5G60\nZee Bussiness:- https://bit.ly/36vI2xa\nDNA India:- https://bit.ly/2ZDuLRY\nWION: https://bit.ly/3gnDb5J\nZee News Apps : https://bit.ly/ZeeNewsApps",
        "top_5_comments": [
            "God does not want man to spend excessive amounts of money on outer space.  Virgin Mary appeared in Bayside, New York and said we have enough problems on earth to deal with.  These Last Days Ministries org.    Aka. Our Lady of the Roses, Mary Help of Mothers",
            "Are they just going to ignore how much he helped Ukraine?",
            "Let me put it this way , will Tesla or spacex or nueralink or boring company or solarcity or twitter exist without him ?",
            "🌏🌏🌏🌏🌏free tibet"
        ]
    },
    {
        "title": "Elon Musk's Favorite Interview Question 🤯",
        "author": "Savanteum",
        "video_id": "GD9FVjTt4UA",
        "likes": "148872",
        "description": "Elon Musk's favourite interview question is designed to detect the truth...\n\nThanks to Diva Plavalaguna, Tima Miroshnichenko, MART PRODUCTION and Edmond Dantès from Pexels ! 🙏\n\nHi, my name is Stuie and I made Savanteum to inspire the next generation of creators and innovators.\n\nYou can support the channel and my mission by subscribing → https://www.youtube.com/savanteum?sub_confirmation=1 🙏\n\n_____________________________________________________________\n▼ SUPPORT THE CHANNEL ▼\n\n👉 My Music: (30 Day Free Trial on Epidemic Sound)\nhttps://share.epidemicsound.com/j6uiog\n\n👉 My Editing Gear: \nMicrophone: https://amzn.to/3rgJPVo (amazon) \nMonitor: https://amzn.to/3O67DnT (amazon) \nComputer: https://amzn.to/44AqhK6 (amazon) \nHeadphones: https://amzn.to/43jn9Bf (amazon) \nWireless Mouse: https://amzn.to/3JR98nc (amazon)\n\n👉 TubeBuddy: (Free to install, for YT Analytics)\nhttps://www.tubebuddy.com/savanteum\n\nThanks for watching, happy creating and innovating! 🔥 #shorts #elonmusk #creatornow #musk #twitter",
        "top_5_comments": [
            "Ok then... tell me some of the most difficult problems you worked on and how you solved them? :)",
            "Dang where was Elon all my life?😂",
            "Even when ,I  don't know a subject , I can understand BS easily. Especially at the Doctor's office , Hospital , Car repair shop etc. 🙏🏼🙏🏼",
            "Bro didn't solve problem, bro create a new one and ordered people to called it \"X\", if you know what I mean",
            "هتش#\n  Slout😢"
        ]
    },
    {
        "title": "Elon Musk sells more shares in electric car maker Tesla | ABC News",
        "author": "ABC News (Australia)",
        "video_id": "OKhYcB-9x28",
        "likes": "234",
        "description": "The Tesla chief executive sold $A6 billion worth of shares to fund his nearly $70 billion purchase of social media firm Twitter.  Subscribe: http://ab.co/1svxLVE  \n\nABC News provides around the clock coverage of news events as they break in Australia and abroad, including the latest coronavirus pandemic updates. It's news when you want it, from Australia's most trusted news organisation.\n\nFor more from ABC News, click here: https://ab.co/2kxYCZY\nWatch more ABC News content ad-free on ABC iview: https://ab.co/2OB7Mk1\n\nGo deeper on our ABC News In-depth channel: https://ab.co/2lNeBn2\nLike ABC News on Facebook: http://facebook.com/abcnews.au\nFollow ABC News on Instagram: http://instagram.com/abcnews_au\nFollow ABC News on Twitter: http://twitter.com/abcnews\n\nNote: In most cases, our captions are auto-generated.\n\n#ABCNews #ABCNewsAustralia #shorts",
        "top_5_comments": []
    },
    {
        "title": "Elon Musk may branch off into the mobile phone industry if app stores ban Twitter #shorts",
        "author": "Fox Business",
        "video_id": "q9z0nJdX-ak",
        "likes": "1834",
        "description": "Twitter’s Elon Musk may get into the cellular industry if Big Tech giants remove Twitter from their app store platforms.\n\nSubscribe to Fox Business! https://bit.ly/2D9Cdse\nWatch more Fox Business Video: https://video.foxbusiness.com\nWatch Fox Business Network Live: http://www.foxnewsgo.com/\n\nFOX Business Network (FBN) is a financial news channel delivering real-time information across all platforms that impact both Main Street and Wall Street. Headquartered in New York — the business capital of the world — FBN launched in October 2007 and is one of the leading business networks on television, having topped CNBC in Business Day viewers for the second consecutive year in 2018. The network is available in nearly 80 million homes in all markets across the United States. Owned by FOX Corporation, FBN is a unit of FOX News Media and has bureaus in Chicago, Los Angeles, and Washington, D.C.\n\nFollow Fox Business on Facebook: https://www.facebook.com/FoxBusiness\nFollow Fox Business on Twitter: https://twitter.com/foxbusiness\nFollow Fox Business on Instagram: https://www.instagram.com/foxbusiness/",
        "top_5_comments": [
            "I really don't know anything about Apple but I can tell you this Google really sucks",
            "Nice",
            "They been talking about this for a year and nothing yet.  Seems like it’s never gonna happen",
            "Fox news savior is the only man on earth to loose 200 billion dollars.. reason is he appealed to the left wing and moved to the right wing.. so the left wing who allowed elon musk to exist just took back their help and bankrupt him almost over night.. people can just decide what elon is worth.. you don't got the right assets.. and are running out faster then ever..",
            "will be like Amazon fire phone that only runs own BS apps"
        ]
    },
    {
        "title": "Elon Musk: @tesla's 'not immune' to global economy 🌎💵 #shorts",
        "author": "Yahoo Finance",
        "video_id": "2MChYLq8jdk",
        "likes": "452",
        "description": "Tesla CEO Elon Musk revealed in a shareholder meeting on Tuesday that it's going to be a 'difficult 12 months' for the EV maker as Tesla is not immune to the global economy.\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#yahoofinance #finance #news #youtubeshorts #youtube #shorts #shortsvideo #elonmusk #tesla #electricvehicle #evs #ev #car",
        "top_5_comments": [
            "Elon look we are looking at a grid outage more so instead of nuclear explosions or emp ,look I know about tesla free enegery we need to use it !!! Really Elon I read alot to I read about tesla life and his history every thing that I could get my hands on way before I ever started seeing you around in Hollywood, and I am honestly I am glad you got out of that set up, look please contact me ,\nThank you\nFelicia 😊 \nP.s we could all afford tesla cars",
            "Thank you for telling the truth. 🇦🇺",
            "$Pepe",
            "$pepe",
            "$Pepe"
        ]
    }
]