[
    {
        "title": "What Twitter Could Look Like Under Elon Musk",
        "author": "NBC News",
        "video_id": "7muEU21rdNE",
        "likes": "74",
        "description": "Elon Musk has sent Twitter a proposal to buy the social media giant at the original $44 billion price if Twitter drops its lawsuit against the billionaire, which is due to head to trial in a few weeks. New York Times Dealbook reporter Lauren Hirsch joins News NOW to explain what led to the deal being put back on the table and what the future of twitter could look like under Musk’s control. \n\n» Subscribe to NBC News: http://nbcnews.to/SubscribeToNBC\n» Watch more NBC video: http://bit.ly/MoreNBCNews\n\nNBC News Digital is a collection of innovative and powerful news brands that deliver compelling, diverse and engaging news stories. NBC News Digital features NBCNews.com, MSNBC.com, TODAY.com, Nightly News, Meet the Press, Dateline, and the existing apps and digital extensions of these respective properties.  We deliver the best in breaking news, live video coverage, original journalism and segments from your favorite NBC News Shows.\n\nConnect with NBC News Online!\nNBC News App: https://smart.link/5d0cd9df61b80\nBreaking News Alerts: https://link.nbcnews.com/join/5cj/breaking-news-signup?cid=sm_npd_nn_yt_bn-clip_190621\nVisit NBCNews.Com: http://nbcnews.to/ReadNBC\nFind NBC News on Facebook: http://nbcnews.to/LikeNBC\nFollow NBC News on Twitter: http://nbcnews.to/FollowNBC\n\n#Twitter #ElonMusk #Musk",
        "top_5_comments": [
            "twitter and elon need to learn history",
            "Not a liberal dumpster fire of hate, racism and division?",
            "Actually free speech no shadowbans",
            "LOLLLLLL",
            "Can't wait for Trumps return. He was banned for no reason."
        ]
    },
    {
        "title": "Mark Zuckerberg reacts to Elon Musk possibly buying Twitter #shorts",
        "author": "The Verge",
        "video_id": "Zwp8AQN4Qa4",
        "likes": "58830",
        "description": "Mark Zuckerberg on Elon Musk possibly buying Twitter: “I think it's interesting as a saga… but I think even at this point, it's not actually clear what's going to happen.”  \n\nSubscribe: http://goo.gl/G5RXGs\nLike The Verge on Facebook: https://goo.gl/2P1aGc\nFollow on Twitter: https://goo.gl/XTWX61\nFollow on Instagram: https://goo.gl/7ZeLvX\n\nThe Vergecast Podcast: https://pod.link/430333725\nDecoder with Nilay Patel: http://apple.co/3v29nDc \nMore about our podcasts: https://www.theverge.com/podcasts\n\nRead More: http://www.theverge.com\nCommunity guidelines: http://bit.ly/2D0hlAv\nWallpapers from The Verge: https://bit.ly/2xQXYJr",
        "top_5_comments": [
            "Watch the full interview here: https://youtu.be/gV50hpSKHFQ",
            "At this point in 2024 I think you are very clear for sure",
            "That man is a lizard i swear.",
            "Twitter is a swamp and Elon is a troll.  Him and Trump just make things worse.",
            "He was thinking \" I hope he doesn't expose how the Biden administration was asking us to censor info to help them \""
        ]
    },
    {
        "title": "Twitter investors sue Elon Musk for market manipulation",
        "author": "Yahoo Finance",
        "video_id": "RfnTl-wfu-M",
        "likes": "78",
        "description": "#Twitter #Telsa #ElonMusk #YahooFinance\nYahoo Finance's Dan Howley, Julie Hyman and Jared Blikre discuss \nTesla CEO Elon Musk is being sued by Twitter shareholders for his actions over the course of his acquisition process of the social media platform. \nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "🤔🤔🤔🤔🤔🤔🤔🤔🤔🤔 SEE HOW I SEE HOW CORRUPTION I CREATED WITH LIES IN AMERICA HHMMMMM...EXACTLY...PURE CORRUPTION AND LIES....NO HONESTY, BUT THEY NEED OTHER PEOPLE TO BE HONEST...REALLY AND TH MILLIONAIRES IS NOT HONEST???????🤔🤔🤔🤔",
            "🤔🤔🤔🤔 I EXACTLY SEE WHERE THE CORRUPTION/ LIES / DECEITFULNESS/CRIMINAL  WORK CREATED FROM THE TOP  MEN AND WOMEN  MILLIONAIRES ....I READ BETWEEN THE LINES A LOT OF THESE CORRUPT INVESTORS 🤔🤔🤔.. I OBERVE A LOT SINCE 2008 ..",
            "NOW TWITTER COMPANY OWNERS WILL STOP BEING GREEDY 🤔🤔🤔 . BECAUSE OF SELLING GREEDY  CORRUPT/  DECEITFUL  ELON MUSK FOR MORE MONEY 🤔🤔🤔 HMMM LOOK HOW ELON MUSK THE MUCK IS FRIGGING UP TWITTER COMPANY TODAY IN 2022🤔🤔🤔....THAT WAS THERE BEFORE THIS GREEDY OLD FART ELON MUSK THE MUCK...",
            "I have no idea what case they'd have.   Elon Musk grossly overpaid for Twitter, and former Twitter shareholders should be thrilled they were able to dump their shares at higher prices than they would have achieved in the market.",
            "Really so I can sue previous owner and employees for screwing withy privacy??"
        ]
    },
    {
        "title": "Elon Musk to address Twitter employees for first time",
        "author": "Yahoo Finance",
        "video_id": "2sc_suDvmOU",
        "likes": "75",
        "description": "#Twitter #ElonMusk #TwitterElon #yahoofinance \nYahoo Finance anchors Julie Hyman, Brian Sozzi and Brad Smith discuss Twitter stock and Elon Musk's plans to address the company for the 1st time since his $44 billion acquisition bid and before deal is finalized.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Here comes the firings of the ideologically woke idiots! \nGet your popcorn!",
            "The truth doesn’t fear debate in an open forum.  Lies require protection; censorship provides that protection.",
            "Wait is the deal done, has he bought it fully?",
            "If I was Elon I would hand out pink slips to all of them. But pretty soon the stock will plummet down to 20 a share of they are lucky. Twitter is aballon ready to burst.",
            "Greatest African American of all time. Will single handedly change motor industry, space flight, internet 4 all & while standing up for freedom of speech."
        ]
    },
    {
        "title": "Tesla's market cap down $250 billion since Elon Musk took over Twitter",
        "author": "Yahoo Finance",
        "video_id": "jberL4LcvpE",
        "likes": "37",
        "description": "#shorts #tesla #elonmusk #twitter\n\nYahoo Finance's Brian Sozzi breaks down the stat of the day showing how Elon Musk's Twitter venture has shaken Tesla investors.\n\n\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "I hate this bird site so much, i just wish it would shut down or become as dead as Tumblr.",
            "Give Elon Musk a break guys..... wait a few month....give him time to fix twitter...,, me i would load up on twitter stock if i had the money... Elon has never under delivered...dont bet against a guy with a record like that....ignore the political hit pieces that want to destroy everything that he did for political reasons....focus on his record and what he has done in reality....not his trolling on twitter....let him be a human being and have some fun on twitter...get your headfs out of your a.s.s.e.s....and smile when someone is joking....its not serious or the end of the world.....I am glad we have Mr Musk nice to see that one person can change the world....almost have given up on that though before Musk..... all power to him.",
            "He should have stayed out of political scene all together...now he is proving he has a right wing agenda.....he didn't need to do that it's a mistake that will alienate fans of his products but not his politics....",
            "Tesla (and all the American fraud corps) are heading to their intrinsic value, 15 or 20.",
            "And the main breakaway point...   the fanboy simps deserve it buying into a delusion and known fraud, ding ding ding ding ding"
        ]
    },
    {
        "title": "How Elon Musk’s Twitter takeover impacted Tesla stock",
        "author": "Yahoo Finance",
        "video_id": "nasV4tJ1sdA",
        "likes": "46",
        "description": "#ElonMusk #Twitter #Tesla #yahoofinance \nThis segment originally aired on January 13, 2023.\nYahoo Finance's Dan Howley explains the timeline of Elon Musk's Twitter takeover and how it has affected Tesla's stock price.\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Elon wins again....stop CRYIN' and start BUYIN'",
            "🐦🙄 \"company that change rules of energy, bird symbol should complete that task....\"\n😁🤣",
            "Well done! I have been watching your channel for a while. The stock market rally picked up steam in the past week, with strong gains, clearing key levels. The S&P 500 briefly faced resistance at the 200-day line, but moved above that key level on Friday. A large number of leading stocks flashed buy points. The best investment anyone can start today is to invest in the crypto market and trade because that's what gives me higher returns on investment. Thanks to Mr. Thomas Fuller for his enlightenment about crypto investment and how to trade which as a result I have been trading and earning steadily under his mentorship coupled with his accurate trade signal that has resulted in me making over 12 BTC with just as small as 3 BTC in a few weeks of trading.",
            "Yeah, yeah.... Democrats are flexing their muscle as the hurt Elon Musk financially as punishment for him opening up truths about how Twitter helped hid stories for Democrats like Hunter Biden",
            "I have been following Tesla for 5 years now.  top reason is production is ramping in the states and Germany.\r\n In 2019 Modal y was roughly 10 to 15 k  cheaper in 2020 \r\nin 2020 Tesla had like 3 price increase  because of demand and inflation.\r\nProduction is now more then triple  then 2019. \r\nElon twitter factor is just noise\r\nincreased interest rates large factor also\r\n government rebates that actually forced Tesla to drop prices to qualify \r\nTesla margins are huge in the states and will continue to increase once factory's ramp up and inflation comes down"
        ]
    },
    {
        "title": "Twitter shares under pressure as Elon musk makes new push for spam account information",
        "author": "CNBC Television",
        "video_id": "_xDFX4u8yRg",
        "likes": "107",
        "description": "Gene Munster, Loup Ventures managing partner, joins \"Fast Money\" to discuss the chances that Elon Musk follows through on his plan to buy Twitter. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "Twitter is worth way less than 1 B take it or leave it. They are worth nothing with their scam and liars. Elon should not pay more than 1B. The CEO is an Indian !!! any questions?? Without Trump, no one knows Twitter.",
            "Its Facebook not Twitter, that runs on bots. And Russian trolls pretending to be patriots.",
            "I might be one of just a handful of people that doesn't think Musk is actually worth investing in. What I find interesting is that he never founded Tesla. He was initially a small shareholder that then increased his holding over time. Same goes for most of his other holdings. Generally, his quotes, if you research them, rarely hold any credibility. \n\nThere are only ever 2 car companies in history that haven't gone bankrupt. Ford, one of the oldest cars of all time. The other is Tesla, a very new company that has been on the verge of bankruptcy ever since it was established.\n\nHe's not an alien, he's a showman",
            "Why would 20% bots be difficult to prove? They surrendered all the data to him. The bot issue is everything, the number of followers an influencer has as well as their preferences is literally how twitter generates revenue for people. This guy is kind of an idiot",
            "But elon is right...how can u know ad money if its all bots??"
        ]
    },
    {
        "title": "Why Elon Musk ACTUALLY bought Twitter.",
        "author": "Mrwhosetheboss",
        "video_id": "cnNMo4u0L4M",
        "likes": "125482",
        "description": "Twitter and Elon Musk Explained! If you have any more questions then drop them in the comments!\n\nI spend a LOT of time trying to make my videos as concise, polished and useful as possible for you - if you would like to support me on that mission then consider subscribing to the channel - you'd make my day 😁\n\nTwitter - For my tech hot takes: https://goo.gl/EFhwqL\nInstagram - For my personal posts: https://goo.gl/OUqBBa\nFacebook - Does anyone still use this anymore?: https://goo.gl/Aluzl1\n\nAmazon Affiliate links (if you buy anything through these it will support the channel and allow us to buy better gear!):\nAmazon US: https://goo.gl/3yS2aP\nAmazon UK: https://goo.gl/gvrsGZ\n\nMy Filming Gear:\nhttps://bit.ly/35CuxwI\n\nMusic is from Epidemic sound:\nhttp://share.epidemicsound.com/pHDFT",
        "top_5_comments": [
            "What do YOU think to Elon?  Is he a Genius? Or has he bitten off more than he can chew?\nTo see what you didn't know about Tesla: https://youtu.be/R3zfXc8nVQk",
            "Tbh, I don't think Elon cares that people don't like what he's doing, and thats because twitter will no longer be twitter. I think he's buying it to start off somewhere, and then completely reform the platform to what he needs. I don't think he's stupid. I think he's pretty smart. So I think he's doing this on purpose. But we'll have to see.",
            "That’s what happens when you’re rich, don’t be surprised, man. Hopefully you just stay on the bright side.",
            "You're giving him way too much credit and merit, he's an average evil billionaire",
            "x"
        ]
    },
    {
        "title": "Breaking News: Elon Musk Buys Twitter for $44 Billion",
        "author": "Bloomberg Television",
        "video_id": "qejH3zfafMc",
        "likes": "299",
        "description": "Billionaire entrepreneur Elon Musk agreed to buy Twitter for $44 billion and take it private. Musk will pay $54.20 per share. Tesla's founder recently took a significant stake in the company. Bloomberg's Ed Ludlow reports on \"Bloomberg Markets.\"",
        "top_5_comments": [
            "Twitter was not free forbidden to communicate could not cross the border",
            "I'll sign up now.Didn't trust it before.Bots already gone.\nThank you, Elon!",
            "I would like to talk with you please, it is life or death important. Humanity don’t understand this argument that an innocent kid would like to understand because is wise, otherwise something would have been done about the squandering of fortunes and the war.\nWhat can be done with the gold in reserves like in the Fort Knox in America? Only to sell it. How much cost taxpayers to protect the gold? Fortunes. To sell the gold today spares to pay for the protection tomorrow. The gold market is going to crash and i defend my word against any economist past or present. Russia could go bankrupt and end the war in Ukraine.  I think we live in an horrible world, and I was said it is the only one we have. I have to keep trying. I am not given a voice in any news media in the world. Being everything else the same a country without gold is wealthier, live better thanks to their understanding of money, that is transferable debt, a number that indicates value and a name, the issuer of the promise to give value for value at the same market value or price and different utility for buyer and seller, otherwise the exchange would not take place, benefiting both equally, increasing equally their wealth, than a country with gold that protect a yellow, bright, durable, divisible, mouldable, electric conductor, not particularly beautiful, and rare mineral useless inside a vault, because in the country with no gold don’t have to work to pay the extreme cost of mining, transportation, minting, storage, protection. Gold is not money and exchanging gold for goods and services is barter. Gold mining would end when the price collapse as all the gold reserves in the world are sold, being the last the foolest, and companies would not be profitable saving the environment from destruction.\nIs not absurd to have to dig out gold to exchange goods and services? Money can be created to buy to sell costless without authorisation because is a sellable contract to give value for value, fulfilled with honour and accepted voluntarily if the issuer is trustworthy, and can be stored in the mind. “I promise i would give the bearer the price in value without cheating, lying, hiding, stealing aiming at giving satisfaction, wellbeing, wealth, happiness.”\nKind regards,\nMiguel.",
            "I really hope he shuts it down.",
            "Every financial goals requires patience, dedication and consistent spirit knowing that investment, knowing that investment is currently the most lucrative business in the world. All modern investment are really changing life’s"
        ]
    },
    {
        "title": "Twitter stock soars on news of Elon Musk stake",
        "author": "Yahoo Finance",
        "video_id": "5H3S9RysgVM",
        "likes": "55",
        "description": "#Twitter #ElonMusk #TwitterElonMusk\nTwitter shares are up following news that Tesla CEO Elon Musk took a 9% stake in the company. Yahoo Finance reporter Alexis Keenan breaks down the details.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Hmm, use Twitter and StarLink infrastructure as Tesla's communication medium for servicing their EVs and contact customers around the world...",
            "While bitcoin's wild <price movements might seem random, they are often driven by the same fundamental catalysts as in the traditional markets. Some claim bitcoin is impervious to shocks that affect global finance; it's a hedge against things like inflation and a sure bet against tides of uncertainty. Moves within traditional finance can boost or burn bitcoin's price because they determine how easy it is for financial epicenters like Wall Street to invest in bitcoin...Keeping all this in mind, it is important to trade with the right strategy when going into the crypto world. Madison Callaway has been doing a great job reviewing all chart, trade and techniques on <BTC which has enhance the growth of my port folio to 11BTC lately.......",
            "Great news. Clean out staff. Maybe they can find jobs over at Parler.",
            "Yahoo, you are irrelevant. I just clicked on your video to tell you that. You are a slave to big Pharma just like NBC and the rest of them.",
            "Yeah,  the stock \"surged\" at 6am EST an hour before the retail trader could buy anything and over 3 hrs before the market day session opened. Market is so rigged."
        ]
    },
    {
        "title": "Brazil Supreme Court ends nationwide shutdown of Elon Musk's X • FRANCE 24 English",
        "author": "FRANCE 24 English",
        "video_id": "kCB6xgBlhWg",
        "likes": "21",
        "description": "France 24 correspondent Tim Vickery explains the Brazilian Supreme Court's decision to end the South American country's month-long shutdown of social media platform X on Tuesday, ending an ongoing row over the company's proliferation of disinformation, notably on Brazil's 2022 presidential election.\n\n\n🔔 Subscribe to France 24 now: https://f24.my/YTen\n🔴 LIVE - Watch FRANCE 24 English 24/7 here: https://f24.my/YTliveEN\n\n🌍 Read the latest International News and Top Stories: https://www.france24.com/en/\n\nLike us on Facebook: https://f24.my/FBen\nFollow us on X (Twitter): https://f24.my/Xen\nBrowse the news in pictures on Instagram: https://f24.my/IGen\nDiscover our TikTok videos: https://f24.my/TKen\nGet the latest top stories on Telegram: https://f24.my/TGen",
        "top_5_comments": [
            "We were better off as hunter and gatherers.  Long live Syd Barret !!!",
            "Lol elon is just following the laws of the country he is operating in he has said multiple times its  what the ppl determine the law to be tgat he follows not pandering to the whims of the few and woke",
            "Musk got off easy, given that he stiffarmed a government.",
            "Elon Musk is a national security risk... IN EVERY COUNTRY. \nExcept Russia.",
            "Now the whole world is looking at Elon laughing. What a joke! If only he would follow the law from the beginning."
        ]
    },
    {
        "title": "Elon Musk revives deal to buy Twitter #Shorts",
        "author": "CNBC Television",
        "video_id": "iStwvUBtC7g",
        "likes": "235",
        "description": "Elon Musk has reversed course and is again proposing to buy Twitter for $54.20 a share, according to a regulatory filing on Tuesday. Twitter shares closed up more than 22% on the news.",
        "top_5_comments": [
            "Big win for freedom",
            "8 off top 💪",
            "GOAT!!! Can’t wait to practice the first amendment on a social media platform. It’s been so long without open dialogue.",
            "Good day in america baby!",
            "If Elon musk buys fornite I am gonna scream and if I see him I am gonna call him stupid musk"
        ]
    },
    {
        "title": "Tesla Earnings: Is Elon Musk too focused on Twitter?",
        "author": "Yahoo Finance",
        "video_id": "FhxtuR0v0qs",
        "likes": "50",
        "description": "#youtubeshorts #yahoofinance #elonmusk #tesla #twitter \n\nYahoo Finance’s Brian Sozzi talks about Tesla earnings and how Elon Musk’s Twitter acquisition is affecting the Tesla brand. This segment from ‘After the Call’ originally aired on January 25, 2023.\n\n\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "well he is very good at creating this false narrative around him. is he a genius no. so legit geniuses work for him yes.",
            "Let Elon do his thing. Once you do what he did then you can speak.",
            "Yahoo needs to get rid of Brian already. Yahoo finance is the last chance this company has at staying afloat and it’s actually a decent platform but it seems to be heading downhill as of late.",
            "Translation: We (the media) tried to paint a narrative of failure around Elon and we failed.",
            "It’s the same how everyone had Tom from MySpace as a friend."
        ]
    },
    {
        "title": "Elon Musk sells $4 billion in Tesla shares to finance Twitter takeover",
        "author": "CNBC Television",
        "video_id": "RJCFXEaTArc",
        "likes": "246",
        "description": "CNBC's Robert Frank joins 'Squawk Box' to break down how Tesla CEO Elon Musk is financing his takeover of social media giant Twitter. Watch 2022 Berkshire Hathaway Annual Shareholders Meeting with Warren Buffett and Charlie Munger on Saturday, April 30 at 9:45 a.m. ET https://www.cnbc.com/brklive22/\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "This is what happens when you make false promises to your customers (over priced EV cars, people waiting years for their car, over priced internet service and you team up with a loser like Trump and Amber Heard), very quickly people realize you don't have professional integrity, or maybe you did have, but you've lost touch with reality.",
            "One question, please! Is NVIDIA a safe buy to outperform the market this year? I'm tired of these new buys every week, just to make up some assets with a low percentage on my $236k portfolio and try to keep everything around 10%.",
            "Follow promota malala ug",
            "His money to waste. He could start his own free speech platform free of bots with more participants than the twits.",
            "The financial markets seem to be suffering more than the real economy from the prospect of further Fed tightening, I seriously need suggestions on how to diversify my $500k portfolio made up of volatile TSLA."
        ]
    },
    {
        "title": "Elon Musk tells Tesla employees that remote work is no longer acceptable",
        "author": "Yahoo Finance",
        "video_id": "AiRfGDWrBDI",
        "likes": "18017",
        "description": "#shorts #ElonMusk #Tesla #ElonMuskreturntowork\nYahoo Finance Senior Reporter Pras Subramanian talks about Elon Musk’s request that Tesla workers physically return to the office for minimum 40 hours per week.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "That's normal 40 hours he's the boss",
            "Oil field workers looking at this laughing at 85-105 hours a week 😂",
            "God forbid the boss tells his people where and when to work",
            "A lot of workers today are soft. 40 hrs is a lot.   To ask.",
            "People normally do better work AT work"
        ]
    },
    {
        "title": "WION Fineprint | Explained: The future of Twitter under Elon Musk",
        "author": "WION",
        "video_id": "KkZEQ3votGg",
        "likes": "86",
        "description": "#WIONFineprint | Elon Musk has completed his acquisition of Twitter. He started his reign with a round of firings. What's next for the social media platform?\n\nPriyanka Sharma brings you the details\n\n#ElonMusk #Twitter\n\nAbout Channel: \n\nWION The World is One News, examines global issues with in-depth analysis. We provide much more than the news of the day. Our aim to empower people to explore their world. With our Global headquarters in New Delhi, we bring you news on the hour, by the hour. We deliver information that is not biased. We are journalists who are neutral to the core and non-partisan when it comes to the politics of the world. People are tired of biased reportage and we stand for a globalised united world. So for us the World is truly One.\n \nPlease keep discussions on this channel clean and respectful and refrain from using racist or sexist slurs as well as personal insults.\n\nSubscribe to our channel at https://goo.gl/JfY3NI\nCheck out our website: http://www.wionews.com\nConnect with us on our social media handles:\nFacebook: https://www.facebook.com/WIONews\nTwitter: https://twitter.com/WIONews\n\nFollow us on Google News for latest updates\n\nZee News:- https://bit.ly/2Ac5G60\nZee Bussiness:- https://bit.ly/36vI2xa\nDNA India:- https://bit.ly/2ZDuLRY\nWION: https://bit.ly/3gnDb5J\nZee News Apps : https://bit.ly/ZeeNewsApps",
        "top_5_comments": [
            "Boycott Twitter future dictator of Mars will use it to allow Trump aka agent orange to spread big lie again . next Alex Jones will get a spot .",
            "Twitter is such a toxic and aggressive place, other than mostly white and angry American college girls, who still uses that site?? o_O",
            "Turn that bird red and grab some popcorn!!",
            "if america is all about freedom of speech , then why are they all afraid of Trump ...scared of the truth LOL ?",
            "Will he change the blue bird to red bird!? Or half red and half blue!???"
        ]
    },
    {
        "title": "Elon Musk Buying Twitter",
        "author": "CBS Miami",
        "video_id": "M2hKIlI_YB4",
        "likes": "56",
        "description": "Twitter said Monday it has agreed to sell itself to Elon Musk in a roughly $44 billion deal.",
        "top_5_comments": [
            "Elon Musk seems interested everything started from \"T\" lol",
            "Now that's a man with some balls, screw the sheiks.",
            "I’ve never had twitter. I will now!",
            "Buy Your Hip Waders, the Liberal Tears are going to be deep.... 😉😁👍",
            "will you go to heaven? Have you ever lied, stolen used God's name as a curse word (O-M-G)? According to God's law, you're guilty,ignorance will not be an excuse... But wait, God loves you, he made a way out. God so loved the world that he gave his only son that whoever believes in him will not die but have everlasting life. John 3:16 Please think about your eternal life, believe and repent, even after rapture you can be saved. Love Y'all"
        ]
    },
    {
        "title": "Elon Musk gets sued by Twitter investors",
        "author": "Fox Business",
        "video_id": "3YZesKEHJdY",
        "likes": "4350",
        "description": "FOX Business’ Lydia Hu reports on Elon Musk getting sued by Twitter investors for delayed disclosure of stake.\n\nSubscribe to Fox Business! https://bit.ly/2D9Cdse\nWatch more Fox Business Video: https://video.foxbusiness.com\nWatch Fox Business Network Live: http://www.foxnewsgo.com/\n\nFOX Business Network (FBN) is a financial news channel delivering real-time information across all platforms that impact both Main Street and Wall Street. Headquartered in New York — the business capital of the world — FBN launched in October 2007 and is one of the leading business networks on television, having topped CNBC in Business Day viewers for the second consecutive year in 2018. The network is available in nearly 80 million homes in all markets across the United States. Owned by FOX Corporation, FBN is a unit of FOX News Media and has bureaus in Chicago, Los Angeles, and Washington, D.C.\n\nFollow Fox Business on Facebook: https://www.facebook.com/FoxBusiness\nFollow Fox Business on Twitter: https://twitter.com/foxbusiness\nFollow Fox Business on Instagram: https://www.instagram.com/foxbusiness",
        "top_5_comments": [
            "Just look at allllll the COPE!!!!!\n🖕🤣🖕\nALL REPUBLICANS ARE PATHETIC COCKSUCKERS!!!!!",
            "Bla Bla Bla … shut down twitter in CA",
            "These ppl are stupid. No means No. That's like suing for not getting consent to f someone over... literally smh\nWe talked about it but it's a no for me, you finna take this 🤣🤣 ok ok I'm done....\nElon you flirt 😚",
            "Elon musk and his daddy are pervert vampires so is Matt gaytz y'all",
            "Rich people problems.."
        ]
    },
    {
        "title": "Bill Gates-Elon Musk feud continues; Gates slams Musk’s space investment",
        "author": "Yahoo Finance",
        "video_id": "ysTgn6MiI4Y",
        "likes": "1603",
        "description": "Yahoo Finance anchor Brian Sozzi discusses philanthropist Bill Gates’ fight against mass investment in space travel on February 6, 2023.\n\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#yahoofinance #shorts #billgates #elonmusk",
        "top_5_comments": [
            "Why did Melinda divorce Bill?",
            "Bill Gates and Elon Musk are both changing the world for the better. If Elon Musk uses outer space for mining it would help reduce climate change, and reduce pollution here on earth. It is a difference in age, where Bill Gates sees himself when he was Elon’s age, and he is trying to help Elon. When you are young, a person feels invincible and it will take time for Bill’s message to connect with Elon🙂🙂✝️",
            "Bill Gates, what a liberal idealist.",
            "😂 Elon needs to do more! 😂 ah that’s funny",
            "the largest ev market in the wrld. solar to power homes.  sustainable batteries for our nation against china. the list goes on. what more do u want the man to give. buy up all the beef and water to take away from poor families? is that your view of giving?"
        ]
    },
    {
        "title": "Working for Elon Musk: Ex-Employees Reveal His Management Strategy | WSJ",
        "author": "The Wall Street Journal",
        "video_id": "JEikQP8-es0",
        "likes": "28548",
        "description": "“He has never said this, but I’ve watched it. You have 30 seconds to make your point.”\n\nWhat Elon Musk has been doing at Twitter since he took over the company isn’t new – he’s used the same management strategies when he took over Tesla and when he founded SpaceX.\n\nThe Wall Street Journal spoke with three former employees to better understand Musk’s management playbook. \n\nIllustration: Ryan Trefes\n\n0:00 Elon Musk is known to be intense among employees\n0:48 Elon Musk’s history of rallying staff behind a compelling mission\n2:19 How Elon Musk uses his idea of ‘hardcore’\n4:56 Musk’s ‘special forces’ hiring mentality\n5:56 Musk ups financial stakes to motivate workers\n\n#ElonMusk #Twitter #WSJ",
        "top_5_comments": [
            "You want a good wage, a good job? Rich men start early in the day. Roll with it!",
            "if I would be a CEO, I would probably be 'even worse'.  I just hate lazy people, just like Musk.  Don't want to work?  then go work for the state or something.  go vote demonrat.",
            "more lies lol disgrunted workers lol",
            "Thanks for providing such a balanced view of the market.",
            "I learned so much about smart contracts from this video."
        ]
    },
    {
        "title": "Elon Musk's Twitter takeover top trending topic in China",
        "author": "CNBC Television",
        "video_id": "qp-53HRgbAU",
        "likes": "123",
        "description": "CNBC's Eunice Yoon joins 'Squawk Box' to report on China's reaction to Elon Musk's takeover of Twitter. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "Hi",
            "It would be nice if we got more people billionaires that would be able To do things for freedom and rights of the American people on the constitution and not just think of themselves but not too many people are willing to do that and sacrifice for the American people the agenda Sony for themselves look at the Democrat party",
            "DEMOCRACIES CANNOT START GIVING ORDERS TO WHAT AN PLATFORM OF OPINIONS SHOULD BE, EVEN MUSK, FREE SPEECH IS FOR EVERYBODY, NOT JUST FOR THE ONES U AGREE, U HAVE TO DESTROY FAKE NEWS OR DIFERENT OPINIONS WITH PROVES ,FACTS AND OTHER POINT OF VIEW, I AGREE WITH MUSK WHEN HE DONT AGREE WITH TRUMP EXPEL FROM TWEETER TOO, EVEN I DONT LIKE TRUMP AND I THINK HE IS A FAKE NEWS MADE OPINION BUT U HAVE TO PROVE HIS LIES IF NOT PEOPLE THINK HE IS RIGHT AND THEORIES START EVERYWHERE..DEMOCRACY CANNOT BE JUST FOR OUR INTERESSES..",
            "Poor Ligma Johnson :)",
            "The guys and the girls comes here in our country and blocks the free speech in our country, which in in our constitution . These corrupt Indians must be ousted from every top positions ."
        ]
    },
    {
        "title": "Elon Musk has a great vision for what Twitter can be, says biographer Walter Isaacson",
        "author": "CNBC Television",
        "video_id": "t71ON926N1I",
        "likes": "80",
        "description": "Elon Musk biographer Walter Isaacson, history professor at Tulane University and advisory partner at Perella Weinberg Partners, joins CNBC's 'Squawk Box' to weigh in on Musk's decision to go through with his bid to buy Twitter. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/\n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "This has aged like milk left out.",
            "🤠🤠🤠🤠🤠😎😎😎😎",
            "Freedom of speech is good.",
            "This guy sounds like such a sycophant.",
            "If he let's me back on Twitter he has my appreciation"
        ]
    },
    {
        "title": "Elon Musk's hostile takeover bid for Twitter explained: World's richest man offers $54.20 a share",
        "author": "Yahoo Finance",
        "video_id": "NYyVEAde8nQ",
        "likes": "92",
        "description": "#Twitter #ElonMusk #ElonMuskTwitter #YahooFinance\nThis segment originally aired on April 14, 2022.\nYahoo Finance's Alexis Keenan breaks down Elon Musk's nontraditional hostile takeover bid for Twitter.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Success is not final, failure is not fatal: it is the courage to continue that counts! Meeting Mr Johnson was the turning point of my life, I earned 2BTC within 2months after so many failures when i was trying to trade by myself.",
            "I’d be better for mr musk to start he’s own messaging platform. The Dems which control tweeter will never allow musk to purchase tweeter.",
            "We need this man as president some day.  I know he’s from South Africa, but he has family from here, which is how John McCain, Ted Cruz, and George Romney (Mitt’s dad) were eligible to run for president despite being born in other countries.  Maybe Elon falls into the same category.",
            "elon musk wants to buy twitter to help Trump steal the next presidential election.   another bloodshed in the making.  trump & elon musk are friends …..think about it !",
            "“Hostile”"
        ]
    },
    {
        "title": "Elon Musk's X back online in Brazil after bowing to court demands | REUTERS",
        "author": "Reuters",
        "video_id": "PGoLsbkI8WU",
        "likes": "65",
        "description": "Brazil's Supreme Court cleared X to resume service in the country, after the social media platform reversed course and started complying with court rulings billionaire owner Elon Musk had previously vowed to resist.\n\n#X #Musk #ElonMusk #Brazil #supremecourt #socialmedia #socialmediaplatform #News #Business #Legal #Litigation #Technology #Tech #Reuters #Newsfeed \n\nRead the story here: https://reut.rs/3Bvj2cX\n\n👉  Subscribe: http://smarturl.it/reuterssubscribe\n\nKeep up with the latest news from around the world: https://www.reuters.com/\nFollow Reuters on Facebook: https://www.facebook.com/Reuters\nFollow Reuters on Twitter: https://twitter.com/Reuters\nFollow Reuters on Instagram: https://www.instagram.com/reuters/?hl=en",
        "top_5_comments": []
    },
    {
        "title": "Twitter users speculate whether Elon Musk will make changes at the social media platform",
        "author": "Yahoo Finance",
        "video_id": "WTKwtb1wVGU",
        "likes": "118",
        "description": "#Twitter #ElonMusk\nYahoo Finance's Akiko Fujita and Brian Cheung discuss a Yahoo Finance poll in which Twitter users weighed potential changes to Twitter after Elon Musk was appointed to the board of directors.\nOriginally aired on April 8, 2022\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Open source, Go forward mask, It's definitely gonna be a challenge, I can't wait to see who Leon musk let's go from those who have been working for Twitter, Which moderator goes 1st Kenny handle open source, Heads you're gonna fall, When that be nice the only thing you would get in trouble for on Twitter's, It's not telling the truth, Open sores.",
            "is elon working with trump to bring down twitter , then promote truth social trump alternative ?",
            "🙍“The new economic catastrophe created by Joe Biden/Boris Johnson and Europe.” Economic sanctions to Russia put in misery the economy of every country in the planet not just Russia. Welcome to the Biden shithole economy, China is in high alert; INDIA and Saudi knows that Joe Biden and the democrat can’t be trusted.\r\nYou are paying more than double for your gasoline since Joe Biden and the democrats killed the Trump economy; check the price of your food stupid. In addition, all that democrats are doing for the USA economy is just selling weapons to kill people in Ukraine. ROME (AP) — Prices for food commodities like grains and vegetable oils reached their highest levels ever last month largely because of the sanctions impose on Russia by the EU and USA the “massive supply disruptions” is, threatening millions of people in Africa, the Middle East and elsewhere with hunger and malnourishment, the United Nations said Friday",
            "Hello silly clown Donald'4 x 2 plank' Trump & Jimmy 'rapist'' Savile & by the way I had a Stroke with two weeks and its a new World record ✔.\r\n\r\nHello Elon Musk and believe me Go To Mars ✔,",
            "Bring Back Trump...Those wimps at Twitter are afraid of him?...Why?"
        ]
    },
    {
        "title": "Elon Musk may monetize the blue check mark for Twitter",
        "author": "Yahoo Finance",
        "video_id": "5JHWcZJbR6w",
        "likes": "50",
        "description": "#shorts #ElonMusk #yahoofinance \nYahoo Finance Live anchors discuss Twitter reportedly considering charging users up to $20 per month for its signature blue check mark, or becoming verified. This came in light of Elon Musk’s $44 billion acquisition of Twitter.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Once about 5,000 people who make $200,000 avg annual salary are gone…\nThat payroll savings of over 1.5 billion with benefits will be great for transforming Twtr into a lean mean profit oriented business led by a very innovative entrepreneur",
            "Imagine paying for twitter🤣🤣🤣🤣🤣🤣",
            "Huh. Interesting move charging people for something that was free. Let's see how that works out.",
            "When I saw the update, I was laughing my ass of about the changes being made to give common folk the power of speech, while removing the boys and spams and scams.\n\nCan’t wait to see what else he’s got in store, I’m really loving it so far!",
            "Credible!!!   👍🏻👍🏻 Finally!  Musk owns it, he can do as he pleases🤣🤣"
        ]
    },
    {
        "title": "Elon Musk ‘is in over his head’ with Twitter deal: MIT Initiative on Digital Economy Director",
        "author": "Yahoo Finance",
        "video_id": "MHwfkZ0cmC0",
        "likes": "40",
        "description": "#ElonMusk #Twitter #TwitterTakeover #YahooFinance\nMIT Initiative on Digital Economy Director Sinan Aral joins Yahoo Finance Live anchors Julie Hyman and Brian Sozzi to discuss expectations for Twitter under Elon Musk’s leadership, free speech on Twitter, and the outlook for the platform.\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Oh the Left is so shook .",
            "It’s not the critic that counts",
            "The stupidity of these freedom of speech comments and about mainstream media freaking out over Musk buying Twitter is amazing. Mainstream media's job is to make money, they could careless about Twitter or Musk. The fact that some of you idiots actually think mainstream media is bothered by this is on another level of stupidity. Trump lost the election, and couldn't stop crying about it, then he started making accusations that even the GOP didn't want to listen to. And all this Twitter freedom of speech nonsense, WHAT! You people are acting like you won the lotto. Effen idiots!  I only started using Twitter because Mamasan from  the Asian whorehouse in my neighbor told me I could see which ladies were available by going on Twitter. So I can careless who owns it as long Bobo is available next Monday at 12.  Also I wonder how Donnie the Don feels about Musk getting all this attention, Im heading to Costco to buy bags and bags of popcorn cause Trump will never have Musk as his overseer. LMAO LMAO",
            "Wrong! He’s not allowed to make comments about the “merger” in conjunction with the boarder.\nNice try.",
            "He won,  you lost,  get over it."
        ]
    },
    {
        "title": "Twitter says Elon Musk is presently being investigated by U.S. authorities",
        "author": "Yahoo Finance",
        "video_id": "h0gQT4KZcsc",
        "likes": "56",
        "description": "#Twitter #ElonMusk #yahoofinance \nYahoo Finance's Alexis Keenan breaks down the federal investigation on Elon Musk over Twitter deal. \nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "ex.721",
            "As always Yahoo bias.",
            "Who Wants social media being held by the government? Is t that what China does?",
            "Not one bit surprized and these same people will discover that he hung himself with a paper sheet because he was depressed, or maybe it’ll be the red scarf",
            "The democrats are behind the federal investigation lol anything to stop Elon Musk to delay him from buying it"
        ]
    },
    {
        "title": "💰 #elonmusk values Twitter at $20B 💵 #shorts",
        "author": "Yahoo Finance",
        "video_id": "c9MsnP-RB7Q",
        "likes": "95",
        "description": "Yahoo Finance Live’s Julie Hyman highlights the latest on Elon Musk and Twitter on March 27, 2023. #yahoofinance \n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#yahoofinance #finance #news #youtubeshorts #youtube #shorts #elonmusk #musk #twitter #musktwitter #valuation #stocks #stockmarket",
        "top_5_comments": [
            "Funny how Twitter never had any problems until Elon the Clown 🤡🤡🤡 took over!",
            "Maybe 300,000 000 max😢",
            "I jumped ship because Twitter is run by a maniac. 😂",
            "Maybe if the dollar collapses, a billion dollars will eventually be worth one dollar, which would make Twitter worth 250 billion.",
            "it is ok Alien Musk got lots of $."
        ]
    },
    {
        "title": "Jamie Dimon on Elon Musk and Twitter #Shorts",
        "author": "CNBC Television",
        "video_id": "8SuqaPMDS88",
        "likes": "1285",
        "description": "JPMorgan CEO Jamie Dimon appears to be a fan of Elon Musk’s $44 billion Twitter takeover. “I hope Musk cleans up Twitter,” he told CNBC’s Julianna Tatelbaum, adding he thinks Musk should look into eliminating anonymous accounts from the site.",
        "top_5_comments": [
            "Well, he's doing a great job ❤",
            "Metaverse and Atlas (world geography)  🥰🥰💜💛💚💙💝💖🌹🌹",
            "How could someone so high in corporate business be so dumb … it’s hard to fathom ..",
            "He's part of the world economic forum",
            "Jamie eating his words now.😂"
        ]
    },
    {
        "title": "Elon Musk May Be Feeling Buyer's Remorse As Twitter & Tesla Stocks Take A Dive",
        "author": "The Young Turks",
        "video_id": "sGJPTNvzGng",
        "likes": "3557",
        "description": "Times could be getting tougher for Elon Musk as shares of both Twitter and Tesla have been tanking recently, reportedly shaving off a cool $40 million from his initial investment in Twitter that could have netted him a profit of $1.1 billion. Wonder if Elon is experiencing any buyer’s remorse for jumping into his deal to buy Twitter...Cenk Uygur and Ana Kasparian discuss on The Young Turks. Watch LIVE weekdays 6-8 pm ET. http://youtube.com/theyoungturks/live\n\nRead more HERE:  \nhttps://markets.businessinsider.com/news/stocks/elon-musk-twitter-takeover-profit-loss-stock-market-crash-outlook-2022-5\n\n\"Elon Musk has seen potential gains of $1.1 billion wiped out over the past four weeks as Twitter's stock has plummeted.\n\nMusk began snapping up shares in the social media company in January, building up a 9.1% stake. Before agreeing to buy the company outright on April 14, he owned 73 million shares at an average price of $36.16.\n\nTwitter shares hit $51.70 on April 25 - which would have represented a $1.1 billion profit for Musk. But they've since fallen 31% to below $36 - turning that billion-dollar gain into a $40 million loss.\n\nTwitter fell 6% Tuesday as investors sold off social media and advertising stocks after Snap announced it would miss its second-quarter revenue target. It's fallen 28% in the last month and 18% so far this year.\"\n\n***\n\nThe largest online progressive news show in the world. Hosted by Cenk Uygur and Ana Kasparian. LIVE weekdays 6-8 pm ET. \n\nHelp support our mission and get perks. Membership protects TYT's independence from corporate ownership and allows us to provide free live shows that speak truth to power for people around the world. See Perks: ▶ https://www.youtube.com/TheYoungTurks/join\n\n\nSUBSCRIBE on YOUTUBE: ☞ http://www.youtube.com/subscription_center?add_user=theyoungturks\nFACEBOOK: ☞ http://www.facebook.com/TheYoungTurks\nTWITTER: ☞ http://www.twitter.com/TheYoungTurks\nINSTAGRAM: ☞ http://www.instagram.com/TheYoungTurks\nTWITCH: ☞ http://www.twitch.com/tyt\n\n👕 Merch: http://shoptyt.com\n\n❤ Donate: http://www.tyt.com/go\n\n🔗 Website: https://www.tyt.com\n\n📱App: http://www.tyt.com/app\n\n📬 Newsletters: https://www.tyt.com/newsletters/\n\n\nIf you want to watch more videos from TYT, consider subscribing to other channels in our network:\n\n\n\nThe Damage Report ▶ https://www.youtube.com/thedamagereport\n\nTYT Sports ▶ https://www.youtube.com/tytsports\n\nThe Conversation ▶ https://www.youtube.com/tytconversation\n\nRebel HQ ▶ https://www.youtube.com/rebelhq\n\nTYT Investigates ▶ https://www.youtube.com/channel/UCwNJt9PYyN1uyw2XhNIQMMA\n\n\n#TYT #TheYoungTurks #BreakingNews\n\n220526__TB05_Dark_Days_Musk",
        "top_5_comments": [
            "These people😅",
            "For the price that he will end up paying for Twitter, he’ll be just fine.",
            "He will be just fine.",
            "Why anyone would want to spend any time in the sewer that is Twitter is beyond me.....",
            "He could spend his $$$ to feed the world and cure diseases.\nBut being a fatcat @sshole is more important to his petty, tiny mind.\nSorry Musk worshipers."
        ]
    },
    {
        "title": "US markets regulator to probe Tesla CEO Elon Musk on Twitter stake buy | Business News",
        "author": "WION",
        "video_id": "CE9wionYOtA",
        "likes": "66",
        "description": "US regulators are investigating Elon musk's delayed disclosure of his sizeable stake in Twitter last month. He has disclosed a 9.2 percent stake in Twitter. It's a delay of at least 10 days since surpassing the 5% limit. \n\n#BusinessNews #Twitter #ElonMusk \n\nAbout Channel: \n\nWION -The World is One News, examines global issues with in-depth analysis. We provide much more than the news of the day. Our aim to empower people to explore their world. With our Global headquarters in New Delhi, we bring you news on the hour, by the hour. We deliver information that is not biased. We are journalists who are neutral to the core and non-partisan when it comes to the politics of the world. People are tired of biased reportage and we stand for a globalised united world. So for us the World is truly One.\n \nPlease keep discussions on this channel clean and respectful and refrain from using racist or sexist slurs as well as personal insults.\n\nSubscribe to our channel at https://goo.gl/JfY3NI\nCheck out our website: http://www.wionews.com\nConnect with us on our social media handles:\nFacebook: https://www.facebook.com/WIONews\nTwitter: https://twitter.com/WIONews\n\nFollow us on Google News for latest updates\n\nZee News:- https://bit.ly/2Ac5G60\nZee Bussiness:- https://bit.ly/36vI2xa\nDNA India:- https://bit.ly/2ZDuLRY\nWION: https://bit.ly/3gnDb5J\nZee News Apps : https://bit.ly/ZeeNewsApps",
        "top_5_comments": [
            "What is he😉😂😂",
            "He's a lunatic.",
            "*\"if you don't know... the Airbus & Boeing companies have become US spies... in the system an automatic destruction device is implanted... so it makes sense that many normal planes suddenly FALL or FIRE... like in Indonesia, China, Malaysia...\"*",
            "Full Fact and WEF is trying to fund stakeholders that follow their narrative to stop Musk.\nMusk, even if using Chinese funding then it must happen for the normal working class people and to try and keep some sort of free speech before classified as disinformation.",
            "The fifth column is alive and  well. However, only for those that don’t fit the narrative."
        ]
    },
    {
        "title": "Elon Musk didn't like having his private jet tracked on Twitter",
        "author": "Bloomberg Technology",
        "video_id": "icVdaVGyO4A",
        "likes": "103703",
        "description": "Did a teenage programmer influence Elon's decision to buy Twitter?\n\nOn this bonus episode of the Elon, Inc. podcast, Kurt Wagner discusses his new book, \"Battle for the Bird,\" about Twitter's corporate history and the events that led to Musk's takeover Read more: https://trib.al/eA8aYHu\n\n#technology #tesla #twitter #elonmusk #shorts \n\nLike this video? Subscribe to Bloomberg Technology on YouTube:\nhttps://www.youtube.com/channel/UCrM7B7SL_g1edFOnmj-SDKg\n \nWatch the latest full episodes of \"Bloomberg Technology\" with Caroline Hyde and Ed Ludlow here:\nhttps://www.youtube.com/playlist?list=PLfAX25ZLrPGTygCwn55voYZ_LYyKjxokJ\n \nGet the latest in tech from Silicon Valley and around the world here:\nhttps://www.bloomberg.com/technology\nConnect with us on...\nX: https://twitter.com/technology\nFacebook: https://www.facebook.com/BloombergTechnology\nInstagram: https://www.instagram.com/bloombergbusiness/\n \nFollow Ed Ludlow on X here: https://twitter.com/EdLudlow\nFollow Caroline Hyde on X here: https://twitter.com/CarolineHydeTV\n \nListen to the daily Bloomberg Technology podcast here:\nhttps://www.bloomberg.com/podcasts/series/bloomberg-technology\n \nMore from Bloomberg Business\nConnect with us on...\nX: https://twitter.com/business\nFacebook: https://www.facebook.com/bloombergbusiness\nInstagram: https://www.instagram.com/bloombergbusiness/\nLinkedIn: https://www.linkedin.com/company/bloomberg-news/\nTikTok: https://www.tiktok.com/@bloombergbusiness",
        "top_5_comments": [
            "😍",
            "As British man we don’t claim him",
            "Not just him…Taylor swift and other prior also complained",
            "Elon is for free speech without exceptions...except for if it effects him, thats different.",
            "Elon can make whatever he wants. He owns the mf"
        ]
    },
    {
        "title": "Elon Musk offered a 19-year old $5K to take down a Twitter account",
        "author": "Yahoo Finance",
        "video_id": "e1XxmvtbInk",
        "likes": "120",
        "description": "#shorts #ElonMusk #ElonMusktwitter\nElon Musk offered a 19-year old college student, Jack Sweeney, $5,000 to take down a Twitter account he made detailing Musk's private plane's whereabouts. Musk is requesting the account be removed for safety reasons. Yahoo Finance's Kelsey Barberio explains.\n\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nWatch the 2021 Berkshire Hathaway Annual Shareholders Meeting on YouTube:\nhttps://youtu.be/gx-OzwHpM9k\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Cashay.com\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "So extortion…",
            "Considering the situation with Elon musk and Twitter it's safe to say he has the money and power to just make him disappear.",
            "Elon just bought Twitter and he's probably going to delete the Son a b's account. Lol",
            "It's called extortion.  Once you open that door it's pretty hard to close.",
            "And he got himself blocked hahah ggggg"
        ]
    },
    {
        "title": "CityBiz: Market meltdown, Twitter in talks with Elon Musk",
        "author": "CityNews",
        "video_id": "7_0HraGL0y0",
        "likes": "32",
        "description": "Stocks tumble as China continues a \"COVID zero\" policy as it keeps Shanghai under strict lockdown, Twitter considers Elon Musk's takeover offer, and other business news with Mike Eppel.",
        "top_5_comments": [
            "A new Danish study (pre-printed in The Lancet) shows that mRNA vaccines offer no all-cause mortality benefits. Zero. Nada. So, let's list what the vaccines don't do: they don't stop infection or transmission and they don't reduce deaths. Using only RCT trial data from the pharma companies themselves, the pooled results from the mRNA vaccines show no discernible mortality benefit.",
            "Lol.    Done deal.    Elon bought twitter.     👍",
            "🤡🌍",
            "Love the conversation between the two everyday. Melanie💥",
            "Elon Musk provides me a cup full of salty liberal tears. Cheers 🥂"
        ]
    },
    {
        "title": "Elon Musk lines up $7.2 billion in funding for Twitter takeover",
        "author": "CNBC Television",
        "video_id": "7ot2a91mcSo",
        "likes": "144",
        "description": "Tesla CEO Elon Musk has lined up additional funding for his takeover of social media giant Twitter, according to a new filing. CNBC's 'Squawk Box' team discusses. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "The EU is a joke.",
            "The ultimate computer nerd bought a huge database. Does anyone think he’s not reading? Taking it apart? He has all the codes. This guy... The World has zero clue as to what this MAN is capable of. \nElon Musk is one of the most deliberate and focused minds that this 🌎 has ever seen.\nMore to my point on PEOPLE, energy and market. Elon Musk knows how to move PEOPLE! Into extraordinary!!! \n   Elon musk inspires our 🌎 to 2022. \nNot the 250 steps back that the human race has been taking since the last WW. \n   The US and North America has been taken over by communism. No if, ands or buts. If every American registered voter was to receive a private, mail-in, voting ballot, what would be the need for drop boxes? It’s a ludicrous question. Yet “drop boxes open May 10”, nearly a full month BEFORE THE ELECTION is boldly printed on an American State, “official voter information guide”...",
            "Elon under valued twitter??? Twitch sold for only 1 billion...",
            "\"From that time Jesus began to preach, and to say, Repent: for the kingdom of heaven is at hand.\" Matthew 4:17]",
            "The real news is the Biden family syndicate how deep does it go right CNBC you're one of them that hid it from the American people. And still don't say much about Hunters laptop you're as corrupt as the people you protect."
        ]
    },
    {
        "title": "Elon Musk plans to cut nearly 50% of Twitter jobs",
        "author": "Yahoo Finance",
        "video_id": "17vKFUskZH4",
        "likes": "182",
        "description": "#shorts #ElonMusk #Twitter #yahoofinance \nAccording to various reports, Elon Musk plans to cut nearly 50% of Twitter’s jobs and eliminate the company’s work-from-anywhere policy. Yahoo Finance Anchor Julie Hyman breaks down further details on November 3, 2022.\nLink to story: https://finance.yahoo.com/video/elon-musk-plans-eliminate-50-133228980.html\n:facebook: - https://finance.yahoo.com/video/elon-musk-plans-eliminate-50-133228980.html?ncid=facebook_yfsocialfa_wje3x23a50w\n:twitter: - https://finance.yahoo.com/video/elon-musk-plans-eliminate-50-133228980.html?acid=twitter_yfsocialtw_l1gbd0noiom\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Boycott Elon, Twitter is not more important then human lives! Buying a business for profit and destroying families and lives makes a very dark green heart for the holidays Grinch!",
            "Good get rid of all those liers.",
            "Biden fired 100k ppl. People get fired why is this news?",
            "Twitter is still running fine. Shows they were over staffed",
            "Go Elon go!"
        ]
    },
    {
        "title": "Elon Musk Becomes Twitter's Largest Shareholder",
        "author": "NBC News",
        "video_id": "AOXnvBQmLtg",
        "likes": "245",
        "description": "Tesla CEO and longtime Twitter critic Elon Musk has purchased about 9.2 percent of the social media giant, making him the company's largest shareholder. CNBC's Dominic Chu reports on Musk's passive investment in Twitter.\n» Subscribe to NBC News: http://nbcnews.to/SubscribeToNBC\n» Watch more NBC video: http://bit.ly/MoreNBCNews\n\nNBC News Digital is a collection of innovative and powerful news brands that deliver compelling, diverse and engaging news stories. NBC News Digital features NBCNews.com, MSNBC.com, TODAY.com, Nightly News, Meet the Press, Dateline, and the existing apps and digital extensions of these respective properties.  We deliver the best in breaking news, live video coverage, original journalism and segments from your favorite NBC News Shows.\n\n\nConnect with NBC News Online!\nNBC News App: https://smart.link/5d0cd9df61b80\nBreaking News Alerts: https://link.nbcnews.com/join/5cj/breaking-news-signup?cid=sm_npd_nn_yt_bn-clip_190621\nVisit NBCNews.Com: http://nbcnews.to/ReadNBC\nFind NBC News on Facebook: http://nbcnews.to/LikeNBC\nFollow NBC News on Twitter: http://nbcnews.to/FollowNBC\n\n#ElonMusk #Twitter #TeslaCEO",
        "top_5_comments": [
            "Think what you want... I promise you 10 years down the line he will turn it around and also change the world... he is capable of anything... he needs this challenge.  He's going to find a new way to connecting the dots... 200 years from now elon musk will be known for what he does right now... be it putting stickers on businesses for endorsement... maybe small business, honest reporting... whatever he will prove his point... I think we should be patient he will come up with an idea that will connect the world... in a good way... he just needs to figure it out...",
            "I'M EXPERT OF CAR🇫🇷\n\nELON MUSK :\n\nWHY YOU DON'T BUY MODEL STARIA VAN HYUNDAY ?\n\nMAKE (T) tesla AND MAKE TWO MOTOR ELECTRIQUE FOR LITTLE CONSOMATION\n\n??????\n\nWE WAIT YOU🇫🇷",
            "NBC will be next on the purchase follow by CNN , and MSNBC.",
            "I am coming back to Twitter:)",
            "Elon Musk's detractors are racist against African Americans."
        ]
    },
    {
        "title": "Twitter shareholders vote in favor of Elon Musk's takeover",
        "author": "CNBC Television",
        "video_id": "W3fCRynKFgM",
        "likes": "64",
        "description": "CNBC's Julia Boorstin reports on breaking news from Twitter. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/\n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "All things considered…these guys won! 😂😂😂😂😂",
            "twitter does all the ads? facebokk does some ads ?  bewitched? I would think elon would start a computer company called . Does he get payments from gates to stay out? too busy elsewhere? why no tv fcc?",
            "this trash twitter is worth nothing. Total discrimination on Twitter. Elon is a fool if he offers even $100.",
            "Baddie Alert",
            "like with michael jackson dad did but with a white chick.."
        ]
    },
    {
        "title": "What it's like to be Elon Musk's Sister",
        "author": "Benzinga",
        "video_id": "QJLlLbEb3ZU",
        "likes": "5515",
        "description": "Check out www.benzinga.com for complete coverage along with all the latest financial news and data!\n\nFollow us on socials: \nInstagram: https://www.instagram.com/benzinga\nFacebook: https://www.facebook.com/benzinga\nTikTok: https://www.tiktok.com/@benzinga\nTwitter: https://www.x.com/benzinga\n\nDisclaimer: Trading in financial markets involves significant risk, and there is no guarantee of profit. The information provided by any financial product or service is for educational purposes and should not be considered as financial advice. Before making any investment decisions, it's important to conduct thorough research and consult with a qualified financial advisor. Past performance is not indicative of future results. Always invest what you can afford to lose and be aware of the potential for loss in any investment strategy.\n\n#elonmusk #elon #musk #tesla #billionaire #difficult #siblings #sister #nepotism #strings #success #struggle #hardwork",
        "top_5_comments": [
            "She is beautiful and Iam sure she is very smart! Beautiful family! Myra",
            "It’s all about the upbringing they must be so proud of their children",
            "Beautiful and smart!",
            "Love your family!  Your mother is amazing!❤❤❤",
            "What a handsome family."
        ]
    },
    {
        "title": "I Saw Elon Musk Driving a Cyber Truck!! #Shorts",
        "author": "Tigran Gertz",
        "video_id": "vrs5mx8Z3W4",
        "likes": "1035294",
        "description": "",
        "top_5_comments": [
            "Was that Vivek?",
            "Stalk much ? Only one ugly \" hey I got tons of money \" truck in the world and it has to be Elon",
            "Elon \"Must\" get his vehicle back at all cost.",
            "I’m sorry the fact that I know I have the paper and credit to purchase one of these…….   ( I still don’t like how the look or shaped) I wouldn’t buy these for what 🤭",
            "Do you know people can buy Teslas trucks? You are literally so dumb. I am unlocking an unsubscribing."
        ]
    },
    {
        "title": "Elon Musk at Trump rally: ‘This is no ordinary election’ #shorts",
        "author": "Fox Business",
        "video_id": "guTgkVwXvaU",
        "likes": "997",
        "description": "Tesla CEO Elon Musk made a surprise appearance in Butler, Pennsylvania, during Trump’s highly-anticipated return to the place where his first assassination attempt happened.\n\nSubscribe to Fox Business! https://bit.ly/2D9Cdse\nWatch more Fox Business Video: https://video.foxbusiness.com\nWatch Fox Business Network Live: http://www.foxnewsgo.com/\n\nFOX Business Network (FBN) is a financial news channel delivering real-time information across all platforms that impact both Main Street and Wall Street. Headquartered in New York — the business capital of the world — FBN launched in October 2007 and is one of the leading business networks on television, having topped CNBC in Business Day viewers for the second consecutive year in 2018. The network is available in nearly 80 million homes in all markets across the United States. Owned by FOX Corporation, FBN is a unit of FOX News Media and has bureaus in Chicago, Los Angeles, and Washington, D.C.\n\nFollow Fox Business on Facebook: https://www.facebook.com/FoxBusiness\nFollow Fox Business on Twitter: https://twitter.com/foxbusiness\nFollow Fox Business on Instagram: https://www.instagram.com/foxbusiness",
        "top_5_comments": [
            "The Electoral College decides! There are  538 Electors, takes 270 Electors votes to win the Presidential Election , per Constitution of the United States.😮",
            "VOTE FOR TRUMP AND NOT THE TRAMP!!!!!!",
            "Trump/Vance 2024! 🇺🇸❤️🇺🇸❤️🇺🇸❤️🇺🇸",
            "It's a crying shame that elon is the only person that will speak at DonOLD s rallies",
            "Its a crying shame elon is the only speaker at DonOLD s rallies 😂😂😂😅😊"
        ]
    },
    {
        "title": "Elon Musk reportedly cuts Twitter's office janitorial staff",
        "author": "Yahoo Finance",
        "video_id": "PCyoBwwd1jA",
        "likes": "82",
        "description": "#Twitter #ElonMusk #yahoofinance \nYahoo Finance Live anchors Brian Sozzi and Brad Smith discuss reports that Elon Musk is looking to make additional cost cuts at Twitter.\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "These house keeping People wanted more money or they would not work. Fine don't work and go home was his answer. He ( Musk) dislikes the Unions. Look at the UAW or the Teachers Union . It does not work out . If you own the company and are paying your employees ; then your employees want the pay but do not want to work .",
            "How does he know if they are working ? You can be very portable and could be on the Beach. They are paid to work and not stay home in Bed .",
            "He should of never took that sink in.",
            "The USA talks about human rights in other countries all the time, but in fact, there are many things that are hellish in the USA.",
            "Sounds like the ideal GOP nominee for 2024"
        ]
    },
    {
        "title": "6 Times Elon Musk Moved Markets With His Tweets | Decoded | Insider News",
        "author": "Insider News",
        "video_id": "QFidun2VEIA",
        "likes": "821",
        "description": "Elon Musk's tweets move markets — from the auto industry to cryptocurrency, and even retail platforms like Etsy. We decoded six times Musk influenced the market with a tweet and what happened after.\n\nMORE INSIDER NEWS VIDEOS\nElon Musk On Putin, Nuclear Power, And Love\nhttps://youtu.be/TIAqh2o1Jf4\nMedia Activist Shares How Elon Musk Could Change Twitter | Opinion\nhttps://youtu.be/yLw-leeXzgQ\nElon Musk's Wealth Compared To Everything | Data On Data\nhttps://youtu.be/S_0geClYYJI\n\n------------------------------------------------------\n\n#elonmusk #decoded #insidernews\n\nInsider's mission is to inform and inspire. \n\nSubscribe to our channel and visit us at: https://www.insider.com/news\nInsider on Facebook: https://www.facebook.com/insider/\nInsider on Twitter: https://twitter.com/insidernews\nInsider on Instagram: https://www.instagram.com/insider/\nInsider News on Snapchat: https://www.snapchat.com/discover/News_Insider/5185974304\nInsider on TikTok: https://www.tiktok.com/@insider\n\n6 Times Elon Musk Moved Markets With His Tweets | Decoded | Insider News",
        "top_5_comments": [
            "CREEp. Enemy of UKR victims. Hey MAGA Quislings: stop your Putin boot licking or face retribution.  Help the heroic protectors of your own Democracy. Slava Ukraini! 🇨🇦🇺🇦Alright Prof.",
            "I’m so glad he’s moving markets instead of the kardashians (not hating on the K’s just sayin, right now is an important moment in time)",
            "he is annoying sperg, with a huge spergfanbase",
            "Lonely 😢",
            "再𣃚上帝"
        ]
    },
    {
        "title": "President Biden questioned on Elon Musk's Twitter acquisition",
        "author": "Yahoo Finance",
        "video_id": "20fD9OKVtdw",
        "likes": "71108",
        "description": "#shorts #yahoofinance \nPresident Biden chose his words carefully on Nov 9, 2022 after being asked whether Elon Musk should be investigated over his acquisition of Twitter and its impact on U.S. national security.\n\nDon't Miss: Valley of Hype: The Culture That Built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Anda anda that's all i would say 😂😂",
            "What a maroon",
            "Joe Biden is more of a threat than anybody and his family Elon Musk is a Visionary you sick",
            "his Interactions he has on these videos look like his microchip is malfunctioning",
            "He a threat to bidens political party, thats why he now is being \"investigated\"(intimidated).."
        ]
    },
    {
        "title": "Twitter bans journalists covering Elon Musk private jet tracker",
        "author": "Yahoo Finance",
        "video_id": "2UXakRmiyi0",
        "likes": "43",
        "description": "#Twitter #ElonMusk #yahoofinance \nYahoo Finance’s Daniel Howley joins the Live show to discuss the banning of Elon Musk’s jet-tracking Twitter account.\nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "Private For Who Not The Poeple that Buy His own  Products ?",
            "If the guy posted personally each morning where Elon's Jet was or where it landed or took off, I would consider that free speech and he should not ban.  However, in this case, Thee guy made an automated bot that posted using his personal account every time he moved. That is 'Bot Speach\",  not 'Free Speech, and we all very much want fewer bots on Twitter, don't we?",
            "This is a very clever way for yahoo journalist to cover up the fact that a guy they don’t like was being doxxed",
            "Calling them \"Journalists\" is a bit of a stretch when they constantly violate standard journalistic ethics, and regularly post their opinions as being \"News\" or \"The Truth\" instead of an editorial.",
            "Twitter is a cesspool and should be banned."
        ]
    },
    {
        "title": "Elon Musk: ‘@twitter is now more stable’ #shorts",
        "author": "Yahoo Finance",
        "video_id": "PujvZX-nRAM",
        "likes": "163",
        "description": "Tesla CEO Elon Musk responds to Twitter concerns amid transition of new CEO Linda Yaccarino at the 2023 Tesla Shareholder meeting in Texas on May 16, 2023.\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV\n\n#yahoofinance #finance #news #youtubeshorts #youtube #shorts #shortsvideo #elonmusk #elonmuskmotivation #twitter #tesla #shareholder #meeting #2023",
        "top_5_comments": [
            "No Big deal 😊",
            "He's so clueless.",
            "$pepe",
            "$BOB",
            "$Pepe"
        ]
    },
    {
        "title": "Former SEC Chair weighs in on Elon Musk's Twitter takeover bid",
        "author": "CNBC Television",
        "video_id": "kzdl2djCMlw",
        "likes": "231",
        "description": "Twitter is reevaluating Elon Musk's bid to takeover the company, according to the Wall Street Journal. Former SEC Chairman Jay Clayton joins 'Squawk Box' to discuss. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi \n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n \nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast \n \nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/ \n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "omg that really cut through the fog of tech value",
            "Why has the SEC not gone after Twitter for fraud?   If a public company claims to have 100 customers and they only have 50 that is  fraud.  This is exactly what Twitter has been doing for years.",
            "Elon is awesome, I love watching these woke tards cry.",
            "🆘 LOL! At flaming liberal Amazon founder Jeff Bezos. So should I call liberal hypocrite Jeff Bezos or I should he be called Jeff Bozo for questioning whether Twitter 🐥 will fall under the influence of the Chinese regime, hours after Tesla CEO Elon Musk secured a $44 billion buyout of the social media firm. It’s funny when Liberal Jeff Bezo purchased the Washington Post Newspaper and turned it into the liberal mouthpiece for the Democrat party, none of the fake news liberal media said a word. Fake news CNN, MSNBC, NBC, ABC, CBS, New York Times never did any criticism of Jeff Bezos purchase of the Washington Post. And they wonder why smart people now call them liberal fake news. We can call them all hypocrites as well. I think Jeff Bezos is jealous Elon Musk is smarter, has more money and better rockets then Bezos has.",
            "Dems are losing their minds that people will be able to publicly publish stories and have conversations that go against their narrative. Sorry guys, free speech is a thing. Now it will be unlocked on a major scale. Thanks Elon , for supporting our 1st amendment rights more than the politicians elected to do so. Dems, enjoy the world you voted for! Let’s go Brandon !"
        ]
    },
    {
        "title": "Twitter: Elon Musk ‘has been brilliant,’ professor says",
        "author": "Yahoo Finance",
        "video_id": "cMfMpP4eCqQ",
        "likes": "88",
        "description": "#Twitter #ElonMusk #yahoofinance \nYale School of Management Professor Jeffrey Sonnenfeld joins Yahoo Finance Live to weigh in on Elon Musk's performance so far as Twitter CEO. \nDon't Miss: Valley of Hype: The culture that built Elizabeth Holmes\nWATCH HERE:\nhttps://youtu.be/Sb179GLPNYE\n\nSubscribe to Yahoo Finance: https://yhoo.it/2fGu5Bb\n\nAbout Yahoo Finance: \nAt Yahoo Finance, you get free stock quotes, up-to-date news, portfolio management resources, international market data, social interaction and mortgage rates that help you manage your financial life.\n\nYahoo Finance Plus: With a subscription to Yahoo Finance Plus get the tools you need to invest with confidence. Discover new opportunities with expert research and investment ideas backed by technical and fundamental analysis. Optimize your trades with advanced portfolio insights, fundamental analysis, enhanced charting, and more.\nTo learn more about Yahoo Finance Plus please visit: https://yhoo.it/33jXYBp\n\nConnect with Yahoo Finance:\nGet the latest news: https://yhoo.it/2fGu5Bb\nFind Yahoo Finance on Facebook: http://bit.ly/2A9u5Zq\nFollow Yahoo Finance on Twitter: http://bit.ly/2LMgloP\nFollow Yahoo Finance on Instagram: http://bit.ly/2LOpNYz\nFollow Yahoo Finance Premium on Twitter: https://bit.ly/3hhcnmV",
        "top_5_comments": [
            "At Yale? Big deal",
            "Who is the Prof and was he paid !",
            "Elon is a fraud. Now lots more people know it. Tesla, SpaceX, etc are all going down..",
            "Next best technology??\n\nI think not.",
            "The news reader laughing at the worlds best EV maker and a guy the shoots rockets and Redlands them."
        ]
    },
    {
        "title": "Elon Musk revives deal to buy Twitter at original $44 billion price",
        "author": "CNBC Television",
        "video_id": "UqcabVTdycE",
        "likes": "70",
        "description": "Tim Higgins, tech reporter at The Wall Street Journal, joins \"The News with Shepard Smith\" to discuss Tesla CEO Elon Musk's revived bid for Twitter. For access to live and exclusive video from CNBC subscribe to CNBC PRO: https://cnb.cx/2NGeIvi\n\n» Subscribe to CNBC TV: https://cnb.cx/SubscribeCNBCtelevision\n» Subscribe to CNBC: https://cnb.cx/SubscribeCNBC\n\nTurn to CNBC TV for the latest stock market news and analysis. From market futures to live price updates CNBC is the leader in business news worldwide.\n\nThe News with Shepard Smith is CNBC’s daily news podcast providing deep, non-partisan coverage and perspective on the day’s most important stories. Available to listen by 8:30pm ET / 5:30pm PT daily beginning September 30: https://www.cnbc.com/2020/09/29/the-news-with-shepard-smith-podcast.html?__source=youtube%7Cshepsmith%7Cpodcast\n\nConnect with CNBC News Online\nGet the latest news: http://www.cnbc.com/\nFollow CNBC on LinkedIn: https://cnb.cx/LinkedInCNBC\nFollow CNBC News on Facebook: https://cnb.cx/LikeCNBC\nFollow CNBC News on Twitter: https://cnb.cx/FollowCNBC\nFollow CNBC News on Instagram: https://cnb.cx/InstagramCNBC\n\nhttps://www.cnbc.com/select/best-credit-cards/\n\n#CNBC\n#CNBCTV",
        "top_5_comments": [
            "Oooooooohhh my head hurts ! Well I guess I’ll just comment as a Karen nd keep crying what a ahhh",
            "What a crock of sh!t this reporters are doing really he will  lose case right!!! Lmao",
            "Freeeeeeeeeeeeeeeeeeeeeeedommmmmmmm",
            "He bought low, sold high and bought the shares again low.",
            "Tax him out of existence, either these people are fools or don’t know how much $300 billion is."
        ]
    }
]